[
   {
      "gradeId":"MS",
      "gradeLabel":"Middle School",
      "tocPage":47,
      "topics":[
		{
		  "topicId": "MS-PS1",
		  "topicTitle": "Matter and its Interactions",
		  "tocPage": 49,
		  "performanceExpectations": [
			{
			  "id": "MS-PS1-1",
			  "description": "Develop models to describe the atomic composition of simple molecules and extended structures.",
			  "sourcePages": [
				49
			  ],
			  "details": {
				"clarificationStatement": "Emphasis is on developing models of molecules that vary in complexity. Examples of simple molecules could include ammonia and methanol. Examples of extended structures could include sodium chloride or diamonds. Examples of molecular-level models could include drawings, 3D ball and stick structures, or computer representations showing different molecules with different types of atoms.",
				"assessmentBoundary": "Assessment does not include valence electrons and bonding energy, discussing the ionic nature of subunits of complex structures, or a complete depiction of all individual atoms in a complex molecule or extended structure.",
				"sep": [
				  {
					"id": "Developing and Using Models",
					"text": [
					  "Modeling in 6–8 builds on K–5 and progresses to developing, using and revising models to describe, test, and predict more abstract phenomena and design systems.",
					  "Develop a model to predict and/or describe phenomena. (MS-PS1-1), (MS-PS1-4)"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS1.A: Structure and Properties of Matter",
					"text": [
					  "Substances are made from different types of atoms, which combine with one another in various ways. Atoms form molecules that range in size from two to thousands of atoms. (MS-PS1-1)",
					  "Solids may be formed from molecules, or they may be extended structures with repeating subunits (e.g., crystals). (MS-PS1-1)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Scale, Proportion, and Quantity",
					"text": [
					  "Time, space, and energy phenomena can be observed at various scales using models to study systems that are too large or too small. (MS-PS1-1)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Components of the model",
				  "a Students develop models of atomic composition of simple molecules and extended structures that vary in complexity. In the models, students identify the relevant components, including:",
				  "i. Individual atoms.",
				  "ii. Molecules.",
				  "iii. Extended structures with repeating subunits.",
				  "iv. Substances (e.g., solids, liquids, and gases at the macro level).",
				  "2 Relationships",
				  "a In the model, students describe* relationships between components, including:",
				  "i. Individual atoms, from two to thousands, combine to form molecules, which can be made up of the same type or different types of atom.",
				  "ii. Some molecules can connect to each other.",
				  "iii. In some molecules, the same atoms of different elements repeat; in other molecules, the same atom of a single element repeats.",
				  "3 Connections",
				  "a Students use models to describe* that:",
				  "i. Pure substances are made up of a bulk quantity of individual atoms or molecules. Each pure substance is made up of one of the following:",
				  "1. Individual atoms of the same type that are connected to form extended structures.",
				  "2. Individual atoms of different types that repeat to form extended structures (e.g., sodium chloride).",
				  "3. Individual atoms that are not attracted to each other (e.g., helium).",
				  "4. Molecules of different types of atoms that are not attracted to each other (e.g., carbon dioxide).",
				  "5. Molecules of different types of atoms that are attracted to each other to form extended structures (e.g., sugar, nylon).",
				  "6. Molecules of the same type of atom that are not attracted to each other (e.g., oxygen).",
				  "ii. Students use the models to describe* how the behavior of bulk substances depends on their structures at atomic and molecular levels, which are too small to see."
				]
			  }
			},
			{
			  "id": "MS-PS1-2",
			  "description": "Analyze and interpret data on the properties of substances before and after the substances interact to determine if a chemical reaction has occurred.",
			  "sourcePages": [
				49
			  ],
			  "details": {
				"clarificationStatement": "Examples of reactions could include burning sugar or steel wool, fat reacting with sodium hydroxide, and mixing zinc with hydrogen chloride.",
				"assessmentBoundary": "Assessment is limited to analysis of the following properties: density, melting point, boiling point, solubility, flammability, and odor.",
				"sep": [
				  {
					"id": "Analyzing and Interpreting Data",
					"text": [
					  "Analyzing data in 6–8 builds on K–5 and progresses to extending quantitative analysis to investigations, distinguishing between correlation and causation, and basic statistical techniques of data and error analysis.",
					  "Analyze and interpret data to determine similarities and differences in findings. (MS-PS1-2)"
					]
				  },
				  {
						 "id":"Connections to the Nature of Science",
						 "text":[
							"Scientific Knowledge is Based on Empirical Evidence",
							"Science knowledge is based upon logical and conceptual connections between evidence and explanations."
					]
				  }
				],
				"dci": [
				  {
					"id": "PS1.A: Structure and Properties of Matter",
					"text": [
					  "Each pure substance has characteristic physical and chemical properties (for any bulk quantity under given conditions) that can be used to identify it. (MS-PS1-2),(MS-PS1-3)"
					]
				  },
				  {
					"id": "PS1.B: Chemical Reactions",
					"text": [
					  "Substances react chemically in characteristic ways. In a chemical process, the atoms that make up the original substances are regrouped into different molecules, and these new substances have different properties from those of the reactants. (MS-PS1-2), (MS-PS1-3), (MS-PS1-5)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Patterns",
					"text": [
					  "Macroscopic patterns are related to the nature of microscopic and atomic-level structure. (MS-PS1-2)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Organizing data",
				  "a Students organize given data about the characteristic physical and chemical properties (e.g., density, melting point, boiling point, solubility, flammability, odor) of pure substances before and after they interact.",
				  "2 Identifying relationships",
				  "a Students analyze the data to identify patterns (i.e., similarities and differences), including the changes in physical and chemical properties of each substance before and after the interaction (e.g., before the interaction, a substance burns, while after the interaction, the resulting substance does not burn).",
				  "3 Interpreting data",
				  "a Students use the analyzed data to determine whether a chemical reaction has occurred.",
				  "b Students support their interpretation of the data by describing* that the change in properties of substances is related to the rearrangement of atoms in the reactants and products in a chemical reaction (e.g., when a reaction has occurred, atoms from the substances present before the interaction must have been rearranged into new configurations, resulting in the properties of new substances)."
				]
			  }
			},
			{
			  "id": "MS-PS1-3",
			  "description": "Gather and make sense of information to describe that synthetic materials come from natural resources and impact society.",
			  "sourcePages": [
				49
			  ],
			  "details": {
				"clarificationStatement": "Emphasis is on natural resources that undergo a chemical process to form the synthetic material. Examples of new materials could include new medicine, new foods, and alternative fuels.",
				"assessmentBoundary": "Assessment is limited to qualitative information.",
				"sep": [
				  {
					"id": "Obtaining, Evaluating, and Communicating Information",
					"text": [
					  "Obtaining, evaluating, and communicating information in 6–8 builds on K–5 and progresses to evaluating the merit and validity of ideas and methods.",
					  "Gather, read, and synthesize information from multiple appropriate sources and assess the credibility, accuracy, and possible bias of each publication and methods used, and describe how they are supported or not supported by evidence. (MS-PS1-3)"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS1.A: Structure and Properties of Matter",
					"text": [
					  "Each pure substance has characteristic physical and chemical properties (for any bulk quantity under given conditions) that can be used to identify it. (MS-PS1-2),(MS-PS1-3)"
					]
				  },
				  {
					"id": "PS1.B: Chemical Reactions",
					"text": [
					  "Substances react chemically in characteristic ways. In a chemical process, the atoms that make up the original substances are regrouped into different molecules, and these new substances have different properties from those of the reactants. (MS-PS1-2), (MS-PS1-3), (MS-PS1-5)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Structure and Function",
					"text": [
					  "Structures can be designed to serve particular functions by taking into account properties of different materials, and how materials can be shaped and used. (MS-PS1-3)"
					]
				  },
				  {
					"id":"Connections to Engineering, Technology, and Applications of Science",
						 "text":[
							"Interdependence of Science, Engineering, and Technology",
							"Engineering advances have led to important discoveries in virtually every field of science, and scientific discoveries have led to the development of entire industries and engineered systems."
					]
				  },
				  {
					"id": "Connections to Engineering, Technology, and Applications of Science",
					"text": [
				  	"Influence of Science, Engineering and Technology on Society and the Natural World",
						"The uses of technologies and any limitation on their use are driven by individual or societal needs, desires, and values; by the findings of scientific research; and by differences in such factors as climate, natural resources, and economic conditions. Thus technology use varies from region to region and over time."
					]
				  }
				],
				"evidenceStatements": [
				  "1 Obtaining information",
				  "a Students obtain information from published, grade-level appropriate material from at least two sources (e.g., text, media, visual displays, data) about:",
				  "i. Synthetic materials and the natural resources from which they are derived.",
				  "ii. Chemical processes used to create synthetic materials from natural resources (e.g., burning of limestone for the production of concrete).",
				  "iii. The societal need for the synthetic material (e.g., the need for concrete as a building material).",
				  "2 Evaluating information",
				  "a Students determine and describe* whether the gathered information is relevant for determining:",
				  "i. That synthetic materials, via chemical reactions, come from natural resources.",
				  "ii. The effects of the production and use of synthetic resources on society.",
				  "b Students determine the credibility, accuracy, and possible bias of each source of information, including the ideas included and methods described.",
				  "c Students synthesize information that is presented in various modes (e.g., graphs, diagrams, photographs, text, mathematical, verbal) to describe*:",
				  "i. How synthetic materials are formed, including the natural resources and chemical processes used.",
				  "ii. The properties of the synthetic material(s) that make it different from the natural resource(s) from which it was derived.",
				  "iii. How those physical and chemical properties contribute to the function of the synthetic material.",
				  "iv. How the synthetic material satisfies a societal need or desire through the properties of its structure and function.",
				  "v. The effects of making and using synthetic materials on natural resources and society."
				]
			  }
			},
			{
			  "id": "MS-PS1-4",
			  "description": "Develop a model that predicts and describes changes in particle motion, temperature, and state of a pure substance when thermal energy is added or removed.",
			  "sourcePages": [
				49
			  ],
			  "details": {
				"clarificationStatement": "Emphasis is on qualitative molecular-level models of solids, liquids, and gases to show that adding or removing thermal energy increases or decreases kinetic energy of the particles until a change of state occurs. Examples of models could include drawings and diagrams. Examples of particles could include molecules or inert atoms. Examples of pure substances could include water, carbon dioxide, and helium.",
				"assessmentBoundary": "Assessment does not include recalling the names of specific periods and epochs and events within them.",
				"sep": [
				  {
					"id": "Developing and Using Models",
					"text": [
					  "Modeling in 6–8 builds on K–5 and progresses to developing, using and revising models to describe, test, and predict more abstract phenomena and design systems.",
					  "Develop a model to predict and/or describe phenomena. (MS-PS1-1), (MS-PS1-4)"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS1.A: Structure and Properties of Matter",
					"text": [
					  "Gases and liquids are made of molecules or inert atoms that are moving about relative to each other. (MS-PS1-4)",
					  "In a liquid, the molecules are constantly in contact with others; in a gas, they are widely spaced except when they happen to collide. In a solid, atoms are closely spaced and may vibrate in position but do not change relative locations. (MS-PS1-4)",
					  "The changes of state that occur with variations in temperature or pressure can be described and predicted using these models of matter. (MS-PS1-4)"
					]
				  },
				  {
					"id": "PS3.A: Definitions of Energy (secondary)",
					"text": [
					  "The term \"heat\" as used in everyday language refers both to thermal energy (the motion of atoms or molecules within a substance) and the transfer of that thermal energy from one object to another. In science, heat is used only for this second meaning; it refers to the energy transferred due to the temperature difference between two objects. (secondary to MS-PS1-4)",
					  "The temperature of a system is proportional to the average internal kinetic energy and potential energy per atom or molecule (whichever is the appropriate building block for the system's material). The details of that relationship depend on the type of atom or molecule and the interactions among the atoms in the material. Temperature is not a direct measure of a system's total thermal energy. The total thermal energy (sometimes called the total internal energy) of a system depends jointly on the temperature, the total number of atoms in the system, and the state of the material. (secondary to MS-PS1-4)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Cause and Effect",
					"text": [
					  "Cause and effect relationships may be used to predict phenomena in natural or designed systems. (MS-PS1-4)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Components of the model",
				  "a To make sense of a given phenomenon, students develop a model in which they identify the relevant components, including:",
				  "i. Particles, including their motion.",
				  "ii. The system within which the particles are contained.",
				  "iii. The average kinetic energy of particles in the system.",
				  "iv. Thermal energy of the system.",
				  "2 Relationships",
				  "a In the model, students describe* relationships between components, including:",
				  "i. The relationships between:",
				  "1. The motion of molecules in a system and the kinetic energy of the particles in the system.",
				  "2. The average kinetic energy of the particles and the temperature of the system.",
				  "3. The transfer of thermal energy from one system to another and:",
				  "A. A change in kinetic energy of the particles in that new system, or",
				  "B. A change in state of matter of the pure substance.",
				  "4. The state of matter of the pure substance (gas, liquid, solid) and the particle motion (freely moving and not in contact with other particles, freely moving and in loose contact with other particles, vibrating in fixed positions relative to other particles).",
				  "3 Connections",
				  "a Students use their model to provide a causal account of the relationship between the addition or removal of thermal energy from a substance and the change in the average kinetic energy of the particles in the substance.",
				  "b Students use their model to provide a causal account of the relationship between:",
				  "i. The temperature of the system.",
				  "ii. Motions of molecules in the gaseous phase.",
				  "iii. The collisions of those molecules with other materials, which exerts a force called pressure.",
				  "c Students use their model to provide a causal account of what happens when thermal energy is transferred into a system, including that:",
				  "i. An increase in kinetic energy of the particles can cause:",
				  "1. An increase in the temperature of the system as the motion of the particles relative to each other increases, or",
				  "2. A substance to change state from a solid to a liquid or from a liquid to a gas.",
				  "ii. The motion of molecules in a gaseous state increases, causing the moving molecules in the gas to have greater kinetic energy, thereby colliding with molecules in surrounding materials with greater force (i.e., the pressure of the system increases).",
				  "d Students use their model to provide a causal account of what happens when thermal energy is transferred from a substance, including that:",
				  "i. Decreased kinetic energy of the particles can cause:",
				  "1. A decrease in the temperature of the system as the motion of the particles relative to each other decreases, or",
				  "2. A substance to change state from a gas to a liquid or from a liquid to a solid.",
				  "ii. The pressure that a gas exerts decreases because the kinetic energy of the gas molecules decreases, and the slower molecules exert less force in collisions with other molecules in surrounding materials.",
				  "e Students use their model to provide a causal account for the relationship between changes in pressure of a system and changes of the states of materials in the system.",
				  "i. With a decrease in pressure, a smaller addition of thermal energy is required for particles of a liquid to change to gas because particles in the gaseous state are colliding with the surface of the liquid less frequently and exerting less force on the particles in the liquid, thereby allowing the particles in the liquid to break away and move into the gaseous state with the addition of less energy.",
				  "ii. With an increase in pressure, a greater addition of thermal energy is required for particles of a liquid to change to gas because particles in the gaseous state are colliding with the surface of the liquid more frequently and exerting greater force on the particles in the liquid, thereby limiting the movement of particles from the liquid to gaseous state."
				]
			  }
			},
			{
			  "id": "MS-PS1-5",
			  "description": "Develop and use a model to describe how the total number of atoms does not change in a chemical reaction and thus mass is conserved.",
			  "sourcePages": [
				49
			  ],
			  "details": {
				"clarificationStatement": "Emphasis is on law of conservation of matter and on physical models or drawings, including digital forms, that represent atoms.",
				"assessmentBoundary": "Assessment does not include the use of atomic masses, balancing symbolic equations, or intermolecular forces.",
				"sep": [
				  {
					"id": "Developing and Using Models",
					"text": [
					  "Modeling in 6–8 builds on K–5 and progresses to developing, using and revising models to describe, test, and predict more abstract phenomena and design systems.",
					  "Develop a model to describe unobservable mechanisms. (MS-PS1-5)"
					]
				  },
				  {
					"id": "Connections to the Nature of Science",
					"text": [
					  	"Science Models, Laws, Mechanisms, and Theories Explain Natural Phenomena",
						"Laws are regularities or mathematical descriptions of natural phenomena."
					]
				  }
				],
				"dci": [
				  {
					"id": "PS1.B: Chemical Reactions",
					"text": [
				  		"Substances react chemically in characteristic ways. In a chemical process, the atoms that make up the original substances are regrouped into different molecules, and these new substances have different properties from those of the reactants. (MS-PS1-2), (MS-PS1-3), (MS-PS1-5)",
						"The total number of each type of atom is conserved, and thus the mass does not change. (MS-PS1-5)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Energy and Matter",
					"text": [
					  "Matter is conserved because atoms are conserved in physical and chemical processes. (MS-PS1-5)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Components of the model",
				  "a To make sense of a given phenomenon, students develop a model in which they identify the relevant components for a given chemical reaction, including:",
				  "i. The types and number of molecules that make up the reactants.",
				  "ii. The types and number of molecules that make up the products.",
				  "2 Relationships",
				  "a In the model, students describe* relationships between the components, including:",
				  "i. Each molecule in each of the reactants is made up of the same type(s) and number of atoms.",
				  "ii. When a chemical reaction occurs, the atoms that make up the molecules of reactants rearrange and form new molecules (i.e., products).",
				  "iii. The number and types of atoms that make up the products are equal to the number and types of atoms that make up the reactants.",
				  "iv. Each type of atom has a specific mass, which is the same for all atoms of that type.",
				  "3 Connections",
				  "a Students use the model to describe* that the atoms that make up the reactants rearrange and come together in different arrangements to form the products of a reaction.",
				  "b Students use the model to provide a causal account that mass is conserved during chemical reactions because the number and types of atoms that are in the reactants equal the number and types of atoms that are in the products, and all atoms of the same type have the same mass regardless of the molecule in which they are found."
				]
			  }
			},
			{
			  "id": "MS-PS1-6",
			  "description": "Undertake a design project to construct, test, and modify a device that either releases or absorbs thermal energy by chemical processes.*",
			  "sourcePages": [
				49
			  ],
			  "details": {
				"clarificationStatement": "Emphasis is on the design, controlling the transfer of energy to the environment, and modification of a device using factors such as type and concentration of a substance. Examples of designs could involve chemical reactions such as dissolving ammonium chloride or calcium chloride.",
				"assessmentBoundary": "Assessment is limited to the criteria of amount, time, and temperature of substance in testing the device.",
				"sep": [
				  {
					"id": "Constructing Explanations and Designing Solutions",
					"text": [
					  "Constructing explanations and designing solutions in 6–8 builds on K–5 experiences and progresses to include constructing explanations and designing solutions supported by multiple sources of evidence consistent with scientific knowledge, principles, and theories.",
					  "Undertake a design project, engaging in the design cycle, to construct and/or implement a solution that meets specific design criteria and constraints. (MS-PS1-6)"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS1.B: Chemical Reactions",
					"text": [
					  "Some chemical reactions release energy, others store energy. (MS-PS1-6)"
					]
				  },
				  {
					"id": "ETS1.B: Developing Possible Solutions (secondary)",
					"text": [
					  "A solution needs to be tested, and then modified on the basis of the test results, in order to improve it. (secondary to MS-PS1-6)"
					]
				  },
				  {
					"id": "ETS1.C: Optimizing the Design Solution (secondary)",
					"text": [
					  "Although one design may not perform the best across all tests, identifying the characteristics of the design that performed the best in each test can provide useful information for the redesign process - that is, some of the characteristics may be incorporated into the new design. (secondary to MS-PS1-6)",
					  "The iterative process of testing the most promising solutions and modifying what is proposed on the basis of the test results leads to greater refinement and ultimately to an optimal solution. (secondary to MS-PS1-6)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Energy and Matter",
					"text": [
					  "The transfer of energy can be tracked as energy flows through a designed or natural system. (MS-PS1-6)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Using scientific knowledge to generate design solutions",
				  "a Given a problem to solve that requires either heating or cooling, students design and construct a solution (i.e., a device). In their designs, students:",
				  "i. Identify the components within the system related to the design solution, including:",
				  "1. The components within the system to or from which energy will be transferred to solve the problem.",
				  "2. The chemical reaction(s) and the substances that will be used to either release or absorb thermal energy via the device.",
				  "ii. Describe* how the transfer of thermal energy between the device and other components within the system will be tracked and used to solve the given problem.",
				  "2 Describing* criteria and constraints, including quantification when appropriate",
				  "a Students describe* the given criteria, including:",
				  "i. Features of the given problem that are to be solved by the device.",
				  "ii. The absorption or release of thermal energy by the device via a chemical reaction.",
				  "b Students describe* the given constraints, which may include:",
				  "i. Amount and cost of materials.",
				  "ii. Safety.",
				  "iii. Amount of time during which the device must function.",
				  "3 Evaluating potential solutions",
				  "a Students test the solution for its ability to solve the problem via the release or absorption of thermal energy to or from the system.",
				  "b Students use the results of their tests to systematically determine how well the design solution meets the criteria and constraints, and which characteristics of the design solution performed the best.",
				  "4 Modifying the design solution",
				  "a Students modify the design of the device based on the results of iterative testing, and improve the design relative to the criteria and constraints."
				]
			  }
			}
		  ],
		  "connections": {
			"connectionsToOtherDcisInGradeLevel": "MS.PS3.D (MS-PS1-2), (MS-PS1-6); MS.LS1.C (MS-PS1-2), (MS-PS1-5); MS.LS2.A (MS-PS1-3); MS.LS2.B (MS-PS1-5); MS.LS4.D (MS-PS1-3); MS.ESS2.A (MS-PS1-2), (MS-PS1-5); MS.ESS2.C (MS-PS1-1), (MS-PS1-4); MS.ESS3.A (MS-PS1-3); MS.ESS3.C (MS-PS1-3)",
			"articulationOfDcisAcrossGradeLevels": "5.PS1.A (MS-PS1-1); 5.PS1.B (MS-PS1-2),(MS-PS1-5); HS.PS1.A (MS-PS1-1),(MS-PS1-3),(MS-PS1-4),(MS-PS1-6); HS.PS1.B (MS-PS1-2),(MS-PS1-4),(MS-PS1-5),(MS-PS1-6); HS.PS3.A (MS-PS1-4), (MS-PS1-6); HS.PS3.B (MS-PS1-6); HS.PS3.D (MS-PS1-6); HS.LS2.A (MS-PS1-3); HS.LS4.D (MS-PS1-3); HS.ESS1.A (MS-PS1-1); HS.ESS3.A (MS-PS1-3)",
			"commonCoreStateStandards": {
			  "elaLiteracy": [
				{
				  "id": "RST.6-8.1",
				  "text": [
					"Cite specific textual evidence to support analysis of science and technical texts, attending to the precise details of explanations or descriptions (MS-PS1-2),(MS-PS1-3)"
				  ]
				},
				{
				  "id": "RST.6-8.3",
				  "text": [
					"Follow precisely a multistep procedure when carrying out experiments, taking measurements, or performing technical tasks. (MS-PS1-6)"
				  ]
				},
				{
				  "id": "RST.6-8.7",
				  "text": [
					"Integrate quantitative or technical information expressed in words in a text with a version of that information expressed visually (e.g., in a flowchart, diagram, model, graph, or table). (MS-PS1-1), (MS-PS1-2), (MS-PS1-4), (MS-PS1-5)"
				  ]
				},
				{
				  "id": "WHST.6-8.7",
				  "text": [
					"Conduct short research projects to answer a question (including a self-generated question), drawing on several sources and generating additional related, focused questions that allow for multiple avenues of exploration. (MS-PS1-6)"
				  ]
				},
				{
				  "id": "WHST.6-8.8",
				  "text": [
					"Gather relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and following a standard format for citation. (MS-PS1-3)"
				  ]
				}
			  ],
			  "mathematics": [
				{
				  "id": "MP.2",
				  "text": [
					"Reason abstractly and quantitatively. (MS-PS1-1), (MS-PS1-2), (MS-PS1-5)"
				  ]
				},
				{
				  "id": "MP.4",
				  "text": [
					"Model with mathematics. (MS-PS1-1), (MS-PS1-5)"
				  ]
				},
				{
				  "id": "6.RP.A.3",
				  "text": [
					"Use ratio and rate reasoning to solve real-world and mathematical problems. (MS-PS1-1),(MS-PS1-2),(MS-PS1-5)"
				  ]
				},
				{
				  "id": "6.NS.C.5",
				  "text": [
					"Understand that positive and negative numbers are used together to describe quantities having opposite directions or values (e.g., temperature above/below zero, elevation above/below sea level, credits/debits, positive/negative electric charge); use positive and negative numbers to represent quantities in real-world contexts, explaining the meaning of 0 in each situation. (MS-PS1-4)"
				  ]
				},
				{
				  "id": "8.EE.A.3",
				  "text": [
					"Use numbers expressed in the form of a single digit times an integer power of 10 to estimate very large or very small quantities, and to express how many times as much one is than the other. (MS-PS1-1)"
				  ]
				},
				{
				  "id": "6.SP.B.4",
				  "text": [
					"Display numerical data in plots on a number line, including dot plots, histograms, and box plots. (MS-PS1-2)"
				  ]
				},
				{
				  "id": "6.SP.B.5",
				  "text": [
					"Summarize numerical data sets in relation to their context (MS-PS1-2)"
				  ]
				}
			  ]
			}
		  }
		},
		{
		  "topicId": "MS-PS2",
		  "topicTitle": "Motion and Stability: Forces and Interactions",
		  "tocPage": 51,
		  "performanceExpectations": [
			{
			  "id": "MS-PS2-1",
			  "description": "Apply Newton's Third Law to design a solution to a problem involving the motion of two colliding objects.*",
			  "sourcePages": [
				51
			  ],
			  "details": {
				"clarificationStatement": "Examples of practical problems could include the impact of collisions between two cars, between a car and stationary objects, and between a meteor and a space vehicle.",
				"assessmentBoundary": "Assessment is limited to vertical or horizontal interactions in one dimension.",
				"sep": [
				  {
					"id": "Constructing Explanations and Designing Solutions",
					"text": [
					  "Constructing explanations and designing solutions in 6–8 builds on K–5 experiences and progresses to include constructing explanations and designing solutions supported by multiple sources of evidence consistent with scientific ideas, principles, and theories.",
					  "Apply scientific ideas or principles to design an object, tool, process or system. (MS-PS2-1)"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS2.A: Forces and Motion",
					"text": [
					  "For any pair of interacting objects, the force exerted by the first object on the second object is equal in strength to the force that the second object exerts on the first, but in the opposite direction (Newton’s third law). (MS-PS2-1)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Systems and System Models",
					"text": [
					  "Models can be used to represent systems and their interactions—such as inputs, processes and outputs—and energy and matter flows within systems. (MS-PS2-1), (MS-PS2-4)"
					]
				  },
				  {
					"id": "Connections to Engineering, Technology, and Applications of Science",
					"text": [
					  	"Influence of Science, Engineering, and Technology on Society and the Natural World",
						"The uses of technologies and any limitations on their use are driven by individual or societal needs, desires, and values; by the findings of scientific research; and by differences in such factors as climate, natural resources, and economic conditions."
					]
				  }
				],
				"evidenceStatements": [
				  "1 Using scientific knowledge to generate design solutions",
				  "a Given a problem to solve involving a collision of two objects, students design a solution (e.g., an object, tool, process, or system). In their designs, students identify and describe*:",
				  "i. The components within the system that are involved in the collision.",
				  "ii. The force that will be exerted by the first object on the second object.",
				  "iii. How Newton’s third law will be applied to design the solution to the problem.",
				  "iv. The technologies (i.e., any human-made material or device) that will be used in the solution.",
				  "2 Describing* criteria and constraints, including quantification when appropriate",
				  "a Students describe* the given criteria and constraints, including how they will be taken into account when designing the solution.",
				  "i. Students describe* how the criteria are appropriate to solve the given problem.",
				  "ii. Students describe* the constraints, which may include:",
				  "1. Cost.",
				  "2. Mass and speed of objects.",
				  "3. Time.",
				  "4. Materials.",
				  "3 Evaluating potential solutions",
				  "a Students use their knowledge of Newton’s third law to systematically determine how well the design solution meets the criteria and constraints.",
				  "b Students identify the value of the device for society.",
				  "c Students determine how the choice of technologies that are used in the design is affected by the constraints of the problem and the limits of technological advances."
				]
			  }
			},
			{
			  "id": "MS-PS2-2",
			  "description": "Plan an investigation to provide evidence that the change in an object's motion depends on the sum of the forces on the object and the mass of the object.",
			  "sourcePages": [
				51
			  ],
			  "details": {
				"clarificationStatement": "Emphasis is on balanced (Newton's First Law) and unbalanced forces in a system, qualitative comparisons of forces, mass and changes in motion (Newton's Second Law), frame of reference, and specification of units.",
				"assessmentBoundary": "Assessment is limited to forces and changes in motion in one-dimension in an inertial reference frame and to change in one variable at a time. Assessment does not include the use of trigonometry.",
				"sep": [
				  {
					"id": "Planning and Carrying Out Investigations",
					"text": [
					  "Planning and carrying out investigations to answer questions or test solutions to problems in 6–8 builds on K–5 experiences and progresses to include investigations that use multiple variables and provide evidence to support explanations or design solutions.",
					  "Plan an investigation individually and collaboratively, and in the design: identify independent and dependent variables and controls, what tools are needed to do the gathering, how measurements will be recorded, and how many data are needed to support a claim. (MS-PS2-2)"
					]
				  },
				  {
							 "id":"Connections to the Nature of Science",
						 "text":[
							"Scientific Knowledge is Based on Empirical Evidence",
							"Science knowledge is based upon logical and conceptual connections between evidence and explanations."
					]
				  }
				],
				"dci": [
				  {
					"id": "PS2.A: Forces and Motion",
					"text": [
					  "The motion of an object is determined by the sum of the forces acting on it; if the total force on the object is not zero, its motion will change. The greater the mass of the object, the greater the force needed to achieve the same change in motion. For any given object, a larger force causes a larger change in motion. (MS-PS2-2)",
					  "All positions of objects and the directions of forces and motions must be described in an arbitrarily chosen reference frame and arbitrarily chosen units of size. In order to share information with other people, these choices must also be shared. (MS-PS2-2)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Stability and Change",
					"text": [
					  "Explanations of stability and change in natural or designed systems can be constructed by examining the changes over time and forces at different scales. (MS-PS2-2)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Identifying the phenomenon to be investigated",
				  "a Students identify the phenomenon under investigation, which includes the change in motion of an object.",
				  "b Students identify the purpose of the investigation, which includes providing evidence that the change in an object’s motion is due to the following factors:",
				  "i. Balanced or unbalanced forces acting on the object.",
				  "ii. The mass of the object.",
				  "2 Identifying the evidence to address the purpose of the investigation",
				  "a Students develop a plan for the investigation individually or collaboratively. In the plan, students describe*:",
				  "i. That the following data will be collected:",
				  "1. Data on the motion of the object.",
				  "2. Data on the total forces acting on the object.",
				  "3. Data on the mass of the object.",
				  "ii. Which data are needed to provide evidence for each of the following:",
				  "1. An object subjected to balanced forces does not change its motion (sum of F=0).",
				  "2. An object subjected to unbalanced forces changes its motion over time (sum of F≠0).",
				  "3. The change in the motion of an object subjected to unbalanced forces depends on the mass of the object.",
				  "3 Planning the investigation",
				  "a In the investigation plan, students describe*:",
				  "i. How the following factors will be determined and measured:",
				  "1. The motion of the object, including a specified reference frame and appropriate units for distance and time.",
				  "2. The mass of the object, including appropriate units.",
				  "3. The forces acting on the object, including balanced and unbalanced forces.",
				  "ii. Which factors will serve as independent and dependent variables in the investigation (e.g., mass is an independent variable, forces and motion can be independent or dependent).",
				  "iii. The controls for each experimental condition.",
				  "iv. The number of trials for each experimental condition."
				]
			  }
			},
			{
			  "id": "MS-PS2-3",
			  "description": "Ask questions about data to determine the factors that affect the strength of electric and magnetic forces.",
			  "sourcePages": [
				51
			  ],
			  "details": {
				"clarificationStatement": "Examples of devices that use electric and magnetic forces could include electromagnets, electric motors, or generators. Examples of data could include the effect of the number of turns of wire on the strength of an electromagnet, or the effect of increasing the number or strength of magnets on the speed of an electric motor.",
				"assessmentBoundary": "Assessment about questions that require quantitative answers is limited to proportional reasoning and algebraic thinking.",
				"sep": [
				  {
					"id": "Asking Questions and Defining Problems",
					"text": [
					  "Asking questions and defining problems in grades 6–8 builds from grades K–5 experiences and progresses to specifying relationships between variables, and clarifying arguments and models.",
					  "Ask questions that can be investigated within the scope of the classroom, outdoor environment, and museums and other public facilities with available resources and, when appropriate, frame a hypothesis based on observations and scientific principles. (MS-PS2-3)"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS2.B: Types of Interactions",
					"text": [
					  "Electric and magnetic (electromagnetic) forces can be attractive or repulsive, and their sizes depend on the magnitudes of the charges, currents, or magnetic strengths involved and on the distances between the interacting objects. (MS-PS2-3)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Cause and Effect",
					"text": [
					  "Cause and effect relationships may be used to predict phenomena in natural or designed systems. (MS-PS2-3), (MS-PS2-5)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Addressing phenomena of the natural world or scientific theories",
				  "a Students formulate questions that arise from examining given data of objects (which can include particles) interacting through electric and magnetic forces, the answers to which would clarify:",
				  "i. The cause-and-effect relationships that affect magnetic forces due to:",
				  "1. The magnitude of any electric current present in the interaction, or other factors related to the effect of the electric current (e.g., number of turns of wire in a coil).",
				  "2. The distance between the interacting objects.",
				  "3. The relative orientation of the interacting objects.",
				  "4. The magnitude of the magnetic strength of the interacting objects.",
				  "ii. The cause-and-effect relationship that affect electric forces due to:",
				  "1. The magnitude and signs of the electric charges on the interacting objects.",
				  "2. The distances between the interacting objects.",
				  "3. Magnetic forces.",
				  "b Based on scientific principles and given data, students frame hypotheses that:",
				  "i. Can be used to predict the strength of electric and magnetic forces due to cause-and-effect relationships.",
				  "ii. Can be used to distinguish between possible outcomes, based on an understanding of the cause-and-effect relationships driving the system.",
				  "2 Identifying the scientific nature of the question",
				  "a Students’ questions can be investigated scientifically within the scope of a classroom, outdoor environment, museum, or other public facility."
				]
			  }
			},
			{
			  "id": "MS-PS2-4",
			  "description": "Construct and present arguments using evidence to support the claim that gravitational interactions are attractive and depend on the masses of interacting objects.",
			  "sourcePages": [
				51
			  ],
			  "details": {
				"clarificationStatement": "Examples of evidence for arguments could include data generated from simulations or digital tools; and charts displaying mass, strength of interaction, distance from the Sun, and orbital periods of objects within the solar system.",
				"assessmentBoundary": "Assessment does not include Newton's Law of Gravitation or Kepler's Laws.",
				"sep": [
				  {
					"id": "Engaging in Argument from Evidence",
					"text": [
					  "Engaging in argument from evidence in 6–8 builds from K–5 experiences and progresses to constructing a convincing argument that supports or refutes claims for either explanations or solutions about the natural and designed world.",
					  "Construct and present oral and written arguments supported by empirical evidence and scientific reasoning to support or refute an explanation or a model for a phenomenon or a solution to a problem. (MS-PS2-4)"
					]
				  },
				  {
					 "id":"Connections to the Nature of Science",
					 "text":[
						"Scientific Knowledge is Based on Empirical Evidence",
						"Science knowledge is based upon logical and conceptual connections between evidence and explanations."
					]
				  }
				],
				"dci": [
				  {
					"id": "PS2.B: Types of Interactions",
					"text": [
					  "Gravitational forces are always attractive. There is a gravitational force between any two masses, but it is very small except when one or both of the objects have large mass—e.g., Earth and the sun. (MS-PS2-4)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Systems and System Models",
					"text": [
					  "Models can be used to represent systems and their interactions—such as inputs, processes and outputs—and energy and matter flows within systems. (MS-PS2-1), (MS-PS2-4)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Supported claims",
				  "a Students make a claim to be supported about a given phenomenon. In their claim, students include the following idea: Gravitational interactions are attractive and depend on the masses of interacting objects.",
				  "2 Identifying scientific evidence",
				  "a Students identify and describe* the given evidence that supports the claim, including:",
				  "i. The masses of objects in the relevant system(s).",
				  "ii. The relative magnitude and direction of the forces between objects in the relevant system(s).",
				  "3 Evaluating and critiquing the evidence",
				  "a Students evaluate the evidence and identify its strengths and weaknesses, including:",
				  "i. Types of sources.",
				  "ii. Sufficiency, including validity and reliability, of the evidence to make and defend the claim.",
				  "iii. Any alternative interpretations of the evidence, and why the evidence supports the given claim as opposed to any other claims.",
				  "4 Reasoning and synthesis",
				  "a Students use reasoning to connect the appropriate evidence about the forces on objects and construct the argument that gravitational forces are attractive and mass dependent. Students describe* the following chain of reasoning:",
				  "i. Systems of objects can be modeled as a set of masses interacting via gravitational forces.",
				  "ii. In systems of objects, larger masses experience and exert proportionally larger gravitational forces.",
				  "iii. In every case for which evidence exists, gravitational force is attractive.",
				  "b To support the claim, students present their oral or written argument concerning the direction of gravitational forces and the role of the mass of the interacting objects."
				]
			  }
			},
			{
			  "id": "MS-PS2-5",
			  "description": "Conduct an investigation and evaluate the experimental design to provide evidence that fields exist between objects exerting forces on each other even though the objects are not in contact.",
			  "sourcePages": [
				51
			  ],
			  "details": {
				"clarificationStatement": "Examples of this phenomenon could include the interactions of magnets, electrically-charged strips of tape, and electrically-charged pith balls. Examples of investigations could include first-hand experiences or simulations.",
				"assessmentBoundary": "Assessment is limited to electric and magnetic fields, and limited to qualitative evidence for the existence of fields.",
				"sep": [
				  {
					"id": "Planning and Carrying Out Investigations",
					"text": [
					  "Planning and carrying out investigations to answer questions or test solutions to problems in 6–8 builds on K–5 experiences and progresses to include investigations that use multiple variables and provide evidence to support explanations or design solutions.",
					  "Conduct an investigation and evaluate the experimental design to produce data to serve as the basis for evidence that can meet the goals of the investigation. (MS-PS2-5)"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS2.B: Types of Interactions",
					"text": [
					  "Forces that act at a distance (electric, magnetic, and gravitational) can be explained by fields that extend through space and can be mapped by their effect on a test object (a charged object, or a ball, respectively). (MS-PS2-5)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Cause and Effect",
					"text": [
					  "Cause and effect relationships may be used to predict phenomena in natural or designed systems. (MS-PS2-3), (MS-PS2-5)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Identifying the phenomenon to be investigated",
				  "a From the given investigation plan, students identify the phenomenon under investigation, which includes the idea that objects can interact at a distance.",
				  "b Students identify the purpose of the investigation, which includes providing evidence that fields exist between objects exerting forces on each other even though the objects are not in contact.",
				  "2 Identifying evidence to address the purpose of the investigation",
				  "a From the given plan, students identify and describe* the data that will be collected to provide evidence for each of the following:",
				  "i. Evidence that two interacting objects can exert forces on each other even though the two interacting objects are not in contact with each other.",
				  "ii. Evidence that distinguishes between electric and magnetic forces.",
				  "iii. Evidence that the cause of a force on one object is the interaction with the second object (e.g., evidence for the presence of force disappears when the second object is removed from the vicinity of the first).",
				  "3 Planning the investigation",
				  "a Students describe* the rationale for why the given investigation plan includes:",
				  "i. Changing the distance between objects.",
				  "ii. Changing the charge or magnetic orientation of objects.",
				  "iii. Changing the magnitude of the charge on an object or the strength of the magnetic field.",
				  "iv. A means to indicate or measure the presence of electric or magnetic forces.",
				  "4 Collecting the data",
				  "a Students make and record observations according to the given plan. The data recorded may include observations of:",
				  "i. Motion of objects.",
				  "ii. Suspension of objects.",
				  "iii. Simulations of objects that produce either electric or magnetic fields through space and the effects of moving those objects closer to or farther away from each other.",
				  "iv. A push or pull exerted on the hand of an observer holding an object.",
				  "5 Evaluation of the design",
				  "a Students evaluate the experimental design by assessing whether or not the data produced by the investigation can provide evidence that fields exist between objects that act on each other even though the objects are not in contact."
				]
			  }
			}
		  ],
		  "connections": {
			"connectionsToOtherDcisInGradeLevel": "MS.PS3.A (MS-PS2-2); MS.PS3.B (MS-PS2-2); MS.PS3.C (MS-PS2-1); MS.ESS1.A (MS-PS2-4); MS.ESS1.B (MS-PS2-4); MS.ESS2.C (MS-PS2-2), (MS-PS2-4)",
			"articulationOfDcisAcrossGradeLevels": "3.PS2.A (MS-PS2-1), (MS-PS2-2); 3.PS2.B (MS-PS2-3), (MS-PS2-5); 5.PS2.B (MS-PS2-4); HS.PS2.A (MS-PS2-1), (MS-PS2-2); HS.PS2.B (MS-PS2-3),(MS-PS2-4), (MS-PS2-5); HS.PS3.A (MS-PS2-5); HS.PS3.B (MS-PS2-2), (MS-PS2-5); HS.PS3.C (MS-PS2-5); HS.ESS1.B (MS-PS2-2), (MS-PS2-4)",
			"commonCoreStateStandards": {
			  "elaLiteracy": [
				{
				  "id": "RST.6-8.1",
				  "text": [
					"Cite specific textual evidence to support analysis of science and technical texts, attending to the precise details of explanations or descriptions (MS-PS2-1),(MS-PS2-3)"
				  ]
				},
				{
				  "id": "RST.6-8.3",
				  "text": [
					"Follow precisely a multistep procedure when carrying out experiments, taking measurements, or performing technical tasks. (MS-PS2-1), (MS-PS2-2), (MS-PS2-5)"
				  ]
				},
				{
				  "id": "WHST.6-8.1",
				  "text": [
					"Write arguments focused on discipline-specific content. (MS-PS2-4)"
				  ]
				},
				{
				  "id": "WHST.6-8.7",
				  "text": [
					"Conduct short research projects to answer a question (including a self-generated question), drawing on several sources and generating additional related, focused questions that allow for multiple avenues of exploration. (MS-PS2-1), (MS-PS2-2), (MS-PS2-5)"
				  ]
				}
			  ],
			  "mathematics": [
				{
				  "id": "MP.2",
				  "text": [
					"Reason abstractly and quantitatively. (MS-PS2-1), (MS-PS2-2),(MS-PS2-3)"
				  ]
				},
				{
				  "id": "6.NS.C.5",
				  "text": [
					"Understand that positive and negative numbers are used together to describe quantities having opposite directions or values; use positive and negative numbers to represent quantities in real-world contexts, explaining the meaning of 0 in each situation. (MS-PS2-1)"
				  ]
				},
				{
				  "id": "6.EE.A.2",
				  "text": [
					"Write, read, and evaluate expressions in which letters stand for numbers. (MS-PS2-1), (MS-PS2-2)"
				  ]
				},
				{
				  "id": "7.EE.B.3",
				  "text": [
					"Solve multi-step real-life and mathematical problems posed with positive and negative rational numbers in any form, using tools strategically. Apply properties of operations to calculate with numbers in any form; convert between forms as appropriate; and assess the reasonableness of answers using mental computation and estimation strategies. (MS-PS2-1),(MS-PS2-2)"
				  ]
				},
				{
				  "id": "7.EE.B.4",
				  "text": [
					"Use variables to represent quantities in a real-world or mathematical problem, and construct simple equations and inequalities to solve problems by reasoning about the quantities. (MS-PS2-1),(MS-PS2-2)"
				  ]
				}
			  ]
			}
		  }
		},
		{
		  "topicId": "MS-PS3",
		  "topicTitle": "Energy",
		  "tocPage": 53,
		  "performanceExpectations": [
			{
			  "id": "MS-PS3-1",
			  "description": "Construct and interpret graphical displays of data to describe the relationships of kinetic energy to the mass of an object and to the speed of an object.",
			  "sourcePages": [
				53
			  ],
			  "details": {
				"clarificationStatement": "Emphasis is on descriptive relationships between kinetic energy and mass separately from kinetic energy and speed. Examples could include riding a bicycle at different speeds, rolling different sizes of rocks downhill, and getting hit by a wiffle ball versus a tennis ball.",
				"assessmentBoundary": null,
				"sep": [
				  {
					"id": "Analyzing and Interpreting Data",
					"text": [
					  "Analyzing data in 6–8 builds on K–5 and progresses to extending quantitative analysis to investigations, distinguishing between correlation and causation, and basic statistical techniques of data and error analysis.",
					  "Construct and interpret graphical displays of data to identify linear and nonlinear relationships. (MS-PS3-1)"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS3.A: Definitions of Energy",
					"text": [
					  "Motion energy is properly called kinetic energy; it is proportional to the mass of the moving object and grows with the square of its speed. (MS-PS3-1)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Scale, Proportion, and Quantity",
					"text": [
					  "Proportional relationships (e.g. speed as the ratio of distance traveled to time taken) among different types of quantities provide information about the magnitude of properties and processes. (MS-PS3-1), (MS-PS3-4)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Organizing data",
				  "a Students use graphical displays to organize the following given data:",
				  "i. Mass of the object.",
				  "ii. Speed of the object.",
				  "iii. Kinetic energy of the object.",
				  "b Students organize the data in a way that facilitates analysis and interpretation.",
				  "2 Identifying relationships",
				  "a Using the graphical display, students identify that kinetic energy:",
				  "i. Increases if either the mass or the speed of the object increases or if both increase.",
				  "ii. Decreases if either the mass or the speed of the object decreases or if both decrease.",
				  "3 Interpreting data",
				  "a Using the analyzed data, students describe*:",
				  "i. The relationship between kinetic energy and mass as a linear proportional relationship (KE ∝ m) in which:",
				  "1. The kinetic energy doubles as the mass of the object doubles.",
				  "2. The kinetic energy halves as the mass of the object halves.",
				  "ii. The relationship between kinetic energy and speed as a nonlinear (square) proportional relationship (KE ∝ v2) in which:",
				  "1. The kinetic energy quadruples as the speed of the object doubles.",
				  "2. The kinetic energy decreases by a factor of four as the speed of the object is cut in half."
				]
			  }
			},
			{
			  "id": "MS-PS3-2",
			  "description": "Develop a model to describe that when the arrangement of objects interacting at a distance changes, different amounts of potential energy are stored in the system.",
			  "sourcePages": [
				53
			  ],
			  "details": {
				"clarificationStatement": "Emphasis is on relative amounts of potential energy, not on calculations of potential energy. Examples of objects within systems interacting at varying distances could include: the Earth and either a roller coaster cart at varying positions on a hill or objects at varying heights on shelves, changing the direction/orientation of a magnet, and a balloon with static electrical charge being brought closer to a classmate’s hair. Examples of models could include representations, diagrams, pictures, and written descriptions of systems.",
				"assessmentBoundary": "Assessment is limited to two objects and electric, magnetic, and gravitational interactions.",
				"sep": [
				  {
					"id": "Developing and Using Models",
					"text": [
					  "Modeling in 6–8 builds on K–5 and progresses to developing, using and revising models to describe, test, and predict more abstract phenomena and design systems.",
					  "Develop a model to describe unobservable mechanisms. (MS-PS3-2)"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS3.A: Definitions of Energy",
					"text": [
					  "A system of objects may also contain stored (potential) energy, depending on their relative positions. (MS-PS3-2)"
					]
				  },
				  {
					"id": "PS3.C: Relationship Between Energy and Forces",
					"text": [
					  "When two objects interact, each one exerts a force on the other that can cause energy to be transferred to or from the object. (MS-PS3-2)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Systems and System Models",
					"text": [
					  "Models can be used to represent systems and their interactions – such as inputs, processes, and outputs – and energy and matter flows within systems. (MS-PS3-2)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Components of the model",
				  "a To make sense of a given phenomenon involving two objects interacting at a distance, students develop a model in which they identify the relevant components, including:",
				  "i. A system of two stationary objects that interact.",
				  "ii. Forces (electric, magnetic, or gravitational) through which the two objects interact.",
				  "iii. Distance between the two objects.",
				  "iv. Potential energy.",
				  "2 Relationships",
				  "a In the model, students identify and describe* relationships between components, including:",
				  "i. When two objects interact at a distance, each one exerts a force on the other that can cause energy to be transferred to or from an object.",
				  "ii. As the relative position of two objects (neutral, charged, magnetic) changes, the potential energy of the system (associated with interactions via electric, magnetic, and gravitational forces) changes (e.g., when a ball is raised, energy is stored in the gravitational interaction between the Earth and the ball).",
				  "3 Connections",
				  "a Students use the model to provide a causal account for the idea that the amount of potential energy in a system of objects changes when the distance between stationary objects interacting in the system changes because:",
				  "i. A force has to be applied to move two attracting objects farther apart, transferring energy to the system.",
				  "ii. A force has to be applied to move two repelling objects closer together, transferring energy to the system."
				]
			  }
			},
			{
			  "id": "MS-PS3-3",
			  "description": "Apply scientific principles to design, construct, and test a device that either minimizes or maximizes thermal energy transfer.*",
			  "sourcePages": [
				53
			  ],
			  "details": {
				"clarificationStatement": "Examples of devices could include an insulated box, a solar cooker, and a Styrofoam cup.",
				"assessmentBoundary": "Assessment does not include calculating the total amount of thermal energy transferred.",
				"sep": [
				  {
					"id": "Constructing Explanations and Designing Solutions",
					"text": [
					  "Constructing explanations and designing solutions in 6–8 builds on K–5 experiences and progresses to include constructing explanations and designing solutions supported by multiple sources of evidence consistent with scientific ideas, principles, and theories.",
					  "Apply scientific ideas or principles to design, construct, and test a design of an object, tool, process or system. (MS-PS3-3)"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS3.A: Definitions of Energy",
					"text": [
					  "Temperature is a measure of the average kinetic energy of particles of matter. The relationship between the temperature and the total energy of a system depends on the types, states, and amounts of matter present. (MS-PS3-3), (MS-PS3-4)"
					]
				  },
				  {
					"id": "PS3.B: Conservation of Energy and Energy Transfer",
					"text": [
					  "Energy is spontaneously transferred out of hotter regions or objects and into colder ones. (MS-PS3-3)"
					]
				  },
				  {
					"id": "ETS1.A: Defining and Delimiting an Engineering Problem (secondary)",
					"text": [
					  "The more precisely a design task’s criteria and constraints can be defined, the more likely it is that the designed solution will be successful. Specification of constraints includes consideration of scientific principles and other relevant knowledge that is likely to limit possible solutions.(secondary to MS-PS3-3)"
					]
				  },
				  {
					"id": "ETS1.B: Developing Possible Solutions (secondary)",
					"text": [
					  "A solution needs to be tested, and then modified on the basis of the test results in order to improve it.",
					  "There are systematic processes for evaluating solutions with respect to how well they meet criteria and constraints of a problem. (secondary to MS-PS3-3)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Energy and Matter",
					"text": [
					  "The transfer of energy can be tracked as energy flows through a designed or natural system. (MS-PS3-3)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Using scientific knowledge to generate design solutions",
				  "a Given a problem to solve that requires either minimizing or maximizing thermal energy transfer, students design and build a solution to the problem. In the designs, students:",
				  "i. Identify that thermal energy is transferred from hotter objects to colder objects.",
				  "ii. Describe* different types of materials used in the design solution and their properties (e.g., thickness, heat conductivity, reflectivity) and how these materials will be used to minimize or maximize thermal energy transfer.",
				  "iii. Specify how the device will solve the problem.",
				  "2 Describing* criteria and constraints, including quantification when appropriate",
				  "a Students describe* the given criteria and constraints that will be taken into account in the design solution:",
				  "i. Students describe* criteria, including:",
				  "1. The minimum or maximum temperature difference that the device is required to maintain.",
				  "2. The amount of time that the device is required to maintain this difference.",
				  "3. Whether the device is intended to maximize or minimize the transfer of thermal energy.",
				  "ii. Students describe* constraints, which may include:",
				  "1. Materials.",
				  "2. Safety.",
				  "3. Time.",
				  "4. Cost.",
				  "3 Evaluating potential solutions",
				  "a Students test the device to determine its ability to maximize or minimize the flow of thermal energy, using the rate of temperature change as a measure of success.",
				  "b Students use their knowledge of thermal energy transfer and the results of the testing to evaluate the design systematically against the criteria and constraints."
				]
			  }
			},
			{
			  "id": "MS-PS3-4",
			  "description": "Plan an investigation to determine the relationships among the energy transferred, the type of matter, the mass, and the change in the average kinetic energy of the particles as measured by the temperature of the sample.",
			  "sourcePages": [
				53
			  ],
			  "details": {
				"clarificationStatement": "Examples of experiments could include comparing final water temperatures after different masses of ice melted in the same volume of water with the same initial temperature, the temperature change of samples of different materials with the same mass as they cool or heat in the environment, or the same material with different masses when a specific amount of energy is added.",
				"assessmentBoundary": "Assessment does not include calculating the total amount of thermal energy transferred.",
				"sep": [
				  {
					"id": "Planning and Carrying Out Investigations",
					"text": [
					  "Planning and carrying out investigations to answer questions or test solutions to problems in 6–8 builds on K–5 experiences and progresses to include investigations that use multiple variables and provide evidence to support explanations or design solutions.",
					  "Plan an investigation individually and collaboratively, and in the design: identify independent and dependent variables and controls, what tools are needed to do the gathering, how measurements will be recorded, and how many data are needed to support a claim. (MS-PS3-4)"
					]
				  },
				  {
					"id":"Connections to the Nature of Science",
					 "text":[
						"Scientific Knowledge is Based on Empirical Evidence",
						"Science knowledge is based upon logical and conceptual connections between evidence and explanations"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS3.A: Definitions of Energy",
					"text": [
					  "Temperature is a measure of the average kinetic energy of particles of matter. The relationship between the temperature and the total energy of a system depends on the types, states, and amounts of matter present. (MS-PS3-3), (MS-PS3-4)"
					]
				  },
				  {
					"id": "PS3.B: Conservation of Energy and Energy Transfer",
					"text": [
					  "The amount of energy transfer needed to change the temperature of a matter sample by a given amount depends on the nature of the matter, the size of the sample, and the environment. (MS-PS3-4)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Scale, Proportion, and Quantity",
					"text": [
					  "Proportional relationships (e.g. speed as the ratio of distance traveled to time taken) among different types of quantities provide information about the magnitude of properties and processes. (MS-PS3-1), (MS-PS3-4)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Identifying the phenomenon under investigation",
				  "a Students identify the phenomenon under investigation involving thermal energy transfer.",
				  "b Students describe* the purpose of the investigation, including determining the relationships among the following factors:",
				  "i. The transfer of thermal energy.",
				  "ii. The type of matter.",
				  "iii. The mass of the matter involved in thermal energy transfer.",
				  "iv. The change in the average kinetic energy of the particles.",
				  "2 Identifying the evidence to address the purpose of the investigation",
				  "a Individually or collaboratively, students develop an investigation plan that describes* the data to be collected and the evidence to be derived from the data, including:",
				  "i. That the following data are to be collected:",
				  "1. Initial and final temperatures of the materials used in the investigation.",
				  "2. Types of matter used in the investigation.",
				  "3. Mass of matter used in the investigation.",
				  "ii. How the collected data will be used to:",
				  "1. Provide evidence of proportional relationships between changes in temperature of materials and the mass of those materials.",
				  "2. Relate the changes in temperature in the sample to the types of matter and to the change in the average kinetic energy of the particles.",
				  "3 Planning the investigation",
				  "a In the investigation plan, students describe*:",
				  "i. How the mass of the materials are to be measured and in what units.",
				  "ii. How and when the temperatures of the materials are to be measured and in what units.",
				  "iii. Details of the experimental conditions that will allow the appropriate data to be collected to address the purpose of the investigation (e.g., time between temperature measurements, amounts of sample used, types of materials used), including appropriate independent and dependent variables and controls."
				]
			  }
			},
			{
			  "id": "MS-PS3-5",
			  "description": "Construct, use, and present arguments to support the claim that when the kinetic energy of an object changes, energy is transferred to or from the object.",
			  "sourcePages": [
				53
			  ],
			  "details": {
				"clarificationStatement": "Examples of empirical evidence used in arguments could include an inventory or other representation of the energy before and after the transfer in the form of temperature changes or motion of object.",
				"assessmentBoundary": "Assessment does not include calculations of energy.",
				"sep": [
				  {
					"id": "Engaging in Argument from Evidence",
					"text": [
					  "Engaging in argument from evidence in 6–8 builds on K–5 experiences and progresses to constructing a convincing argument that supports or refutes claims for either explanations or solutions about the natural and designed worlds.",
					  "Construct, use, and present oral and written arguments supported by empirical evidence and scientific reasoning to support or refute an explanation or a model for a phenomenon. (MS-PS3-5)"
					]
				  },
				  {
					"id":"Connections to the Nature of Science",
					 "text":[
						"Scientific Knowledge is Based on Empirical Evidence",
						"Science knowledge is based upon logical and conceptual connections between evidence and explanations"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS3.B: Conservation of Energy and Energy Transfer",
					"text": [
					  "When the motion energy of an object changes, there is inevitably some other change in energy at the same time. (MS-PS3-5)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Energy and Matter",
					"text": [
					  "Energy may take different forms (e.g. energy in fields, thermal energy, energy of motion). (MS-PS3-5)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Supported claims",
				  "a Students make a claim about a given explanation or model for a phenomenon. In their claim, students include idea that when the kinetic energy of an object changes, energy is transferred to or from that object.",
				  "2 Identifying scientific evidence",
				  "a Students identify and describe* the given evidence that supports the claim, including the following when appropriate:",
				  "i. The change in observable features (e.g., motion, temperature, sound) of an object before and after the interaction that changes the kinetic energy of the object.",
				  "ii. The change in observable features of other objects or the surroundings in the defined system.",
				  "3 Evaluating and critiquing the evidence",
				  "a Students evaluate the evidence and identify its strengths and weaknesses, including:",
				  "i. Types of sources.",
				  "ii. Sufficiency, including validity and reliability, of the evidence to make and defend the claim.",
				  "iii. Any alternative interpretations of the evidence and why the evidence supports the given claim as opposed to any other claims.",
				  "4 Reasoning and synthesis",
				  "a Students use reasoning to connect the necessary and sufficient evidence and construct the argument. Students describe* a chain of reasoning that includes:",
				  "i. Based on changes in the observable features of the object (e.g., motion, temperature), the kinetic energy of the object changed.",
				  "ii. When the kinetic energy of the object increases or decreases, the energy (e.g., kinetic, thermal, potential) of other objects or the surroundings within the system increases or decreases, indicating that energy was transferred to or from the object.",
				  "b Students present oral or written arguments to support or refute the given explanation or model for the phenomenon."
				]
			  }
			}
		  ],
		  "connections": {
			"connectionsToOtherDcisInGradeLevel": "MS.PS1.A (MS-PS3-4); MS.PS1.B (MS-PS3-3); MS.PS2.A (MS-PS3-1), (MS-PS3-4), (MS-PS3-5); MS.ESS2.A (MS-PS3-3); MS.ESS2.C (MS-PS3-3),(MS-PS3-4); MS.ESS2.D (MS-PS3-3), (MS-PS3-4); MS.ESS3.D (MS-PS3-4)",
			"articulationOfDcisAcrossGradeLevels": "4.PS3.B (MS-PS3-1), (MS-PS3-3); 4.PS3.C (MS-PS3-4), (MS-PS3-5); HS.PS1.B (MS-PS3-4); HS.PS2.B (MS-PS3-2); HS.PS3.A (MS-PS3-1), (MS-PS3-4),(MS-PS3-5); HS.PS3.B (MS-PS3-1),(MS-PS3-2),(MS-PS3-3),(MS-PS3-4),(MS-PS3-5); HS.PS3.C (MS-PS3-2)",
			"commonCoreStateStandards": {
			  "elaLiteracy": [
				{
				  "id": "RST.6-8.1",
				  "text": [
					"Cite specific textual evidence to support analysis of science and technical texts, attending to the precise details of explanations or descriptions (MS-PS3-1),(MS-PS3-5)"
				  ]
				},
				{
				  "id": "RST.6-8.3",
				  "text": [
					"Follow precisely a multistep procedure when carrying out experiments, taking measurements, or performing technical tasks. (MS-PS3-3), (MS-PS3-4)"
				  ]
				},
				{
				  "id": "RST.6-8.7",
				  "text": [
					"Integrate quantitative or technical information expressed in words in a text with a version of that information expressed visually (e.g., in a flowchart, diagram, model, graph, or table). (MS-PS3-1)"
				  ]
				},
				{
				  "id": "WHST.6-8.1",
				  "text": [
					"Write arguments focused on discipline content. (MS-PS3-5)"
				  ]
				},
				{
				  "id": "WHST.6-8.7",
				  "text": [
					"Conduct short research projects to answer a question (including a self-generated question), drawing on several sources and generating additional related, focused questions that allow for multiple avenues of exploration. (MS-PS3-3), (MS-PS3-4)"
				  ]
				},
				{
				  "id": "SL.8.5",
				  "text": [
					"Integrate multimedia and visual displays into presentations to clarify information, strengthen claims and evidence, and add interest. (MS-PS3-2)"
				  ]
				}
			  ],
			  "mathematics": [
				{
				  "id": "MP.2",
				  "text": [
					"Reason abstractly and quantitatively. (MS-PS3-1), (MS-PS3-4), (MS-PS3-5)"
				  ]
				},
				{
				  "id": "6.RP.A.1",
				  "text": [
					"Understand the concept of ratio and use ratio language to describe a ratio relationship between two quantities. (MS-PS3-1), (MS-PS3-5)"
				  ]
				},
				{
				  "id": "6.RP.A.2",
				  "text": [
					"Understand the concept of a unit rate a/b associated with a ratio a:b with b ≠ 0, and use rate language in the context of a ratio relationship. (MS-PS3-1)"
				  ]
				},
				{
				  "id": "7.RP.A.2",
				  "text": [
					"Recognize and represent proportional relationships between quantities. (MS-PS3-1), (MS-PS3-5)"
				  ]
				},
				{
				  "id": "8.EE.A.1",
				  "text": [
					"Know and apply the properties of integer exponents to generate equivalent numerical expressions. (MS-PS3-1)"
				  ]
				},
				{
				  "id": "8.EE.A.2",
				  "text": [
					"Use square root and cube root symbols to represent solutions to equations of the form x2 = p and x3 = p, where p is a positive rational number. Evaluate square roots of small perfect squares and cube roots of small perfect cubes. Know that √2 is irrational. (MS-PS3-1)"
				  ]
				},
				{
				  "id": "8.F.A.3",
				  "text": [
					"Interpret the equation y = mx + b as defining a linear function, whose graph is a straight line; give examples of functions that are not linear. (MS-PS3-1), (MS-PS3-5)"
				  ]
				},
				{
				  "id": "6.SP.B.5",
				  "text": [
					"Summarize numerical data sets in relation to their context. (MS-PS3-4)"
				  ]
				}
			  ]
			}
		  }
		},
		{
		  "topicId": "MS-PS4",
		  "topicTitle": "Waves and their Applications in Technologies for Information Transfer",
		  "tocPage": 55,
		  "performanceExpectations": [
			{
			  "id": "MS-PS4-1",
			  "description": "Use mathematical representations to describe a simple model for waves that includes how the amplitude of a wave is related to the energy in a wave.",
			  "sourcePages": [
				55
			  ],
			  "details": {
				"clarificationStatement": "Emphasis is on describing waves with both qualitative and quantitative thinking.",
				"assessmentBoundary": "Assessment does not include electromagnetic waves and is limited to standard repeating waves.",
				"sep": [
				  {
					"id": "Using Mathematics and Computational Thinking",
					"text": [
					  "Mathematical and computational thinking at the 6–8 level builds on K–5 and progresses to identifying patterns in large data sets and using mathematical concepts to support explanations and arguments.",
					  "Use mathematical representations to describe and/or support scientific conclusions and design solutions. (MS-PS4-1)"
					]
				  },
				  {
					"id":"Connections to the Nature of Science",
					 "text":[
						"Scientific Knowledge is Based on Empirical Evidence",
						"Science knowledge is based upon logical and conceptual connections between evidence and explanations."
					]
				  }
				],
				"dci": [
				  {
					"id": "PS4.A: Wave Properties",
					"text": [
					  "A simple wave has a repeating pattern with a specific wavelength, frequency, and amplitude. (MS-PS4-1)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Patterns",
					"text": [
					  "Graphs and charts can be used to identify patterns in data. (MS-PS4-1)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Representation",
				  "a Students identify the characteristics of a simple mathematical wave model of a phenomenon, including:",
				  "i. Waves represent repeating quantities.",
				  "ii. Frequency, as the number of times the pattern repeats in a given amount of time (e.g., beats per second).",
				  "iii. Amplitude, as the maximum extent of the repeating quantity from equilibrium (e.g., height or depth of a water wave from average sea level).",
				  "iv. Wavelength, as a certain distance in which the quantity repeats its value (e.g., the distance between the tops of a series of water waves).",
				  "2 Mathematical modeling",
				  "a Students apply the simple mathematical wave model to a physical system or phenomenon to identify how the wave model characteristics correspond with physical observations (e.g., frequency corresponds to sound pitch, amplitude corresponds to sound volume).",
				  "3 Analysis",
				  "a Given data about a repeating physical phenomenon that can be represented as a wave, and amounts of energy present or transmitted, students use their simple mathematical wave models to identify patterns, including:",
				  "i. That the energy of the wave is proportional to the square of the amplitude (e.g., if the height of a water wave is doubled, each wave will have four times the energy).",
				  "ii. That the amount of energy transferred by waves in a given time is proportional to frequency (e.g., if twice as many water waves hit the shore each minute, then twice as much energy will be transferred to the shore).",
				  "b Students predict the change in the energy of the wave if any one of the parameters of the wave is changed."
				]
			  }
			},
			{
			  "id": "MS-PS4-2",
			  "description": "Develop and use a model to describe that waves are reflected, absorbed, or transmitted through various materials.",
			  "sourcePages": [
				55
			  ],
			  "details": {
				"clarificationStatement": "Emphasis is on both light and mechanical waves. Examples of models could include drawings, simulations, and written descriptions.",
				"assessmentBoundary": "Assessment is limited to qualitative applications pertaining to light and mechanical waves.",
				"sep": [
				  {
					"id": "Developing and Using Models",
					"text": [
					  "Modeling in 6–8 builds on K–5 and progresses to developing, using, and revising models to describe, test, and predict more abstract phenomena and design systems.",
					  "Develop and use a model to describe phenomena. (MS-PS4-2)"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS4.A: Wave Properties",
					"text": [
					  "A sound wave needs a medium through which it is transmitted. (MS-PS4-2)"
					]
				  },
				  {
					"id": "PS4.B: Electromagnetic Radiation",
					"text": [
					  "When light shines on an object, it is reflected, absorbed, or transmitted through the object, depending on the object’s material and the frequency (color) of the light. (MS-PS4-2)",
					  "The path that light travels can be traced as straight lines, except at surfaces between different transparent materials (e.g., air and water, air and glass) where the light path bends. (MS-PS4-2)",
					  "A wave model of light is useful for explaining brightness, color, and the frequency-dependent bending of light at a surface between media. (MS-PS4-2)",
					  "However, because light can travel through space, it cannot be a matter wave, like sound or water waves. (MS-PS4-2)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Structure and Function",
					"text": [
					  "Structures can be designed to serve particular functions by taking into account properties of different materials, and how materials can be shaped and used. (MS-PS4-2)"
					]
				  }
				],
				"evidenceStatements": [
				  "1 Components of the model",
				  "a Students develop a model to make sense of a given phenomenon. In the model, students identify the relevant components, including:",
				  "i. Type of wave.",
				  "1. Mechanical waves (e.g., sound or water waves) and their amplitudes and frequencies.",
				  "2. Light, including brightness (amplitude) and color (frequency).",
				  "ii. Various materials through which the waves are reflected, absorbed, or transmitted.",
				  "iii. Relevant characteristics of the wave after it has interacted with a material (e.g., frequency, amplitude, wavelength).",
				  "iv. Position of the source of the wave.",
				  "2 Relationships",
				  "a In the model, students identify and describe* the relationships between components, including:",
				  "i. Waves interact with materials by being:",
				  "1. Reflected.",
				  "2. Absorbed.",
				  "3. Transmitted.",
				  "ii. Light travels in straight lines, but the path of light is bent at the interface between materials when it travels from one material to another.",
				  "iii. Light does not require a material for propagation (e.g., space), but mechanical waves do require a material for propagation.",
				  "3 Connections",
				  "a Students use their model to make sense of given phenomena involving reflection, absorption, or transmission properties of different materials for light and mechanical waves.",
				  "b Students use their model about phenomena involving light and/or mechanical waves to describe* the differences between how light and matter waves interact with different materials.",
				  "c Students use the model to describe* why materials with certain properties are well-suited for particular functions (e.g., lenses and mirrors, sound absorbers in concert halls, colored light filters, sound barriers next to highways)."
				]
			  }
			},
			{
			  "id": "MS-PS4-3",
			  "description": "Integrate qualitative scientific and technical information to support the claim that digitized signals are a more reliable way to encode and transmit information than analog signals.",
			  "sourcePages": [
				55
			  ],
			  "details": {
				"clarificationStatement": "Emphasis is on a basic understanding that waves can be used for communication purposes. Examples could include using fiber optic cable to transmit light pulses, radio wave pulses in wifi devices, and conversion of stored binary patterns to make sound or text on a computer screen.",
				"assessmentBoundary": "Assessment does not include binary counting. Assessment does not include the specific mechanism of any given device.",
				"sep": [
				  {
					"id": "Obtaining, Evaluating, and Communicating Information",
					"text": [
					  "Obtaining, evaluating, and communicating information in 6–8 builds on K–5 and progresses to evaluating the merit and validity of ideas and methods.",
					  "Integrate qualitative scientific and technical information in written text with that contained in media and visual displays to clarify claims and findings. (MS-PS4-3)"
					]
				  }
				],
				"dci": [
				  {
					"id": "PS4.C: Information Technologies and Instrumentation",
					"text": [
					  "Digitized signals (sent as wave pulses) are a more reliable way to encode and transmit information. (MS-PS4-3)"
					]
				  }
				],
				"ccc": [
				  {
					"id": "Structure and Function",
					"text": [
					  "Structures can be designed to serve particular functions. (MS-PS4-3)"
					]
				  },
				  {
					"id": "Connections to Engineering, Technology, and Applications of Science",
					"text": [
					  	"Influence of Science, Engineering, and Technology on Society and the Natural World",
						"Technologies extend the measurement, exploration, modeling, and computational capacity of scientific investigations."
					]
				  },
				  {
					"id": "Connections to the Nature of Science",
					"text": [
					  	"Science is a Human Endeavor",
						"Advances in technology influence the progress of science and science has influenced advances in technology."
					]
				  }
				],
				"evidenceStatements": [
				  "1 Obtaining information",
				  "a Given materials from a variety of different types of sources of information (e.g., texts, graphical, video, digital), students gather evidence sufficient to support a claim about a phenomenon that includes the idea that using waves to carry digital signals is a more reliable way to encode and transmit information than using waves to carry analog signals.",
				  "2 Evaluating information",
				  "a Students combine the relevant information (from multiple sources) to support the claim by describing*:",
				  "i. Specific features that make digital transmission of signals more reliable than analog transmission of signals, including that, when in digitized form, information can be:",
				  "1. Recorded reliably.",
				  "2. Stored for future recovery.",
				  "3. Transmitted over long distances without significant degradation.",
				  "ii. At least one technology that uses digital encoding and transmission of information. Students should describe* how the digitization of that technology has advanced science and scientific investigations (e.g., digital probes, including thermometers and pH probes; audio recordings)."
				]
			  }
			}
		  ],
		  "connections": {
			"connectionsToOtherDcisInGradeLevel": "MS.LS1.D (MS-PS4-2)",
			"articulationOfDcisAcrossGradeLevels": "4.PS3.A (MS-PS4-1); 4.PS3.B (MS-PS4-1); 4.PS4.A (MS-PS4-1); 4.PS4.B (MS-PS4-2); 4.PS4.C (MS-PS4-3); HS.PS4.A (MS-PS4-1), (MS-PS4-2),(MS-PS4-3); HS.PS4.B (MS-PS4-1), (MS-PS4-2); HS.PS4.C (MS-PS4-3); HS.ESS1.A (MS-PS4-2); HS.ESS2.A (MS-PS4-2); HS.ESS2.C (MS-PS4-2); HS.ESS2.D (MS-PS4-2)",
			"commonCoreStateStandards": {
			  "elaLiteracy": [
				{
				  "id": "RST.6-8.1",
				  "text": [
					"Cite specific textual evidence to support analysis of science and technical texts. (MS-PS4-3)"
				  ]
				},
				{
				  "id": "RST.6-8.2",
				  "text": [
					"Determine the central ideas or conclusions of a text; provide an accurate summary of the text distinct from prior knowledge or opinions. (MS-PS4-3)"
				  ]
				},
				{
				  "id": "RST.6-8.9",
				  "text": [
					"Compare and contrast the information gained from experiments, simulations, video, or multimedia sources with that gained from reading a text on the same topic. (MS-PS4-3)"
				  ]
				},
				{
				  "id": "WHST.6-8.9",
				  "text": [
					"Draw evidence from informational texts to support analysis, reflection, and research. (MS-PS4-3)"
				  ]
				},
				{
				  "id": "SL.8.5",
				  "text": [
					"Integrate multimedia and visual displays into presentations to clarify information, strengthen claims and evidence, and add interest. (MS-PS4-1), (MS-PS4-2)"
				  ]
				}
			  ],
			  "mathematics": [
				{
				  "id": "MP.2",
				  "text": [
					"Reason abstractly and quantitatively. (MS-PS4-1)"
				  ]
				},
				{
				  "id": "MP.4",
				  "text": [
					"Model with mathematics. (MS-PS4-1)"
				  ]
				},
				{
				  "id": "6.RP.A.1",
				  "text": [
					"Understand the concept of a ratio and use ratio language to describe a ratio relationship between two quantities. (MS-PS4-1)"
				  ]
				},
				{
				  "id": "6.RP.A.3",
				  "text": [
					"Use ratio and rate reasoning to solve real-world and mathematical problems. (MS-PS4-1)"
				  ]
				},
				{
				  "id": "7.RP.A.2",
				  "text": [
					"Recognize and represent proportional relationships between quantities. (MS-PS4-1)"
				  ]
				},
				{
				  "id": "8.F.A.3",
				  "text": [
					"Interpret the equation y = mx + b as defining a linear function, whose graph is a straight line; give examples of functions that are not linear. (MS-PS4-1)"
				  ]
				}
			  ]
			}
		  }
		},
		{
		  "topicId":"MS-LS1",
		  "topicTitle":"From Molecules to Organisms: Structures and Processes",
		  "tocPage":1,
		  "performanceExpectations":[
			 {
				"id":"MS-LS1-1",
				"description":"Conduct an investigation to provide evidence that living things are made of cells; either one cell or many different numbers and types of cells.",
				"sourcePages":[
				   1,
				   2
				],
				"details":{
				   "clarificationStatement":"Emphasis is on developing evidence that living things are made of cells, distinguishing between living and non-living things, and understanding that living things may be made of one cell or many and varied cells.",
				   "assessmentBoundary":null,
				   "sep":[
					  {
						 "id":"Planning and Carrying Out Investigations",
						 "text":[
							"Planning and carrying out investigations in 6-8 builds on K-5 experiences and progresses to include investigations that use multiple variables and provide evidence to support explanations or solutions.",
							"Conduct an investigation to produce data to serve as the basis for evidence that meet the goals of an investigation."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS1.A: Structure and Function",
						 "text":[
							"All living things are made up of cells, which is the smallest unit that can be said to be alive. An organism may consist of one single cell (unicellular) or many different numbers and types of cells (multicellular)."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Scale, Proportion, and Quantity",
						 "text":[
							"Phenomena that can be observed at one scale may not be observable at another scale."
						 ]
					  },
					  {
						 "id":"Connections to Engineering, Technology, and Applications of Science",
						 "text":[
							"Interdependence of Science, Engineering, and Technology",
							"Engineering advances have led to important discoveries in virtually every field of science, and scientific discoveries have led to the development of entire industries and engineered systems."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Identifying the phenomenon under investigation",
					  "a From the given investigation plan, students identify and describe* the phenomenon under investigation, which includes the idea that living things are made up of cells.",
					  "b Students identify and describe* the purpose of the investigation, which includes providing evidence for the following ideas: that all living things are made of cells (either one cell or many different numbers and types of cells) and that the cell is the smallest unit that can be said to be alive.",
					  "2 Identifying the evidence to address the purpose of the investigation",
					  "a From the given investigation plan, students describe* the data that will be collected and the evidence to be derived from the data, including:",
					  "i. The presence or absence of cells in living and nonliving things.",
					  "ii. The presence or absence of any part of a living thing that is not made up of cells.",
					  "iii. The presence or absence of cells in a variety of organisms, including unicellular and multicellular organisms.",
					  "iv. Different types of cells within one multicellular organism.",
					  "b Students describe* how the evidence collected will be relevant to the purpose of the investigation.",
					  "3 Planning the investigation",
					  "a From the given investigation plan, students describe* how the tools and methods included in the experimental design will provide the evidence necessary to address the purpose of the investigation, including that due to their small-scale size, cells are unable to be seen with the unaided eye and require engineered magnification devices to be seen.",
					  "b Students describe* how the tools used in the investigation are an example of how science depends on engineering advances.",
					  "4 Collecting the data",
					  "a According to the given investigation plan, students collect and record data on the cellular composition of living organisms.",
					  "b Students identify the tools used for observation at different magnifications and describe* that different tools are required to observe phenomena related to cells at different scales.",
					  "c Students evaluate the data they collect to determine whether the resulting evidence meets the goals of the investigation, including cellular composition as a distinguishing feature of living things."
				   ]
				}
			 },
			 {
				"id":"MS-LS1-2",
				"description":"Develop and use a model to describe the function of a cell as a whole and ways parts of cells contribute to the function.",
				"sourcePages":[
				   3
				],
				"details":{
				   "clarificationStatement":"Emphasis is on the cell functioning as a whole system and the primary role of identified parts of the cell, specifically the nucleus, chloroplasts, mitochondria, cell membrane, and cell wall.",
				   "assessmentBoundary":"Assessment of organelle structure/function relationships is limited to the cell wall and cell membrane. Assessment of the function of the other organelles is limited to their relationship to the whole cell. Assessment does not include the biochemical function of cells or cell parts.",
				   "sep":[
					  {
						 "id":"Developing and Using Models",
						 "text":[
							"Modeling in 6–8 builds on K–5 experiences and progresses to developing, using, and revising models to describe, test, and predict more abstract phenomena and design systems.",
							"Develop and use a model to describe phenomena."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS1.A: Structure and Function",
						 "text":[
							"Within cells, special structures are responsible for particular functions, and the cell membrane forms the boundary that controls what enters and leaves the cell."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Structure and Function",
						 "text":[
							"Complex and microscopic structures and systems can be visualized, modeled, and used to describe how their function depends on the relationships among its parts, therefore complex natural structures/systems can be analyzed to determine how they function."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Components of the model",
					  "a To make sense of a phenomenon, students develop a model in which they identify the parts (i.e., components; e.g., nucleus, chloroplasts, cell wall, mitochondria, cell membrane, the function of a cell as a whole) of cells relevant for the given phenomenon.",
					  "2 Relationships",
					  "a In the model, students describe* the relationships between components, including:",
					  "i. The particular functions of parts of cells in terms of their contributions to overall cellular functions (e.g., chloroplasts’ involvement in photosynthesis and energy production, mitochondria’s involvement in cellular respiration).",
					  "ii. The structure of the cell membrane or cell wall and its relationship to the function of the organelles and the whole cell.",
					  "3 Connections",
					  "a Students use the model to describe* a causal account for the phenomenon, including how different parts of a cell contribute to how the cell functions as a whole, both separately and together with other structures. Students include how components, separately and together, contribute to:",
					  "i. Maintaining a cell’s internal processes, for which it needs energy.",
					  "ii. Maintaining the structure of the cell and controlling what enters and leaves the cell.",
					  "iii. Functioning together as parts of a system that determines cellular function.",
					  "b Students use the model to identify key differences between plant and animal cells based on structure and function, including:",
					  "i. Plant cells have a cell wall in addition to a cell membrane, whereas animal cells have only a cell membrane. Plants use cell walls to provide structure to the plant.",
					  "ii. Plant cells contain organelles called chloroplasts, while animal cells do not. Chloroplasts allow plants to make the food they need to live using photosynthesis."
				   ]
				}
			 },
			 {
				"id":"MS-LS1-3",
				"description":"Use argument supported by evidence for how the body is a system of interacting subsystems composed of groups of cells.",
				"sourcePages":[
				   4,
				   5
				],
				"details":{
				   "clarificationStatement":"Emphasis is on the conceptual understanding that cells form tissues and tissues form organs specialized for particular body functions. Examples could include the interaction of subsystems within a system and the normal functioning of those systems.",
				   "assessmentBoundary":"Assessment does not include the mechanism of one body system independent of others. Assessment is limited to the circulatory, excretory, digestive, respiratory, muscular, and nervous systems.",
				   "sep":[
					  {
						 "id":"Engaging in Argument from Evidence",
						 "text":[
							"Engaging in argument from evidence in 6–8 builds on K–5 experiences and progresses to constructing a convincing argument that supports or refutes claims for either explanations or solutions about the natural and designed world(s).",
							"Use an oral and written argument supported by evidence to support or refute an explanation or a model for a phenomenon."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS1.A: Structure and Function",
						 "text":[
							"In multicellular organisms, the body is a system of multiple interacting subsystems. These subsystems are groups of cells that work together to form tissues and organs that are specialized for particular body functions."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Systems and System Models",
						 "text":[
							"Systems may interact with other systems; they may have sub-systems and be a part of larger complex systems."
						 ]
					  },
					  {
						 "id":"Connections to the Nature of Science",
						 "text":[
							"Science is a Human Endeavor",
							"Scientists and engineers are guided by habits of mind such as intellectual honesty, tolerance of ambiguity, skepticism, and openness to new ideas."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Supported claims",
					  "a Students make a claim to be supported, related to a given explanation or model of a phenomenon. In the claim, students include the idea that the body is a system of interacting subsystems composed of groups of cells.",
					  "2 Identifying scientific evidence",
					  "a Students identify and describe* the given evidence that supports the claim (e.g., evidence from data and scientific literature), including evidence that:",
					  "i. Specialized groups of cells work together to form tissues (e.g., evidence from data about the kinds of cells found in different tissues, such as nervous, muscular, and epithelial, and their functions).",
					  "ii. Specialized tissues comprise each organ, enabling the specific organ functions to be carried out (e.g., the heart contains muscle, connective, and epithelial tissues that allow the heart to receive and pump blood).",
					  "iii. Different organs can work together as subsystems to form organ systems that carry out complex functions (e.g., the heart and blood vessels work together as the circulatory system to transport blood and materials throughout the body).",
					  "iv. The body contains organs and organ systems that interact with each other to carry out all necessary functions for survival and growth of the organism (e.g., the digestive, respiratory, and circulatory systems are involved in the breakdown and transport of food and the transport of oxygen throughout the body to cells, where the molecules can be used for energy, growth, and repair).",
					  "3 Evaluating and critiquing the evidence",
					  "a Students evaluate the evidence and identify the strengths and weaknesses of the evidence, including:",
					  "i. Types of sources.",
					  "ii. Sufficiency, including validity and reliability, of the evidence to make and defend the claim.",
					  "iii. Any alternative interpretations of the evidence and why the evidence supports the student’s claim, as opposed to any other claims.",
					  "4 Reasoning and synthesis",
					  "a Students use reasoning to connect the appropriate evidence to the claim. Students describe* the following chain of reasoning in their argumentation:",
					  "i. Every scale (e.g., cells, tissues, organs, organ systems) of body function is composed of systems of interacting components.",
					  "ii. Organs are composed of interacting tissues. Each tissue is made up of specialized cells. These interactions at the cellular and tissue levels enable the organs to carry out specific functions.",
					  "iii. A body is a system of specialized organs that interact with each other and their subsystems to carry out the functions necessary for life.",
					  "b Students use oral or written arguments to support or refute an explanation or model of a phenomenon."
				   ]
				}
			 },
			 {
				"id":"MS-LS1-4",
				"description":"Use argument based on empirical evidence and scientific reasoning to support an explanation for how characteristic animal behaviors and specialized plant structures affect the probability of successful reproduction of animals and plants respectively.",
				"sourcePages":[
				   6,
				   7
				],
				"details":{
				   "clarificationStatement":"Examples of behaviors that affect the probability of animal reproduction could include nest building to protect young from cold, herding of animals to protect young from predators, and vocalization of animals and colorful plumage to attract mates for breeding. Examples of animal behaviors that affect the probability of plant reproduction could include transferring pollen or seeds, and creating conditions for seed germination and growth. Examples of plant structures could include bright flowers attracting butterflies that transfer pollen, flower nectar and odors that attract insects that transfer pollen, and hard shells on nuts that squirrels bury.",
				   "assessmentBoundary":null,
				   "sep":[
					  {
						 "id":"Engaging in Argument from Evidence",
						 "text":[
							"Engaging in argument from evidence in 6–8 builds on K–5 experiences and progresses to constructing a convincing argument that supports or refutes claims for either explanations or solutions about the natural and designed world(s).",
							"Use an oral and written argument supported by empirical evidence and scientific reasoning to support or refute an explanation or a model for a phenomenon or a solution to a problem."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS1.B: Growth and Development of Organisms",
						 "text":[
							"Animals engage in characteristic behaviors that increase the odds of reproduction."
						 ]
					  },
					  {
						 "id":"LS1.B: Growth and Development of Organisms",
						 "text":[
							"Plants reproduce in a variety of ways, sometimes depending on animal behavior and specialized features for reproduction."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Cause and Effect",
						 "text":[
							"Phenomena may have more than one cause, and some cause and effect relationships in systems can only be described using probability."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Supported claims",
					  "a Students make a claim to support a given explanation of a phenomenon. In their claim, students include the idea that characteristic animal behaviors and specialized plant structures affect the probability of successful reproduction of animals and plants respectively.",
					  "2 Identifying scientific evidence",
					  "a Students identify the given evidence that supports the claim (e.g., evidence from data and scientific literature), including:",
					  "i. Characteristic animal behaviors that increase the probability of reproduction.",
					  "ii. Specialized plant and animal structures that increase the probability of reproduction.",
					  "iii. Cause-and-effect relationships between:",
					  "1. Specialized plant structures and the probability of successful reproduction of plants that have those structures.",
					  "2. Animal behaviors and the probability of successful reproduction of animals that exhibit those behaviors.",
					  "3. Plant reproduction and the animal behaviors related to plant reproduction.",
					  "3 Evaluating and critiquing the evidence",
					  "a Students evaluate the evidence and identify the strengths and weaknesses of the evidence used to support the claim, including:",
					  "i. Validity and reliability of sources.",
					  "ii. Sufficiency — including relevance, validity, and reliability — of the evidence to make and defend the claim.",
					  "iii. Alternative interpretations of the evidence and why the evidence supports the student’s claim, as opposed to any other claims.",
					  "4 Reasoning and synthesis",
					  "a Students use reasoning to connect the appropriate evidence to the claim, using oral or written arguments. Students describe* the following chain of reasoning in their argumentation:",
					  "i. Many characteristic animal behaviors affect the likelihood of successful reproduction.",
					  "ii. Many specialized plant structures affect the likelihood of successful reproduction.",
					  "iii. Sometimes, animal behavior plays a role in the likelihood of successful reproduction in plants.",
					  "iv. Because successful reproduction has several causes and contributing factors, the cause-and-effect relationships between any of these characteristics, separately or together, and reproductive likelihood can be accurately reflected only in terms of probability."
				   ]
				}
			 },
			 {
				"id":"MS-LS1-5",
				"description":"Construct a scientific explanation based on evidence for how environmental and genetic factors influence the growth of organisms.",
				"sourcePages":[
				   8,
				   9
				],
				"details":{
				   "clarificationStatement":"Examples of local environmental conditions could include availability of food, light, space, and water. Examples of genetic factors could include large breed cattle and species of grass affecting growth of organisms. Examples of evidence could include drought decreasing plant growth, fertilizer increasing plant growth, different varieties of plant seeds growing at different rates in different conditions, and fish growing larger in large ponds than they do in small ponds.",
				   "assessmentBoundary":"Assessment does not include genetic mechanisms, gene regulation, or biochemical processes.",
				   "sep":[
					  {
						 "id":"Constructing Explanations and Designing Solutions",
						 "text":[
							"Constructing explanations and designing solutions in 6–8 builds on K–5 experiences and progresses to include constructing explanations and designing solutions supported by multiple sources of evidence consistent with scientific knowledge, principles, and theories.",
							"Construct a scientific explanation based on valid and reliable evidence obtained from sources (including the students’ own experiments) and the assumption that theories and laws that describe the natural world operate today as they did in the past and will continue to do so in the future."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS1.B: Growth and Development of Organisms",
						 "text":[
							"Genetic factors as well as local conditions affect the growth of the adult plant."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Cause and Effect",
						 "text":[
							"Phenomena may have more than one cause, and some cause and effect relationships in systems can only be described using probability."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Articulating the explanation of phenomena",
					  "a Students articulate a statement that relates the given phenomenon to a scientific idea, including the idea that both environmental and genetic factors influence the growth of organisms.",
					  "b Students use evidence and reasoning to construct a scientific explanation for the given phenomenon.",
					  "2 Evidence",
					  "a Students identify and describe* evidence (e.g., from students’ own investigations, observations, reading material, archived data) necessary for constructing the explanation, including:",
					  "i. Environmental factors (e.g., availability of light, space, water; size of habitat) and that they can influence growth.",
					  "ii. Genetic factors (e.g., specific breeds of plants and animals and their typical sizes) and that they can influence growth.",
					  "iii. Changes in the growth of organisms as specific environmental and genetic factors change.",
					  "b Students use multiple valid and reliable sources of evidence to construct the explanation.",
					  "3 Reasoning",
					  "a Students use reasoning, along with the assumption that theories and laws that describe the natural world operate today as they did in the past and will continue to do so in the future, to connect the evidence and support an explanation for a phenomenon involving genetic and environmental influences on organism growth. Students describe* their chain of reasoning that includes:",
					  "i. Organism growth is influenced by multiple environmental (e.g., drought, changes in food availability) and genetic (e.g., specific breed) factors.",
					  "ii. Because both environmental and genetic factors can influence organisms simultaneously, organism growth is the result of environmental and genetic factors working together (e.g., water availability influences how tall dwarf fruit trees will grow).",
					  "iii. Because organism growth can have several genetic and environmental causes, the contributions of specific causes or factors to organism growth can be described only using probability (e.g., not every fish in a large pond grows to the same size)."
				   ]
				}
			 },
			 {
				"id":"MS-LS1-6",
				"description":"Construct a scientific explanation based on evidence for the role of photosynthesis in the cycling of matter and flow of energy into and out of organisms.",
				"sourcePages":[
				   10,
				   11
				],
				"details":{
				   "clarificationStatement":"Emphasis is on tracing movement of matter and flow of energy.",
				   "assessmentBoundary":"Assessment does not include the biochemical mechanisms of photosynthesis.",
				   "sep":[
					  {
						 "id":"Constructing Explanations and Designing Solutions",
						 "text":[
							"Constructing explanations and designing solutions in 6–8 builds on K–5 experiences and progresses to include constructing explanations and designing solutions supported by multiple sources of evidence consistent with scientific knowledge, principles, and theories.",
							"Construct a scientific explanation based on valid and reliable evidence obtained from sources (including the students’ own experiments) and the assumption that theories and laws that describe the natural world operate today as they did in the past and will continue to do so in the future."
						 ]
					  },
					  {
						 "id":"Connections to the Nature of Science",
						 "text":[
							"Scientific Knowledge is Based on Empirical Evidence",
							"Science knowledge is based upon logical connections between evidence and explanations."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS1.C: Organization for Matter and Energy Flow in Organisms",
						 "text":[
							"Plants, algae (including phytoplankton), and many microorganisms use the energy from light to make sugars (food) from carbon dioxide from the atmosphere and water through the process of photosynthesis, which also releases oxygen. These sugars can be used immediately or stored for growth or later use."
						 ]
					  },
					  {
						 "id":"PS3.D: Energy in Chemical Processes and Everyday Life",
						 "text":[
							"The chemical reaction by which plants produce complex food molecules (sugars) requires an energy input (i.e., from sunlight) to occur. In this reaction, carbon dioxide and water combine to form carbon-based organic molecules and release oxygen. (secondary)"
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Energy and Matter",
						 "text":[
							"Within a natural system, the transfer of energy drives the motion and/or cycling of matter."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Articulating the explanation of phenomena",
					  "a Students articulate a statement that relates the given phenomenon to a scientific idea, including the idea that photosynthesis results in the cycling of matter and energy into and out of organisms.",
					  "b Students use evidence and reasoning to construct a scientific explanation for the given phenomenon.",
					  "2 Evidence",
					  "a Students identify and describe* evidence (e.g., from students’ own investigations, observations, reading material, archived data) necessary to constructing the explanation, including that:",
					  "i. Plants, algae, and photosynthetic microorganisms require energy (in the form of sunlight) and must take in carbon dioxide and water to survive.",
					  "ii. Energy from sunlight is used to combine simple nonfood molecules (e.g., carbon dioxide and water) into food molecules (e.g., sugar) and oxygen, which can be used immediately or stored by the plant.",
					  "iii. Animals take in food and oxygen to provide energy and materials for growth and survival.",
					  "iv. Some animals eat plants, algae, and photosynthetic microorganisms, and some animals eat other animals, which have themselves eaten photosynthetic organisms.",
					  "b Students use multiple valid and reliable sources of evidence.",
					  "3 Reasoning",
					  "a Students use reasoning, along with the assumption that theories and laws that describe the natural world operate today as they did in the past and will continue to do so in the future, to connect the evidence and support an explanation for energy and matter cycling during photosynthesis. Students describe* a chain of reasoning for their explanation, including:",
					  "i. Plants, algae, and photosynthetic microorganisms take in matter (in the form of carbon dioxide and water) and use energy from the sun to produce carbon-based organic molecules (food), which they can use immediately or store, and release oxygen into the environment through photosynthesis.",
					  "ii. Plants use the food they have made for energy, growth, and other necessary functions (e.g., repair, seed production).",
					  "iii. Animals depend on matter from plants for growth and survival, including:",
					  "1. Eating photosynthetic organisms (or other organisms that have eaten photosynthetic organisms), thus acquiring the matter they contain, the production of which was driven by photosynthesis.",
					  "2. Breathing in oxygen, which was released when plants used energy to rearrange carbon dioxide and water during photosynthesis.",
					  "iv. Because animals acquire their food from photosynthetic organisms (or from other animals that have eaten those organisms) and their oxygen from the products of photosynthesis, all food and most of the oxygen animals use for life processes are the results of energy from the sun driving matter flows through the process of photosynthesis.",
					  "v. The process of photosynthesis has an important role in energy and matter cycling within plants (i.e., the conversion of carbon dioxide and water into complex carbon-based molecules (sugars) and oxygen, the contribution of sugars to plant growth and internal processes) as well as from plants to other organisms."
				   ]
				}
			 },
			 {
				"id":"MS-LS1-7",
				"description":"Develop a model to describe how food is rearranged through chemical reactions forming new molecules that support growth and/or release energy as this matter moves through an organism.",
				"sourcePages":[
				   12
				],
				"details":{
				   "clarificationStatement":"Emphasis is on describing that molecules are broken apart and put back together and that in this process, energy is released.",
				   "assessmentBoundary":"Assessment does not include details of the chemical reactions for photosynthesis or respiration.",
				   "sep":[
					  {
						 "id":"Developing and Using Models",
						 "text":[
							"Modeling in 6–8 builds on K–5 experiences and progresses to developing, using, and revising models to describe, test, and predict more abstract phenomena and design systems.",
							"Develop a model to describe unobservable mechanisms."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS1.C: Organization for Matter and Energy Flow in Organisms",
						 "text":[
							"Within individual organisms, food moves through a series of chemical reactions in which it is broken down and rearranged to form new molecules, to support growth, or to release energy."
						 ]
					  },
					  {
						 "id":"PS3.D: Energy in Chemical Processes and Everyday Life",
						 "text":[
							"Cellular respiration in plants and animals involve chemical reactions with oxygen that release stored energy. In these processes, complex molecules containing carbon react with oxygen to produce carbon dioxide and other materials.(secondary)"
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Energy and Matter",
						 "text":[
							"Matter is conserved because atoms are conserved in physical and chemical processes."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Components of the model",
					  "a To make sense of a phenomenon, students develop a model in which they identify the relevant components for describing* how food molecules are rearranged as matter moves through an organism, including:",
					  "i. Molecules of food, which are complex carbon-containing molecules.",
					  "ii. Oxygen.",
					  "iii. Energy that is released or absorbed during chemical reactions between food and oxygen.",
					  "iv. New types of molecules produced through chemical reactions involving food.",
					  "2 Relationships",
					  "a In the model, students identify and describe* the relationships between components, including:",
					  "i. During cellular respiration, molecules of food undergo chemical reactions with oxygen, releasing stored energy.",
					  "ii. The atoms in food are rearranged through chemical reactions to form new molecules.",
					  "3 Connections",
					  "a Students use the model to describe*:",
					  "i. The number of each type of atom being the same before and after chemical reactions, indicating that the matter ingested as food is conserved as it moves through an organism to support growth.",
					  "ii. That all matter (atoms) used by the organism for growth comes from the products of the chemical reactions involving the matter taken in by the organism.",
					  "iii. Food molecules taken in by the organism are broken down and can then be rearranged to become the molecules that comprise the organism (e.g., the proteins and other molecules in a hamburger can be broken down and used to make a variety of tissues in humans).",
					  "iv. As food molecules are rearranged, energy is released and can be used to support other processes within the organism."
				   ]
				}
			 },
			 {
				"id":"MS-LS1-8",
				"description":"Gather and synthesize information that sensory receptors respond to stimuli by sending messages to the brain for immediate behavior or storage as memories.",
				"sourcePages":[
				   13
				],
				"details":{
				   "clarificationStatement":null,
				   "assessmentBoundary":"Assessment does not include mechanisms for the transmission of this information.",
				   "sep":[
					  {
						 "id":"Obtaining, Evaluating, and Communicating Information",
						 "text":[
							"Obtaining, evaluating, and communicating information in 6-8 builds on K-5 experiences and progresses to evaluating the merit and validity of ideas and methods.",
							"Gather, read, and synthesize information from multiple appropriate sources and assess the credibility, accuracy, and possible bias of each publication and methods used, and describe how they are supported or not supported by evidence."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS1.D: Information Processing",
						 "text":[
							"Each sense receptor responds to different inputs (electromagnetic, mechanical, chemical), transmitting them as signals that travel along nerve cells to the brain. The signals are then processed in the brain, resulting in immediate behaviors or memories."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Cause and Effect",
						 "text":[
							"Cause and effect relationships may be used to predict phenomena in natural systems."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Obtaining information",
					  "a Students gather and synthesize information from at least two sources (e.g., text, media, visual displays, data) about a phenomenon that includes the relationship between sensory receptors and the storage and usage of sensory information by organisms. Students gather information about:",
					  "i. Different types of sensory receptors and the types of inputs to which they respond (e.g., electromagnetic, mechanical, chemical stimuli).",
					  "ii. Sensory information transmission along nerve cells from receptors to the brain.",
					  "iii. Sensory information processing by the brain as:",
					  "1. Memories (i.e., stored information).",
					  "2. Immediate behavioral responses (i.e., immediate use).",
					  "b Students gather sufficient information to provide evidence that illustrates the causal relationships between information received by sensory receptors and behavior, both immediate and over longer time scales (e.g., a loud noise processed via auditory receptors may cause an animal to startle immediately or may be encoded as a memory, which can later be used to help the animal react appropriately in similar situations).",
					  "2 Evaluating information",
					  "a Students evaluate the information based on:",
					  "i. The credibility, accuracy, and possible bias of each publication and the methods used to generate and collect the evidence.",
					  "ii. The ability of the information to provide evidence that supports or does not support the idea that sensory receptors send signals to the brain, resulting in immediate behavioral changes or stored memories.",
					  "iii. Whether the information is sufficient to allow prediction of the response of an organism to different stimuli based on cause and effect relationships between the responses of sensory receptors and behavioral responses."
				   ]
				}
			 }
		  ]
	   },
		{
		  "topicId":"MS-LS2",
		  "topicTitle":"Ecosystems: Interactions, Energy, and Dynamics",
		  "tocPage":14,
		  "performanceExpectations":[
			 {
				"id":"MS-LS2-1",
				"description":"Analyze and interpret data to provide evidence for the effects of resource availability on organisms and populations of organisms in an ecosystem.",
				"sourcePages":[
				   14
				],
				"details":{
				   "clarificationStatement":"Emphasis is on cause and effect relationships between resources and growth of individual organisms and the numbers of organisms in ecosystems during periods of abundant and scarce resources.",
				   "assessmentBoundary":null,
				   "sep":[
					  {
						 "id":"Analyzing and Interpreting Data",
						 "text":[
							"Analyzing data in 6–8 builds on K–5 experiences and progresses to extending quantitative analysis to investigations, distinguishing between correlation and causation, and basic statistical techniques of data and error analysis.",
							"Analyze and interpret data to provide evidence for phenomena."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS2.A: Interdependent Relationships in Ecosystems",
						 "text":[
							"Organisms, and populations of organisms, are dependent on their environmental interactions both with other living things and with nonliving factors."
						 ]
					  },
					  {
						 "id":"LS2.A: Interdependent Relationships in Ecosystems",
						 "text":[
							"In any ecosystem, organisms and populations with similar requirements for food, water, oxygen, or other resources may compete with each other for limited resources, access to which consequently constrains their growth and reproduction."
						 ]
					  },
					  {
						 "id":"LS2.A: Interdependent Relationships in Ecosystems",
						 "text":[
							"Growth of organisms and population increases are limited by access to resources."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Cause and Effect",
						 "text":[
							"Cause and effect relationships may be used to predict phenomena in natural or designed systems."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Organizing data",
					  "a Students organize the given data (e.g., using tables, graphs, and charts) to allow for analysis and interpretation of relationships between resource availability and organisms in an ecosystem, including:",
					  "i. Populations (e.g., sizes, reproduction rates, growth information) of organisms as a function of resource availability.",
					  "ii. Growth of individual organisms as a function of resource availability.",
					  "2 Identifying relationships",
					  "a Students analyze the organized data to determine the relationships between the size of a population, the growth and survival of individual organisms, and resource availability.",
					  "b Students determine whether the relationships provide evidence of a causal link between these factors.",
					  "3 Interpreting data",
					  "a Students analyze and interpret the organized data to make predictions based on evidence of causal relationships between resource availability, organisms, and organism populations. Students make relevant predictions, including:",
					  "i. Changes in the amount and availability of a given resource (e.g., less food) may result in changes in the population of an organism (e.g., less food results in fewer organisms).",
					  "ii. Changes in the amount or availability of a resource (e.g., more food) may result in changes in the growth of individual organisms (e.g., more food results in faster growth).",
					  "iii. Resource availability drives competition among organisms, both within a population as well as between populations.",
					  "iv. Resource availability may have effects on a population’s rate of reproduction."
				   ]
				}
			 },
			 {
				"id":"MS-LS2-2",
				"description":"Construct an explanation that predicts patterns of interactions among organisms across multiple ecosystems.",
				"sourcePages":[
				   15,
				   16
				],
				"details":{
				   "clarificationStatement":"Emphasis is on predicting consistent patterns of interactions in different ecosystems in terms of the relationships among and between organisms and abiotic components of ecosystems. Examples of types of interactions could include competitive, predatory, and mutually beneficial.",
				   "assessmentBoundary":null,
				   "sep":[
					  {
						 "id":"Constructing Explanations and Designing Solutions",
						 "text":[
							"Constructing explanations and designing solutions in 6–8 builds on K–5 experiences and progresses to include constructing explanations and designing solutions supported by multiple sources of evidence consistent with scientific ideas, principles, and theories.",
							"Construct an explanation that includes qualitative or quantitative relationships between variables that predict phenomena."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS2.A: Interdependent Relationships in Ecosystems",
						 "text":[
							"Similarly, predatory interactions may reduce the number of organisms or eliminate whole populations of organisms. Mutually beneficial interactions, in contrast, may become so interdependent that each organism requires the other for survival. Although the species involved in these competitive, predatory, and mutually beneficial interactions vary across ecosystems, the patterns of interactions of organisms with their environments, both living and nonliving, are shared."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Patterns",
						 "text":[
							"Patterns can be used to identify cause and effect relationships."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Articulating the explanation of phenomena",
					  "a Students articulate a statement that relates the given phenomenon to a scientific idea, including that similar patterns of interactions occur between organisms and their environment, regardless of the ecosystem or the species involved.",
					  "b Students use evidence and reasoning to construct an explanation for the given phenomenon.",
					  "2 Evidence",
					  "a Students identify and describe* the evidence (e.g., from students’ own investigations, observations, reading material, archived data) necessary for constructing the explanation, including evidence that:",
					  "i. Competitive relationships occur when organisms within an ecosystem compete for shared resources (e.g., data about the change in population of a given species when a competing species is introduced).",
					  "ii. Predatory interactions occur between organisms within an ecosystem.",
					  "iii. Mutually beneficial interactions occur between organisms within an ecosystem. Organisms involved in these mutually beneficial interactions can become so dependent upon one another that they cannot survive alone.",
					  "iv. Resource availability, or lack thereof, can affect interactions between organisms (e.g., organisms in a resource-limited environment may have a competitive relationship, while those same organisms may not be in competition in a resource-rich environment).",
					  "v. Competitive, predatory, and mutually beneficial interactions occur across multiple, different, ecosystems",
					  "b Students use multiple valid and reliable sources for the evidence.",
					  "3 Reasoning",
					  "a Students identify and describe* quantitative or qualitative patterns of interactions among organisms that can be used to identify causal relationships within ecosystems, related to the given phenomenon.",
					  "b Students describe* that regardless of the ecosystem or species involved, the patterns of interactions (competitive, mutually beneficial, predator/prey) are similar.",
					  "c Students use reasoning to connect the evidence and support an explanation. In their reasoning, students use patterns in the evidence to predict common interactions among organisms in ecosystems as they relate to the phenomenon, (e.g., given specific organisms in a given environment with specified resource availability, which organisms in the system will exhibit competitive interactions). Students predict the following types of interactions:",
					  "i. Predatory interactions.",
					  "ii. Competitive interactions.",
					  "iii. Mutually beneficial interactions."
				   ]
				}
			 },
			 {
				"id":"MS-LS2-3",
				"description":"Develop a model to describe the cycling of matter and flow of energy among living and nonliving parts of an ecosystem.",
				"sourcePages":[
				   17,
				   18
				],
				"details":{
				   "clarificationStatement":"Emphasis is on describing the conservation of matter and flow of energy into and out of various ecosystems, and on defining the boundaries of the system.",
				   "assessmentBoundary":"Assessment does not include the use of chemical reactions to describe the processes.",
				   "sep":[
					  {
						 "id":"Developing and Using Models",
						 "text":[
							"Modeling in 6–8 builds on K–5 experiences and progresses to developing, using, and revising models to describe, test, and predict more abstract phenomena and design systems.",
							"Develop a model to describe phenomena."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS2.B: Cycle of Matter and Energy Transfer in Ecosystems",
						 "text":[
							"Food webs are models that demonstrate how matter and energy is transferred between producers, consumers, and decomposers as the three groups interact within an ecosystem. Transfers of matter into and out of the physical environment occur at every level. Decomposers recycle nutrients from dead plant or animal matter back to the soil in terrestrial environments or to the water in aquatic environments. The atoms that make up the organisms in an ecosystem are cycled repeatedly between the living and nonliving parts of the ecosystem."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Energy and Matter",
						 "text":[
							"The transfer of energy can be tracked as energy flows through a natural system."
						 ]
					  },
					  {
						 "id":"Connections to the Nature of Science",
						 "text":[
							"Scientific Knowledge Assumes an Order and Consistency in Natural Systems",
							"Science assumes that objects and events in natural systems occur in consistent patterns that are understandable through measurement and observation."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Components of the model",
					  "a To make sense of a given phenomenon, students develop a model in which they identify the relevant components, including:",
					  "i. Organisms that can be classified as producers, consumers, and/or decomposers.",
					  "ii. Nonliving parts of an ecosystem (e.g., water, minerals, air) that can provide matter to living organisms or receive matter from living organisms.",
					  "iii. Energy",
					  "b Students define the boundaries of the ecosystem under consideration in their model (e.g., pond, part of a forest, meadow; a whole forest, which contains a meadow, pond, and stream).",
					  "2 Relationships",
					  "a In the model, students describe* relationships between components within the ecosystem, including:",
					  "i. Energy transfer into and out of the system.",
					  "ii. Energy transfer and matter cycling (cycling of atoms):",
					  "1. Among producers, consumers, and decomposers (e.g., decomposers break down consumers and producers via chemical reactions and use the energy released from rearranging those molecules for growth and development).",
					  "2. Between organisms and the nonliving parts of the system (e.g., producers use matter from the nonliving parts of the ecosystem and energy from the sun to produce food from nonfood materials).",
					  "3 Connections",
					  "a Students use the model to describe* the cycling of matter and flow of energy among living and nonliving parts of the defined system, including:",
					  "i. When organisms consume other organisms, there is a transfer of energy and a cycling of atoms that were originally captured from the nonliving parts of the ecosystem by producers.",
					  "ii. The transfer of matter (atoms) and energy between living and nonliving parts of the ecosystem at every level within the system, which allows matter to cycle and energy to flow within and outside of the system.",
					  "b Students use the model to track energy transfer and matter cycling in the system based on consistent and measureable patterns, including:",
					  "i. That the atoms that make up the organisms in an ecosystem are cycled repeatedly between the living and nonliving parts of the ecosystem.",
					  "ii. That matter and energy are conserved through transfers within and outside of the ecosystem."
				   ]
				}
			 },
			 {
				"id":"MS-LS2-4",
				"description":"Construct an argument supported by empirical evidence that changes to physical or biological components of an ecosystem affect populations.",
				"sourcePages":[
				   19,
				   20
				],
				"details":{
				   "clarificationStatement":"Emphasis is on recognizing patterns in data and making warranted inferences about changes in populations, and on evaluating empirical evidence supporting arguments about changes to ecosystems.",
				   "assessmentBoundary":null,
				   "sep":[
					  {
						 "id":"Engaging in Argument from Evidence",
						 "text":[
							"Engaging in argument from evidence in 6–8 builds on K–5 experiences and progresses to constructing a convincing argument that supports or refutes claims for either explanations or solutions about the natural and designed world(s).",
							"Construct an oral and written argument supported by empirical evidence and scientific reasoning to support or refute an explanation or a model for a phenomenon or a solution to a problem."
						 ]
					  },
					  {
						 "id":"Connections to the Nature of Science",
						 "text":[
							"Scientific Knowledge is Based on Empirical Evidence",
							"Science disciplines share common rules of obtaining and evaluating empirical evidence."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS2.C: Ecosystem Dynamics, Functioning, and Resilience",
						 "text":[
							"Ecosystems are dynamic in nature; their characteristics can vary over time. Disruptions to any physical or biological component of an ecosystem can lead to shifts in all its populations."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Stability and Change",
						 "text":[
							"Small changes in one part of a system might cause large changes in another part."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Supported claims",
					  "a Students make a claim to be supported about a given explanation or model for a phenomenon. In their claim, students include the idea that changes to physical or biological components of an ecosystem can affect the populations living there.",
					  "2 Identifying scientific evidence",
					  "a Students identify and describe* the given evidence (e.g., evidence from data, scientific literature) needed for supporting the claim, including evidence about:",
					  "i. Changes in the physical or biological components of an ecosystem, including the magnitude of the changes (e.g., data about rainfall, fires, predator removal, species introduction).",
					  "ii. Changes in the populations of an ecosystem, including the magnitude of the changes (e.g., changes in population size, types of species present, and relative prevalence of a species within the ecosystem).",
					  "iii. Evidence of causal and correlational relationships between changes in the components of an ecosystem with the changes in populations.",
					  "b Students use multiple valid and reliable sources of evidence.",
					  "3 Evaluating and critiquing the evidence",
					  "a Students evaluate the given evidence, identifying the necessary and sufficient evidence for supporting the claim.",
					  "b Students identify alternative interpretations of the evidence and describe* why the evidence supports the student’s claim.",
					  "4 Reasoning and synthesis",
					  "a Students use reasoning to connect the appropriate evidence to the claim and construct an oral or written argument about the causal relationship between physical and biological components of an ecosystem and changes in organism populations, based on patterns in the evidence. In the argument, students describe* a chain of reasoning that includes:",
					  "i. Specific changes in the physical or biological components of an ecosystem cause changes that can affect the survival and reproductive likelihood of organisms within that ecosystem (e.g., scarcity of food or the elimination of a predator will alter the survival and reproductive probability of some organisms).",
					  "ii. Factors that affect the survival and reproduction of organisms can cause changes in the populations of those organisms.",
					  "iii. Patterns in the evidence suggest that many different types of changes (e.g., changes in multiple types of physical and biological components) are correlated with changes in organism populations.",
					  "iv. Several consistent correlational patterns, along with the understanding of specific causal relationships between changes in the components of an ecosystem and changes in the survival and reproduction of organisms, suggest that many changes in physical or biological components of ecosystems can cause changes in populations of organisms.",
					  "v. Some small changes in physical or biological components of an ecosystem are associated with large changes in a population, suggesting that small changes in one component of an ecosystem can cause large changes in another component."
				   ]
				}
			 },
			 {
				"id":"MS-LS2-5",
				"description":"Evaluate competing design solutions for maintaining biodiversity and ecosystem services.*",
				"sourcePages":[
				   21,
				   22
				],
				"details":{
				   "clarificationStatement":"Examples of ecosystem services could include water purification, nutrient recycling, and prevention of soil erosion. Examples of design solution constraints could include scientific, economic, and social considerations.",
				   "assessmentBoundary":null,
				   "sep":[
					  {
						 "id":"Engaging in Argument from Evidence",
						 "text":[
							"Engaging in argument from evidence in 6–8 builds on K–5 experiences and progresses to constructing a convincing argument that supports or refutes claims for either explanations or solutions about the natural and designed world(s).",
							"Evaluate competing design solutions based on jointly developed and agreed upon design criteria."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS2.C: Ecosystem Dynamics, Functioning, and Resilience",
						 "text":[
							"Biodiversity describes the variety of species found in Earth’s terrestrial and oceanic ecosystems. The completeness or integrity of an ecosystem’s biodiversity is often used as a measure of its health."
						 ]
					  },
					  {
						 "id":"LS4.D: Biodiversity and Humans",
						 "text":[
							"Changes in biodiversity can influence humans’ resources, such as food, energy, and medicines, as well as ecosystem services that humans rely on—for example, water purification and recycling.(secondary)"
						 ]
					  },
					  {
						 "id":"ETS1.B: Developing Possible Solutions",
						 "text":[
							"There are systematic processes for evaluating solutions with respect to how well they meet the criteria and constraints of a problem. (secondary)"
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Stability and Change",
						 "text":[
							"Small changes in one part of a system might cause large changes in another part."
						 ]
					  },
					  {
						 "id":"Connections to Engineering, Technology, and Applications of Science",
						 "text":[
							"Influence of Science, Engineering, and Technology on Society and the Natural World",
							"The use of technologies and any limitations on their use are driven by individual or societal needs, desires, and values; by the findings of scientific research; and by differences in such factors as climate, natural resources, and economic conditions. Thus technology use varies from region to region and over time."
						 ]
					  },
					  {
						 "id":"Connections to the Nature of Science",
						 "text":[
							"Science Addresses Questions About the Natural and Material World",
							"Scientific knowledge can describe the consequences of actions but does not necessarily prescribe the decisions that society takes."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Identifying the given design solution and supporting evidence",
					  "a Students identify and describe*:",
					  "i. The given competing design solutions for maintaining biodiversity and ecosystem services.",
					  "ii. The given problem involving biodiversity and/or ecosystem services that is being solved by the given design solutions, including information about why biodiversity and/or ecosystem services are necessary to maintaining a healthy ecosystem.",
					  "iii. The given evidence about performance of the given design solutions.",
					  "2 Identifying any potential additional evidence that is relevant to the evaluation",
					  "a Students identify and describe* the additional evidence (in the form of data, information, or other appropriate forms) that is relevant to the problem, design solutions, and evaluation of the solutions, including:",
					  "i. The variety of species (biodiversity) found in the given ecosystem.",
					  "ii. Factors that affect the stability of the biodiversity of the given ecosystem.",
					  "iii. Ecosystem services (e.g., water purification, nutrient recycling, prevention of soil erosion) that affect the stability of the system.",
					  "b Students collaboratively define and describe* criteria and constraints for the evaluation of the design solution.",
					  "3 Evaluating and critiquing the design solution",
					  "a In their evaluations, students use scientific evidence to:",
					  "i. Compare the ability of each of the competing design solutions to maintain ecosystem stability and biodiversity.",
					  "ii. Clarify the strengths and weaknesses of the competing designs with respect to each criterion and constraint (e.g., scientific, social, and economic considerations).",
					  "iii. Assess possible side effects of the given design solutions on other aspects of the ecosystem, including the possibility that a small change in one component of an ecosystem can produce a large change in another component of the ecosystem."
				   ]
				}
			 }
		  ]
	   },
		{
		  "topicId":"MS-LS3",
		  "topicTitle":"Heredity: Inheritance and Variation of Traits",
		  "tocPage":23,
		  "performanceExpectations":[
			 {
				"id":"MS-LS3-1",
				"description":"Develop and use a model to describe why structural changes to genes (mutations) located on chromosomes may affect proteins and may result in harmful, beneficial, or neutral effects to the structure and function of the organism.",
				"sourcePages":[
				   23,
				   24
				],
				"details":{
				   "clarificationStatement":"Emphasis is on conceptual understanding that changes in genetic material may result in making different proteins.",
				   "assessmentBoundary":"Assessment does not include specific changes at the molecular level, mechanisms for protein synthesis, or specific types of mutations.",
				   "sep":[
					  {
						 "id":"Developing and Using Models",
						 "text":[
							"Modeling in 6–8 builds on K–5 experiences and progresses to developing, using, and revising models to describe, test, and predict more abstract phenomena and design systems.",
							"Develop and use a model to describe phenomena."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS3.A: Inheritance of Traits",
						 "text":[
							"Genes are located in the chromosomes of cells, with each chromosome pair containing two variants of each of many distinct genes. Each distinct gene chiefly controls the production of specific proteins, which in turn affects the traits of the individual. Changes (mutations) to genes can result in changes to proteins, which can affect the structures and functions of the organism and thereby change traits."
						 ]
					  },
					  {
						 "id":"LS3.B: Variation of Traits",
						 "text":[
							"In addition to variations that arise from sexual reproduction, genetic information can be altered because of mutations. Though rare, mutations may result in changes to the structure and function of proteins. Some changes are beneficial, others harmful, and some neutral to the organism."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Structure and Function",
						 "text":[
							"Complex and microscopic structures and systems can be visualized, modeled, and used to describe how their function depends on the shapes, composition, and relationships among its parts, therefore complex natural structures/systems can be analyzed to determine how they function."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Components of the model",
					  "a Students develop a model in which they identify the relevant components for making sense of a given phenomenon involving the relationship between mutations and the effects on the organism, including:",
					  "i. Genes, located on chromosomes.",
					  "ii. Proteins.",
					  "iii. Traits of organisms.",
					  "2 Relationships",
					  "a In their model, students describe* the relationships between components, including:",
					  "i. Every gene has a certain structure, which determines the structure of a specific set of proteins.",
					  "ii. Protein structure influences protein function (e.g., the structure of some blood proteins allows them to attach to oxygen, the structure of a normal digestive protein allows it break down particular food molecules).",
					  "iii. Observable organism traits (e.g., structural, functional, behavioral) result from the activity of proteins.",
					  "3 Connections",
					  "a Students use the model to describe* that structural changes to genes (i.e., mutations) may result in observable effects at the level of the organism, including why structural changes to genes:",
					  "i. May affect protein structure and function.",
					  "ii. May affect how proteins contribute to observable structures and functions in organisms.",
					  "iii. May result in trait changes that are beneficial, harmful, or neutral for the organism.",
					  "b Students use the model to describe* that beneficial, neutral, or harmful changes to protein function can cause beneficial, neutral, or harmful changes in the structure and function of organisms."
				   ]
				}
			 },
			 {
				"id":"MS-LS3-2",
				"description":"Develop and use a model to describe why asexual reproduction results in offspring with identical genetic information and sexual reproduction results in offspring with genetic variation.",
				"sourcePages":[
				   25,
				   26
				],
				"details":{
				   "clarificationStatement":"Emphasis is on using models such as Punnett squares, diagrams, and simulations to describe the cause and effect relationship of gene transmission from parent(s) to offspring and resulting genetic variation.",
				   "assessmentBoundary":null,
				   "sep":[
					  {
						 "id":"Developing and Using Models",
						 "text":[
							"Modeling in 6–8 builds on K–5 experiences and progresses to developing, using, and revising models to describe, test, and predict more abstract phenomena and design systems.",
							"Develop and use a model to describe phenomena."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS1.B: Growth and Development of Organisms",
						 "text":[
							"Organisms reproduce, either sexually or asexually, and transfer their genetic information to their offspring. (secondary)"
						 ]
					  },
					  {
						 "id":"LS3.A: Inheritance of Traits",
						 "text":[
							"Variations of inherited traits between parent and offspring arise from genetic differences that result from the subset of chromosomes (and therefore genes) inherited."
						 ]
					  },
					  {
						 "id":"LS3.B: Variation of Traits",
						 "text":[
							"In sexually reproducing organisms, each parent contributes half of the genes acquired (at random) by the offspring. Individuals have two of each chromosome and hence two alleles of each gene, one acquired from each parent. These versions may be identical or may differ from each other."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Cause and Effect",
						 "text":[
							"Cause and effect relationships may be used to predict phenomena in natural systems."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Components of the model",
					  "a Students develop a model (e.g., Punnett squares, diagrams, simulations) for a given phenomenon involving the differences in genetic variation that arise from sexual and asexual reproduction. In the model, students identify and describe* the relevant components, including:",
					  "i. Chromosome pairs, including genetic variants, in asexual reproduction:",
					  "1. Parents.",
					  "2. Offspring.",
					  "ii. Chromosome pairs, including genetic variants, in sexual reproduction:",
					  "1. Parents.",
					  "2. Offspring.",
					  "2 Relationships",
					  "a In their model, students describe* the relationships between components, including:",
					  "i. During reproduction (both sexual and asexual), parents transfer genetic information in the form of genes to their offspring.",
					  "ii. Under normal conditions, offspring have the same number of chromosomes, and therefore genes, as their parents.",
					  "iii. During asexual reproduction, a single parent’s chromosomes (one set) are the source of genetic material in the offspring.",
					  "iv. During sexual reproduction, two parents (two sets of chromosomes) contribute genetic material to the offspring.",
					  "3 Connections",
					  "a Students use the model to describe* a causal account for why sexual and asexual reproduction result in different amounts of genetic variation in offspring relative to their parents, including that:",
					  "i. In asexual reproduction:",
					  "1. Offspring have a single source of genetic information, and their chromosomes are complete copies of each single parent pair of chromosomes.",
					  "2. Offspring chromosomes are identical to parent chromosomes.",
					  "ii. In sexual reproduction:",
					  "1. Offspring have two sources of genetic information (i.e., two sets of chromosomes) that contribute to each final pair of chromosomes in the offspring.",
					  "2. Because both parents are likely to contribute different genetic information, offspring chromosomes reflect a combination of genetic material from two sources and therefore contain new combinations of genes (genetic variation) that make offspring chromosomes distinct from those of either parent.",
					  "b Students use cause-and-effect relationships found in the model between the type of reproduction and the resulting genetic variation to predict that more genetic variation occurs in organisms that reproduce sexually compared to organisms that reproduce asexually."
				   ]
				}
			 }
		  ]
	   },
		{
		  "topicId":"MS-LS4",
		  "topicTitle":"Biological Evolution: Unity and Diversity",
		  "tocPage":27,
		  "performanceExpectations":[
			 {
				"id":"MS-LS4-1",
				"description":"Analyze and interpret data for patterns in the fossil record that document the existence, diversity, extinction, and change of life forms throughout the history of life on Earth under the assumption that natural laws operate today as in the past.",
				"sourcePages":[
				   27
				],
				"details":{
				   "clarificationStatement":"Emphasis is on finding patterns of changes in the level of complexity of anatomical structures in organisms and the chronological order of fossil appearance in the rock layers.",
				   "assessmentBoundary":"Assessment does not include the names of individual species or geological eras in the fossil record.",
				   "sep":[
					  {
						 "id":"Analyzing and Interpreting Data",
						 "text":[
							"Analyzing data in 6–8 builds on K–5 experiences and progresses to extending quantitative analysis to investigations, distinguishing between correlation and causation, and basic statistical techniques of data and error analysis.",
							"Analyze and interpret data to determine similarities and differences in findings."
						 ]
					  },
					  {
						 "id":"Connections to the Nature of Science",
						 "text":[
							"Scientific Knowledge is Based on Empirical Evidence",
							"Science knowledge is based upon logical and conceptual connections between evidence and explanations."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS4.A: Evidence of Common Ancestry and Diversity",
						 "text":[
							"The collection of fossils and their placement in chronological order (e.g., through the location of the sedimentary layers in which they are found or through radioactive dating) is known as the fossil record. It documents the existence, diversity, extinction, and change of many life forms throughout the history of life on Earth."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Patterns",
						 "text":[
							"Graphs, charts, and images can be used to identify patterns in data."
						 ]
					  },
					  {
						 "id":"Connections to the Nature of Science",
						 "text":[
							"Scientific Knowledge Assumes an Order and Consistency in Natural Systems",
							"Science assumes that objects and events in natural systems occur in consistent patterns that are understandable through measurement and observation."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Organizing data",
					  "a Students organize the given data (e.g., using tables, graphs, charts, images), including the appearance of specific types of fossilized organisms in the fossil record as a function of time, as determined by their locations in the sedimentary layers or the ages of rocks.",
					  "b Students organize the data in a way that allows for the identification, analysis, and interpretation of similarities and differences in the data.",
					  "2 Identifying relationships",
					  "a Students identify:",
					  "i. Patterns between any given set of sedimentary layers and the relative ages of those layers.",
					  "ii. The time period(s) during which a given fossil organism is present in the fossil record.",
					  "iii. Periods of time for which changes in the presence or absence of large numbers of organisms or specific types of organisms can be observed in the fossil record (e.g., a fossil layer with very few organisms immediately next to a fossil layer with many types of organisms).",
					  "iv. Patterns of changes in the level of complexity of anatomical structures in organisms in the fossil record, as a function of time.",
					  "3 Interpreting data",
					  "a Students analyze and interpret the data to determine evidence for the existence, diversity, extinction, and change in life forms throughout the history of Earth, using the assumption that natural laws operate today as they would have in the past. Students use similarities and differences in the observed patterns to provide evidence for:",
					  "i. When mass extinctions occurred.",
					  "ii. When organisms or types of organisms emerged, went extinct, or evolved.",
					  "iii. The long-term increase in the diversity and complexity of organisms on Earth."
				   ]
				}
			 },
			 {
				"id":"MS-LS4-2",
				"description":"Apply scientific ideas to construct an explanation for the anatomical similarities and differences among modern organisms and between modern and fossil organisms to infer evolutionary relationships.",
				"sourcePages":[
				   28
				],
				"details":{
				   "clarificationStatement":"Emphasis is on explanations of the evolutionary relationships among organisms in terms of similarity or differences of the gross appearance of anatomical structures.",
				   "assessmentBoundary":null,
				   "sep":[
					  {
						 "id":"Constructing Explanations and Designing Solutions",
						 "text":[
							"Constructing explanations and designing solutions in 6–8 builds on K–5 experiences and progresses to include constructing explanations and designing solutions supported by multiple sources of evidence consistent with scientific ideas, principles, and theories.",
							"Apply scientific ideas to construct an explanation for real-world phenomena, examples, or events."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS4.A: Evidence of Common Ancestry and Diversity",
						 "text":[
							"Anatomical similarities and differences between various organisms living today and between them and organisms in the fossil record, enable the reconstruction of evolutionary history and the inference of lines of evolutionary descent."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Patterns",
						 "text":[
							"Patterns can be used to identify cause and effect relationships."
						 ]
					  },
					  {
						 "id":"Connections to the Nature of Science",
						 "text":[
							"Scientific Knowledge Assumes an Order and Consistency in Natural Systems",
							"Science assumes that objects and events in natural systems occur in consistent patterns that are understandable through measurement and observation."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Articulating the explanation of phenomena",
					  "a Students articulate a statement that relates a given phenomenon to scientific ideas, including the following ideas about similarities and differences in organisms and their evolutionary relationships:",
					  "i. Anatomical similarities and differences among organisms can be used to infer evolutionary relationships, including:",
					  "1. Among modern organisms.",
					  "2. Between modern and fossil organisms.",
					  "b Students use evidence and reasoning to construct an explanation for the given phenomenon.",
					  "2 Evidence",
					  "a Students identify and describe* evidence (e.g., from students’ own investigations, observations, reading material, archived data, simulations) necessary for constructing the explanation, including similarities and differences in anatomical patterns in and between:",
					  "i. Modern, living organisms (e.g., skulls of modern crocodiles, skeletons of birds; features of modern whales and elephants).",
					  "ii. Fossilized organisms (e.g., skulls of fossilized crocodiles, fossilized dinosaurs).",
					  "3 Reasoning",
					  "a Students use reasoning to connect the evidence to support an explanation. Students describe* the following chain of reasoning for the explanation:",
					  "i. Organisms that share a pattern of anatomical features are likely to be more closely related than are organisms that do not share a pattern of anatomical features, due to the cause-and-effect relationship between genetic makeup and anatomy (e.g., although birds and insects both have wings, the organisms are structurally very different and not very closely related; the wings of birds and bats are structurally similar, and the organisms are more closely related; the limbs of horses and zebras are structurally very similar, and they are more closely related than are birds and bats or birds and insects).",
					  "ii. Changes over time in the anatomical features observable in the fossil record can be used to infer lines of evolutionary descent by linking extinct organisms to living organisms through a series of fossilized organisms that share a basic set of anatomical features."
				   ]
				}
			 },
			 {
				"id":"MS-LS4-3",
				"description":"Analyze displays of pictorial data to compare patterns of similarities in the embryological development across multiple species to identify relationships not evident in the fully formed anatomy.",
				"sourcePages":[
				   29
				],
				"details":{
				   "clarificationStatement":"Emphasis is on inferring general patterns of relatedness among embryos of different organisms by comparing the macroscopic appearance of diagrams or pictures.",
				   "assessmentBoundary":"Assessment of comparisons is limited to gross appearance of anatomical structures in embryological development.",
				   "sep":[
					  {
						 "id":"Analyzing and Interpreting Data",
						 "text":[
							"Analyzing data in 6–8 builds on K–5 experiences and progresses to extending quantitative analysis to investigations, distinguishing between correlation and causation, and basic statistical techniques of data and error analysis.",
							"Analyze displays of data to identify linear and nonlinear relationships."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS4.A: Evidence of Common Ancestry and Diversity",
						 "text":[
							"Comparison of the embryological development of different species also reveals similarities that show relationships not evident in the fully formed anatomy."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Patterns",
						 "text":[
							"Graphs, charts, and images can be used to identify patterns in data."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Organizing data",
					  "a Students organize the given displays of pictorial data of embryos by developmental stage and by organism (e.g., early, middle, just prior to birth) to allow for the identification, analysis, and interpretation of relationships in the data.",
					  "2 Identifying relationships",
					  "a Students analyze their organized pictorial displays to identify linear and nonlinear relationships, including:",
					  "i. Patterns of similarities in embryos across species (e.g., early mammal embryos and early fish embryos both contain gill slits, whale embryos and the embryos of land animals — even some snakes — have hind limbs).",
					  "ii. Patterns of changes as embryos develop (e.g., mammal embryos lose their gill slits, but the gill slits develop into gills in fish).",
					  "3 Interpreting data",
					  "a Students use patterns of similarities and changes in embryo development to describe* evidence for relatedness among apparently diverse species, including similarities that are not evident in the fully formed anatomy (e.g., mammals and fish are more closely related than they appear to be based on their adult features, whales are related to land animals)."
				   ]
				}
			 },
			 {
				"id":"MS-LS4-4",
				"description":"Construct an explanation based on evidence that describes how genetic variations of traits in a population increase some individuals’ probability of surviving and reproducing in a specific environment.",
				"sourcePages":[
				   30,
				   31
				],
				"details":{
				   "clarificationStatement":"Emphasis is on using simple probability statements and proportional reasoning to construct explanations.",
				   "assessmentBoundary":"Assessment does not include Hardy Weinberg calculations.",
				   "sep":[
					  {
						 "id":"Constructing Explanations and Designing Solutions",
						 "text":[
							"Constructing explanations and designing solutions in 6–8 builds on K–5 experiences and progresses to include constructing explanations and designing solutions supported by multiple sources of evidence consistent with scientific ideas, principles, and theories.",
							"Construct an explanation that includes qualitative or quantitative relationships between variables that describe phenomena."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS4.B: Natural Selection",
						 "text":[
							"Natural selection leads to the predominance of certain traits in a population, and the suppression of others."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Cause and Effect",
						 "text":[
							"Phenomena may have more than one cause, and some cause and effect relationships in systems can only be described using probability."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Articulating the explanation for phenomena",
					  "a Students articulate a statement that relates the given phenomenon to scientific ideas about the cause-and-effect relationship between the inheritance of traits increasing the chances of successful reproduction and natural selection.",
					  "b Students use evidence and reasoning to construct an explanation for the given phenomenon.",
					  "2 Evidence",
					  "a Students identify and describe* given evidence (e.g., from students’ own investigations, observations, reading materials, archived data) necessary for constructing the explanation, including:",
					  "i. Individuals in a species have genetic variation that can be passed on to their offspring.",
					  "ii. The probability of a specific organism surviving and reproducing in a specific environment.",
					  "iii. The traits (i.e., specific variations of a characteristic) and the cause-and-effect relationships between those traits and the probability of survival and reproduction of a given organism in a specific environment.",
					  "iv. The particular genetic variations (associated with those traits) that are carried by that organism.",
					  "3 Reasoning",
					  "a Students use reasoning to connect the evidence and support an explanation that describes* the relationship between genetic variation and the success of organisms in a specific environment. Students describe* a chain of reasoning that includes:",
					  "i. Any population in a given environment contains a variety of available, inheritable genetic traits.",
					  "ii. For a specific environment (e.g., different environments may have limited food availability, predators, nesting site availability, light availability), some traits confer advantages that make it more probable that an organism will be able to survive and reproduce there.",
					  "iii. In a population, there is a cause-and-effect relationship between the variation of traits and the probability that specific organisms will be able to survive and reproduce.",
					  "iv. Variation of traits is a result of genetic variations occurring in the population.",
					  "v. The proportion of individual organisms that have genetic variations and traits that are advantageous in a particular environment will increase from generation to generation due to natural selection because the probability that those individuals will survive and reproduce is greater.",
					  "vi. Similarly, the proportion of individual organisms that have genetic variations and traits that are disadvantageous in a particular environment will be less likely to survive, and the disadvantageous traits will decrease from generation to generation due to natural selection."
				   ]
				}
			 },
			 {
				"id":"MS-LS4-5",
				"description":"Gather and synthesize information about the technologies that have changed the way humans influence the inheritance of desired traits in organisms.",
				"sourcePages":[
				   32,
				   33
				],
				"details":{
				   "clarificationStatement":"Emphasis is on synthesizing information from reliable sources about the influence of humans on genetic outcomes in artificial selection (such as genetic modification, animal husbandry, gene therapy); and, on the impacts these technologies have on society as well as the technologies leading to these scientific discoveries.",
				   "assessmentBoundary":null,
				   "sep":[
					  {
						 "id":"Obtaining, Evaluating, and Communicating Information",
						 "text":[
							"Obtaining, evaluating, and communicating information in 6–8 builds on K–5 experiences and progresses to evaluating the merit and validity of ideas and methods.",
							"Gather, read, and synthesize information from multiple appropriate sources and assess the credibility, accuracy, and possible bias of each publication and methods used, and describe how they are supported or not supported by evidence."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS4.B: Natural Selection",
						 "text":[
							"In artificial selection, humans have the capacity to influence certain characteristics of organisms by selective breeding. One can choose desired parental traits determined by genes, which are then passed on to offspring."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Cause and Effect",
						 "text":[
							"Phenomena may have more than one cause, and some cause and effect relationships in systems can only be described using probability."
						 ]
					  },
					  {
						 "id":"Connections to Engineering, Technology, and Applications of Science",
						 "text":[
							"Interdependence of Science, Engineering, and Technology",
							"Engineering advances have led to important discoveries in virtually every field of science, and scientific discoveries have led to the development of entire industries and engineered systems."
						 ]
					  },
					  {
						 "id":"Connections to the Nature of Science",
						 "text":[
							"Science Addresses Questions About the Natural and Material World",
							"Scientific knowledge can describe the consequences of actions but does not necessarily prescribe the decisions that society takes."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Obtaining information",
					  "a Students gather information about at least two technologies that have changed the way humans influence the inheritance of desired traits in plants and animals through artificial selection by choosing desired parental traits determined by genes, which are then often passed on to offspring. Examples could include gene therapy, genetic modification, and selective breeding of plants and animals.",
					  "b Students use at least two appropriate and reliable sources of information for investigating each technology.",
					  "2 Evaluating information",
					  "a Students assess the credibility, accuracy, and possible bias of each publication and method used in the information they gather.",
					  "b Students use their knowledge of artificial selection and additional sources to describe* how the information they gather is or is not supported by evidence.",
					  "c Students synthesize the information from multiple sources to provide examples of how technologies have changed the ways that humans are able to influence the inheritance of desired traits in organisms.",
					  "d Students use the information to identify and describe* how a better understanding of cause-and effect relationships in how traits occur in organisms has led to advances in technology that provide a higher probability of being able to influence the inheritance of desired traits in organisms."
				   ]
				}
			 },
			 {
				"id":"MS-LS4-6",
				"description":"Use mathematical representations to support explanations of how natural selection may lead to increases and decreases of specific traits in populations over time.",
				"sourcePages":[
				   34,
				   35
				],
				"details":{
				   "clarificationStatement":"Emphasis is on using mathematical models, probability statements, and proportional reasoning to support explanations of trends in changes to populations over time.",
				   "assessmentBoundary":"Assessment does not include Hardy Weinberg calculations.",
				   "sep":[
					  {
						 "id":"Using Mathematics and Computational Thinking",
						 "text":[
							"Mathematical and computational thinking in 6–8 builds on K–5 experiences and progresses to identifying patterns in large data sets and using mathematical concepts to support explanations and arguments.",
							"Use mathematical representations to support scientific conclusions and design solutions."
						 ]
					  }
				   ],
				   "dci":[
					  {
						 "id":"LS4.C: Adaptation",
						 "text":[
							"Adaptation by natural selection acting over generations is one important process by which species change over time in response to changes in environmental conditions. Traits that support successful survival and reproduction in the new environment become more common; those that do not become less common. Thus, the distribution of traits in a population changes."
						 ]
					  }
				   ],
				   "ccc":[
					  {
						 "id":"Cause and Effect",
						 "text":[
							"Phenomena may have more than one cause, and some cause and effect relationships in systems can only be described using probability."
						 ]
					  }
				   ],
				   "evidenceStatements":[
					  "1 Representation",
					  "a Students identify the explanations for phenomena that they will support, which include:",
					  "i. Characteristics of a species change over time (i.e., over generations) through adaptation by natural selection in response to changes in environmental conditions.",
					  "ii. Traits that better support survival and reproduction in a new environment become more common within a population within that environment.",
					  "iii. Traits that do not support survival and reproduction as well become less common within a population in that environment.",
					  "iv. When environmental shifts are too extreme, populations do not have time to adapt and may become extinct.",
					  "b From given mathematical and/or computational representations of phenomena, students identify the relevant components, including:",
					  "i. Population changes (e.g., trends, averages, histograms, graphs, spreadsheets) gathered from historical data or simulations.",
					  "ii. The distribution of specific traits over time from data and/or simulations.",
					  "iii. Environmental conditions (e.g., climate, resource availability) over time from data and/or simulations.",
					  "2 Mathematical Modeling",
					  "a Students use the given mathematical and/or computational representations (e.g., trends, averages, histograms, graphs, spreadsheets) of the phenomenon to identify relationships in the data and/or simulations, including:",
					  "i. Changes and trends over time in the distribution of traits within a population.",
					  "ii. Multiple cause-and-effect relationships between environmental conditions and natural selection in a population.",
					  "iii. The increases or decreases of some traits within a population can have more than one environmental cause.",
					  "3 Analysis",
					  "a Students analyze the mathematical and/or computational representations to provide and describe* evidence that distributions of traits in populations change over time in response to changes in environmental conditions. Students synthesize their analysis together with scientific information about natural selection to describe* that species adapt through natural selection. This results in changes in the distribution of traits within a population and in the probability that any given organism will carry a particular trait.",
					  "b Students use the analysis of the mathematical and/or computational representations (including proportional reasoning) as evidence to support the explanations that:",
					  "i. Through natural selection, traits that better support survival and reproduction are more common in a population than those traits that are less effective.",
					  "ii. Populations are not always able to adapt and survive because adaptation by natural selection occurs over generations.",
					  "c Based on their analysis, students describe* that because there are multiple cause-and-effect relationships contributing to the phenomenon, for each different cause it is not possible to predict with 100% certainty what will happen."
				   ]
				}
			 }
		  ]
	   },
		  {
			"topicId": "MS-ESS1",
			"topicTitle": "Earth’s Place in the Universe",
			"tocPage": 67,
			"performanceExpectations": [
			  {
				"id": "MS-ESS1-1",
				"description": "Develop and use a model of the Earth-sun-moon system to describe the cyclic patterns of lunar phases, eclipses of the sun and moon, and seasons.",
				"sourcePages": [
				  67
				],
				"details": {
				  "clarificationStatement": "Examples of models can be physical, graphical, or conceptual.",
				  "assessmentBoundary": null,
				  "sep": [
					{
					  "id": "Developing and Using Models",
					  "text": [
						"Modeling in 6–8 builds on K–5 experiences and progresses to developing, using, and revising models to describe, test, and predict more abstract phenomena and design systems.",
						"Develop and use a model to describe phenomena."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS1.A: The Universe and Its Stars",
					  "text": [
						"Patterns of the apparent motion of the sun, the moon, and stars in the sky can be observed, described, predicted, and explained with models."
					  ]
					},
					{
					  "id": "ESS1.B: Earth and the Solar System",
					  "text": [
						"This model of the solar system can explain eclipses of the sun and the moon. Earth's spin axis is fixed in direction over the short-term but tilted relative to its orbit around the sun. The seasons are a result of that tilt and are caused by the differential intensity of sunlight on different areas of Earth across the year."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Patterns",
					  "text": [
						"Patterns can be used to identify cause-and-effect relationships."
					  ]
					},
					{
					  "id":"Connections to the Nature of Science",
						 "text":[
							"Scientific Knowledge Assumes an Order and Consistency in Natural Systems",
							"Science assumes that objects and events in natural systems occur in consistent patterns that are understandable through measurement and observation."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Components of the model",
					"a To make sense of a given phenomenon involving, students develop a model (e.g., physical, conceptual, graphical) of the Earth-moon-sun system in which they identify the relevant components, including:",
					"i. Earth, including the tilt of its axis of rotation.",
					"ii. Sun.",
					"iii. Moon.",
					"iv. Solar energy.",
					"b Students indicate the accuracy of size and distance (scale) relationships within the model, including any scale limitations within the model.",
					"2 Relationships",
					"a In their model, students describe* the relationships between components, including:",
					"i. Earth rotates on its tilted axis once an Earth day.",
					"ii. The moon rotates on its axis approximately once a month.",
					"iii. Relationships between Earth and the moon:",
					"1. The moon orbits Earth approximately once a month.",
					"2. The moon rotates on its axis at the same rate at which it orbits Earth so that the side of the moon that faces Earth remains the same as it orbits.",
					"3. The moon’s orbital plane is tilted with respect to the plane of the Earth’s orbit around the sun.",
					"iv. Relationships between the Earth-moon system and the sun:",
					"1. Earth-moon system orbits the sun once an Earth year.",
					"2. Solar energy travels in a straight line from the sun to Earth and the moon so that the side of Earth or the moon that faces the sun is illuminated.",
					"3. Solar energy reflects off of the side of the moon that faces the sun and can travel to Earth.",
					"4. The distance between Earth and the sun stays relatively constant throughout the Earth’s orbit.",
					"5. Solar energy travels in a straight line from the sun and hits different parts of the curved Earth at different angles — more directly at the equator and less directly at the poles.",
					"6. The Earth’s rotation axis is tilted with respect to its orbital plane around the sun. Earth maintains the same relative orientation in space, with its North Pole pointed toward the North Star throughout its orbit.",
					"3 Connections",
					"a Students use patterns observed from their model to provide causal accounts for events, including:",
					"i. Moon phases:",
					"1. Solar energy coming from the sun bounces off of the moon and is viewed on Earth as the bright part of the moon.",
					"2. The visible proportion of the illuminated part of the moon (as viewed from Earth) changes over the course of a month as the location of the moon relative to Earth and the sun changes.",
					"3. The moon appears to become more fully illuminated until “full” and then less fully illuminated until dark, or “new,” in a pattern of change that corresponds to what proportion of the illuminated part of the moon is visible from Earth.",
					"ii. Eclipses:",
					"1. Solar energy is prevented from reaching the Earth during a solar eclipse because the moon is located between the sun and Earth.",
					"2. Solar energy is prevented from reaching the moon (and thus reflecting off of the moon to Earth) during a lunar eclipse because Earth is located between the sun and moon.",
					"3. Because the moon’s orbital plane is tilted with respect to the plane of the Earth’s orbit around the sun, for a majority of time during an Earth month, the moon is not in a position to block solar energy from reaching Earth, and Earth is not in a position to block solar energy from reaching the moon.",
					"iii. Seasons:",
					"1. Because the Earth’s axis is tilted, the most direct and intense solar energy occurs over the summer months, and the least direct and intense solar energy occurs over the winter months.",
					"2. The change in season at a given place on Earth is directly related to the orientation of the tilted Earth and the position of Earth in its orbit around the sun because of the change in the directness and intensity of the solar energy at that place over the course of the year.",
					"a. Summer occurs in the Northern Hemisphere at times in the Earth’s orbit when the northern axis of Earth is tilted toward the sun. Summer occurs in the Southern Hemisphere at times in the Earth’s orbit when the southern axis of Earth is tilted toward the sun.",
					"b. Winter occurs in the Northern Hemisphere at times in the Earth’s orbit when the northern axis of Earth is tilted away from the sun. Summer occurs in the Southern Hemisphere at times in the Earth’s orbit when the southern axis of Earth is tilted away from the sun.",
					"b Students use their model to predict:",
					"i. The phase of the moon when given the relative locations of the Earth, sun, and moon.",
					"ii. The relative positions of the Earth, sun, and moon when given a moon phase.",
					"iii. Whether an eclipse will occur, given the relative locations of the Earth, sun, and moon and a position on Earth from which the moon or sun can be viewed (depending on the type of eclipse).",
					"iv. The relative positions of the Earth, sun, and moon, given a type of eclipse and a position on Earth from which the moon/sun can be viewed.",
					"v. The season on Earth, given the relative positions of Earth and the sun (including the orientation of the Earth’s axis) and a position on Earth.",
					"vi. The relative positions of Earth and the sun when given a season and a relative position (e.g. far north, far south, equatorial) on Earth."
				  ]
				}
			  },
			  {
				"id": "MS-ESS1-2",
				"description": "Develop and use a model to describe the role of gravity in the motions within galaxies and the solar system.",
				"sourcePages": [
				  67
				],
				"details": {
				  "clarificationStatement": "Emphasis for the model is on gravity as the force that holds together the solar system and Milky Way galaxy and controls orbital motions within them. Examples of models can be physical (such as the analogy of distance along a football field or computer visualizations of elliptical orbits) or conceptual (such as mathematical proportions relative to the size of familiar objects such as students' school or state).",
				  "assessmentBoundary": "Assessment does not include Kepler's Laws of orbital motion or the apparent retrograde motion of the planets as viewed from Earth.",
				  "sep": [
					{
					  "id": "Developing and Using Models",
					  "text": [
						"Modeling in 6–8 builds on K–5 experiences and progresses to developing, using, and revising models to describe, test, and predict more abstract phenomena and design systems.",
						"Develop and use a model to describe phenomena."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS1.A: The Universe and Its Stars",
					  "text": [
						"Earth and its solar system are part of the Milky Way galaxy, which is one of many galaxies in the universe."
					  ]
					},
					{
					  "id": "ESS1.B: Earth and the Solar System",
					  "text": [
						"The solar system consists of the sun and a collection of objects, including planets, their moons, and asteroids that are held in orbit around the sun by its gravitational pull on them.",
						"The solar system appears to have formed from a disk of dust and gas, drawn together by gravity."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Systems and System Models",
					  "text": [
						"Models can be used to represent systems and their interactions."
					  ]
					},
					{
					  "id":"Connections to the Nature of Science",
						 "text":[
							"Scientific Knowledge Assumes an Order and Consistency in Natural Systems",
							"Science assumes that objects and events in natural systems occur in consistent patterns that are understandable through measurement and observation."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Components of the model",
					"a To make sense of a given phenomenon, students develop a model in which they identify the relevant components of the system, including:",
					"i. Gravity.",
					"ii. The solar system as a collection of bodies, including the sun, planets, moons, and asteroids.",
					"iii. The Milky Way galaxy as a collection of stars (e.g., the sun) and their associated systems of objects.",
					"iv. Other galaxies in the universe",
					"b Students indicate the relative spatial scales of solar systems and galaxies in the model.",
					"2 Relationships",
					"a Students describe* the relationships and interactions between components of the solar and galaxy systems, including:",
					"i. Gravity as an attractive force between solar system and galaxy objects that:",
					"1. Increases with the mass of the interacting objects increases.",
					"2. Decreases as the distances between objects increases.",
					"ii. The orbital motion of objects in our solar system (e.g., moons orbit around planets, all objects within the solar system orbit the sun).",
					"iii. The orbital motion, in the form of a disk, of vast numbers of stars around the center of the Milky Way.",
					"iv. That our solar system is one of many systems orbiting the center of the larger system of the Milky Way galaxy.",
					"3 Connections",
					"a Students use the model to describe* that gravity is a predominantly inward-pulling force that can keep smaller/less massive objects in orbit around larger/more massive objects.",
					"b Students use the model to describe* that gravity causes a pattern of smaller/less massive objects orbiting around larger/more massive objects at all system scales in the universe, including that:",
					"i. Gravitational forces from planets cause smaller objects (e.g., moons) to orbit around planets.",
					"ii. The gravitational force of the sun causes the planets and other bodies to orbit around it, holding the solar system together.",
					"iii. The gravitational forces from the center of the Milky Way cause stars and stellar systems to orbit around the center of the galaxy.",
					"iv. The hierarchy pattern of orbiting systems in the solar system was established early in its history as the disk of dust and gas was driven by gravitational forces to form moon-planet and planet-sun orbiting systems.",
					"c Students use the model to describe* that objects too far away from the sun do not orbit it because the sun’s gravitational force on those objects is too weak to pull them into orbit.",
					"d Students use the model to describe* what a given phenomenon might look like without gravity (e.g., smaller planets would move in straight paths through space, rather than orbiting a more massive body)."
				  ]
				}
			  },
			  {
				"id": "MS-ESS1-3",
				"description": "Analyze and interpret data to determine scale properties of objects in the solar system.",
				"sourcePages": [
				  67
				],
				"details": {
				  "clarificationStatement": "Emphasis is on the analysis of data from Earth-based instruments, space-based telescopes, and spacecraft to determine similarities and differences among solar system objects. Examples of scale properties include the sizes of an object's layers (such as crust and atmosphere), surface features (such as volcanoes), and orbital radius. Examples of data include statistical information, drawings and photographs, and models.",
				  "assessmentBoundary": "Assessment does not include recalling facts about properties of the planets and other solar system bodies.",
				  "sep": [
					{
					  "id": "Analyzing and Interpreting Data",
					  "text": [
						"Analyzing data in 6–8 builds on K–5 experiences and progresses to extending quantitative analysis to investigations, distinguishing between correlation and causation, and basic statistical techniques of data and error analysis.",
						"Analyze and interpret data to determine similarities and differences in findings."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS1.B: Earth and the Solar System",
					  "text": [
						"The solar system consists of the sun and a collection of objects, including planets, their moons, and asteroids that are held in orbit around the sun by its gravitational pull on them."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Scale, Proportion, and Quantity",
					  "text": [
						"Time, space, and energy phenomena can be observed at various scales using models to study systems that are too large or too small."
					  ]
					},
					{
					  "id":"Connections to Engineering, Technology, and Applications of Science",
						 "text":[
							"Interdependence of Science, Engineering, and Technology",
							"Engineering advances have led to important discoveries in virtually every field of science and scientific discoveries have led to the development of entire industries and engineered systems."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Organizing data",
					"a Students organize given data on solar system objects (e.g., surface features, object layers, orbital radii) from various Earth- and space-based instruments to allow for analysis and interpretation (e.g., transforming tabular data into pictures, diagrams, graphs, or physical models that illustrate changes in scale).",
					"b Students describe* that different representations illustrate different characteristics of objects in the solar system, including differences in scale.",
					"2 Identifying relationships",
					"a Students use quantitative analyses to describe* similarities and differences among solar system objects by describing* patterns of features of those objects at different scales, including:",
					"i. Distance from the sun.",
					"ii. Diameter.",
					"iii. Surface features (e.g., sizes of volcanoes).",
					"iv. Structure.",
					"v. Composition (e.g., ice versus rock versus gas).",
					"b Students identify advances in solar system science made possible by improved engineering (e.g., knowledge of the evolution of the solar system from lunar exploration and space probes) and new developments in engineering made possible by advances in science (e.g., space-based telescopes from advances in optics and aerospace engineering).",
					"3 Interpreting data",
					"a Students use the patterns they find in multiple types of data at varying scales to draw conclusions about the identifying characteristics of different categories of solar system objects (e.g., planets, meteors, asteroids, comets) based on their features, composition, and locations within the solar system (e.g., most asteroids are rocky bodies between Mars and Jupiter, while most comets reside in orbits farther from the sun and are composed mostly of ice).",
					"b Students use patterns in data as evidence to describe* that two objects may be similar when viewed at one scale (e.g., types of surface features) but may appear to be quite different when viewed at a different scale (e.g., diameter or number of natural satellites).",
					"c Students use the organization of data to facilitate drawing conclusions about the patterns of scale properties of more than one scale, such as those that are too large or too small to directly observe."
				  ]
				}
			  },
			  {
				"id": "MS-ESS1-4",
				"description": "Construct a scientific explanation based on evidence from rock strata for how the geologic time scale is used to organize Earth's 4.6-billion-year-old history.",
				"sourcePages": [
				  67
				],
				"details": {
				  "clarificationStatement": "Emphasis is on how analyses of rock formations and the fossils they contain are used to establish relative ages of major events in Earth's history. Examples of Earth's major events could range from being very recent (such as the last Ice Age or the earliest fossils of homo sapiens) to very old (such as the formation of Earth or the earliest evidence of life). Examples can include the formation of mountain chains and ocean basins, the evolution or extinction of particular living organisms, or significant volcanic eruptions.",
				  "assessmentBoundary": "Assessment does not include recalling the names of specific periods or epochs and events within them.",
				  "sep": [
					{
					  "id": "Constructing Explanations and Designing Solutions",
					  "text": [
						"Constructing explanations and designing solutions in 6–8 builds on K–5 experiences and progresses to include constructing explanations and designing solutions supported by multiple sources of evidence consistent with scientific ideas, principles, and theories.",
						"Construct a scientific explanation based on valid and reliable evidence obtained from sources (including the students' own experiments) and the assumption that theories and laws that describe the natural world operate today as they did in the past and will continue to do so in the future."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS1.C: The History of Planet Earth",
					  "text": [
						"The geologic time scale interpreted from rock strata provides a way to organize Earth's history. Analyses of rock strata and the fossil record provide only relative dates, not an absolute scale."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Scale, Proportion, and Quantity",
					  "text": [
						"Time, space, and energy phenomena can be observed at various scales using models to study systems that are too large or too small."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Articulating the explanation of phenomena",
					"a Students articulate a statement that relates the given phenomenon to a scientific idea, including how events in the Earth’s 4.6 billion-year-old history are organized relative to one another using the geologic time scale.",
					"b Students use evidence and reasoning to construct an explanation. In their explanation, students describe* how the relative order of events is determined on the geologic time scale using:",
					"i. Rock strata and relative ages of rock units (e.g., patterns of layering).",
					"ii. Major events in the Earth’s history and/or specific changes in fossils over time (e.g., formation of mountain chains, formation of ocean basins, volcanic eruptions, glaciations, asteroid impacts, extinctions of groups of organism).",
					"2 Evidence",
					"a Students identify and describe* the evidence necessary for constructing the explanation, including:",
					"i. Types and order of rock strata.",
					"ii. The fossil record.",
					"iii. Identification of and evidence for major event(s) in the Earth’s history (e.g., volcanic eruptions, asteroid impacts, etc.).",
					"b Students use multiple valid and reliable sources of evidence, which may include students’ own experiments.",
					"3 Reasoning",
					"a Students use reasoning, along with the assumption that theories and laws that describe the natural world operate today as they did in the past and will continue to do so in the future, to connect the evidence and support an explanation for how the geologic time scale is used to construct a timeline of the Earth’s history. Students describe* the following chain of reasoning for their explanation:",
					"i. Unless they have been disturbed by subsequent activity, newer rock layers sit on top of older rock layers, allowing for a relative ordering in time of the formation of the layers (i.e., older sedimentary rocks lie beneath younger sedimentary rocks).",
					"ii. Any rocks or features that cut existing rock strata are younger than the rock strata that they cut (e.g., a younger fault cutting across older, existing rock strata).",
					"iii. The fossil record can provide relative dates based on the appearance or disappearance of organisms (e.g., fossil layers that contain only extinct animal groups are usually older than fossil layers that contain animal groups that are still alive today, and layers with only microbial fossils are typical of the earliest evidence of life).",
					"iv. Specific major events (e.g., extensive lava flows, volcanic eruptions, asteroid impacts) can be used to indicate periods of time that occurred before a given event from periods that occurred after it.",
					"v. Using a combination of the order of rock layers, the fossil record, and evidence of major geologic events, the relative time ordering of events can be constructed as a model for Earth’s history, even though the timescales involved are immensely vaster than the lifetimes of humans or the entire history of humanity."
				  ]
				}
			  }
			],
			"connections": {
			  "connectionsToOtherDcisInGradeLevel": "MS.PS2.A (MS-ESS1-1),(MS-ESS1-2); MS.PS2.B (MS-ESS1-1), (MS-ESS1-2); MS.LS4.A (MS-ESS1-4); MS.LS4.C (MS-ESS1-4); MS.ESS2.A (MS-ESS1-3)",
			  "articulationOfDcisAcrossGradeLevels": "3.PS2.A (MS-ESS1-1),(MS-ESS1-2); 3.LS4.A (MS-ESS1-4); 3.LS4.C (MS-ESS1-4); 4.ESS1.C (MS-ESS1-4); 5.PS2.B (MS-ESS1-1),(MS-ESS1-2); 5.ESS1.A (MS-ESS1-2); 5.ESS1.B (MS-ESS1-1),(MS-ESS1-2),(5-ESS1-3); HS.PS1.C (MS-ESS1-4); HS.PS2.A (MS-ESS1-1),(MS-ESS1-2); HS.PS2.B (MS-ESS1-1),(MS-ESS1-2); HS.LS4.A (MS-ESS1-4); HS.LS4.C (MS-ESS1-4); HS.ESS1.A (MS-ESS1-2); HS.ESS1.B (MS-ESS1-1), (MS-ESS1-2), (MS-ESS1-3); HS.ESS1.C (MS-ESS1-4); HS.ESS2.A (MS-ESS1-3), (MS-ESS1-4)",
			  "commonCoreStateStandards": {
				"elaLiteracy": [
				  {
					"id": "RST.6-8.1",
					"text": "Cite specific textual evidence to support analysis of science and technical texts. (MS-ESS1-3), (MS-ESS1-4)"
				  },
				  {
					"id": "RST.6-8.7",
					"text": "Integrate quantitative or technical information expressed in words in a text with a version of that information expressed visually (e.g., in a flow chart, diagram, model, graph, or table). (MS-ESS1-3)"
				  },
				  {
					"id": "WHST.6-8.2",
					"text": "Write informative/explanatory texts to examine a topic and convey ideas, concepts, and information through the selection, organization, and analysis of relevant content. (MS-ESS1-4)"
				  },
				  {
					"id": "SL.8.5",
					"text": "Integrate multimedia and visual displays into presentations to clarify information, strengthen claims and evidence, and add interest. (MS-ESS1-1), (MS-ESS1-2)"
				  }
				],
				"mathematics": [
				  {
					"id": "MP.2",
					"text": "Reason abstractly and quantitatively. (MS-ESS1-3)"
				  },
				  {
					"id": "MP.4",
					"text": "Model with mathematics. (MS-ESS1-1), (MS-ESS1-2)"
				  },
				  {
					"id": "6.RP.A.1",
					"text": "Understand the concept of a ratio and use ratio language to describe a ratio relationship between two quantities. (MS-ESS1-1), (MS-ESS1-2), (MS-ESS1-3)"
				  },
				  {
					"id": "7.RP.A.2",
					"text": "Recognize and represent proportional relationships between quantities. (MS-ESS1-1),(MS-ESS1-2),(MS-ESS1-3)"
				  },
				  {
					"id": "6.EE.B.6",
					"text": "Use variables to represent numbers and write expressions when solving a real-world or mathematical problem; understand that a v ariable can represent an unknown number, or, depending on the purpose at hand, any number in a specified set. (MS-ESS1-2), (MS-ESS1-4)"
				  },
				  {
					"id": "7.EE.B.4",
					"text": "Use variables to represent quantities in a real-world or mathematical problem, and construct simple equations and inequalities to solve problemsby reasoning about the quantities. (MS-ESS1-2),(MS-ESS1-4)"
				  }
				]
			  }
			}
		  },
		  {
			"topicId": "MS-ESS2",
			"topicTitle": "Earth’s Systems",
			"tocPage": 69,
			"performanceExpectations": [
			  {
				"id": "MS-ESS2-1",
				"description": "Develop a model to describe the cycling of Earth's materials and the flow of energy that drives this process.",
				"sourcePages": [
				  69
				],
				"details": {
				  "clarificationStatement": "Emphasis is on the processes of melting, crystallization, weathering, deformation, and sedimentation, which act together to form minerals and rocks through the cycling of Earth's materials.",
				  "assessmentBoundary": "Assessment does not include the identification and naming of minerals.",
				  "sep": [
					{
					  "id": "Developing and Using Models",
					  "text": [
						"Modeling in 6–8 builds on K–5 experiences and progresses to developing, using, and revising models to describe, test, and predict more abstract phenomena and design systems.",
						"Develop and use a model to describe phenomena."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS2.A: Earth Materials and Systems",
					  "text": [
						"All Earth processes are the result of energy flowing and matter cycling within and among the planet's systems. This energy is derived from the sun and Earth's hot interior. The energy that flows and matter that cycles produce chemical and physical changes in Earth's materials and living organisms."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Stability and Change",
					  "text": [
						"Explanations of stability and change in natural or designed systems can be constructed by examining the changes over time and processes at different scales, including the atomic scale."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Components of the model",
					"a To make sense of a given phenomenon, students develop a model in which they identify the relevant components, including:",
					"i. General types of Earth materials that can be found in different locations, including:",
					"1. Those located at the surface (exterior) and/or in the interior",
					"2. Those that exist(ed) before and/or after chemical and/or physical changes that occur during Earth processes (e.g., melting, sedimentation, weathering).",
					"ii. Energy from the sun.",
					"iii. Energy from the Earth’s hot interior.",
					"iv. Relevant earth processes",
					"v. The temporal and spatial scales for the system.",
					"2 Relationships",
					"a In the model, students describe* relationships between components, including:",
					"i. Different Earth processes (e.g., melting, sedimentation, crystallization) drive matter cycling (i.e., from one type of Earth material to another) through observable chemical and physical changes.",
					"ii. The movement of energy that originates from the Earth’s hot interior and causes the cycling of matter through the Earth processes of melting, crystallization, and deformation.",
					"iii. Energy flows from the sun cause matter cycling via processes that produce weathering, erosion, and sedimentation (e.g., wind, rain).",
					"iv. The temporal and spatial scales over which the relevant Earth processes operate.",
					"3 Connections",
					"a Students use the model to describe* (based on evidence for changes over time and processes at different scales) that energy from the Earth’s interior and the sun drive Earth processes that together cause matter cycling through different forms of Earth materials.",
					"b Students use the model to account for interactions between different Earth processes, including:",
					"i. The Earth’s internal heat energy drives processes such as melting, crystallization, and deformation that change the atomic arrangement of elements in rocks and that move and push rock material to the Earth’s surface where it is subject to surface processes like weathering and erosion.",
					"ii. Energy from the sun drives the movement of wind and water that causes the erosion, movement, and sedimentation of weathered Earth materials.",
					"iii. Given the right setting, any rock on Earth can be changed into a new type of rock by processes driven by the Earth’s internal energy or by energy from the sun.",
					"c Students describe* that these changes are consistently occurring but that landforms appear stable to humans because they are changing on time scales much longer than human lifetimes."
				  ]
				}
			  },
			  {
				"id": "MS-ESS2-2",
				"description": "Construct an explanation based on evidence for how geoscience processes have changed Earth's surface at varying time and spatial scales.",
				"sourcePages": [
				  69
				],
				"details": {
				  "clarificationStatement": "Emphasis is on how processes change Earth's surface at time and spatial scales that can be large (such as slow plate motions or the uplift of large mountain ranges) or small (such as rapid landslides or microscopic geochemical reactions), and how many geoscience processes (such as earthquakes, volcanoes, and meteor impacts) usually behave gradually but are punctuated by catastrophic events. Examples of geoscience processes include surface weathering and deposition by the movements of water, ice, and wind. Emphasis is on geoscience processes that shape local geographic features, where appropriate.",
				  "assessmentBoundary": null,
				  "sep": [
					{
					  "id": "Constructing Explanations and Designing Solutions",
					  "text": [
						"Constructing explanations and designing solutions in 6–8 builds on K–5 experiences and progresses to include constructing explanations and designing solutions supported by multiple sources of evidence consistent with scientific ideas, principles, and theories.",
						"Construct a scientific explanation based on valid and reliable evidence obtained from sources (including the students' own experiments) and the assumption that theories and laws that describe the natural world operate today as they did in the past and will continue to do so in the future."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS2.A: Earth Materials and Systems",
					  "text": [
						"The planet's systems interact over scales that range from microscopic to global in size, and they operate over fractions of a second to billions of years. These interactions have shaped Earth's history and will determine its future."
					  ]
					},
					{
					  "id": "ESS2.C: The Roles of Water in Earth's Surface Processes",
					  "text": [
						"Water's movements—both on the land and underground—cause weathering and erosion, which change the land's surface features and create underground formations."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Scale, Proportion, and Quantity",
					  "text": [
						"Time, space, and energy phenomena can be observed at various scales using models to study systems that are too large or too small."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Articulating the explanation of phenomena",
					"a Students articulate a statement that relates a given phenomenon to a scientific idea, including that geoscience processes have changed the Earth’s surface at varying time and spatial scales.",
					"b Students use evidence and reasoning to construct an explanation for the given phenomenon, which involves changes at Earth’s surface.",
					"2 Evidence",
					"a Students identify and describe* the evidence necessary for constructing an explanation, including:",
					"i. The slow and large-scale motion of the Earth’s plates and the results of that motion.",
					"ii. Surface weathering, erosion, movement, and the deposition of sediment ranging from large to microscopic scales (e.g., sediment consisting of boulders and microscopic grains of sand, raindrops dissolving microscopic amounts of minerals).",
					"iii. Rapid catastrophic events (e.g., earthquakes, volcanoes, meteor impacts).",
					"b Students identify the corresponding timescales for each identified geoscience process.",
					"c Students use multiple valid and reliable sources, which may include students’ own investigations, evidence from data, and observations from conceptual models used to represent changes that occur on very large or small spatial and/or temporal scales (e.g., stream tables to illustrate erosion and deposition, maps and models to show the motion of tectonic plates).",
					"3 Reasoning",
					"a Students use reasoning, along with the assumption that theories and laws that describe the natural world operate today as they did in the past and will continue to do so in the future, to connect the evidence and support an explanation for how geoscience processes have changed the Earth’s surface at a variety of temporal and spatial scales. Students describe* the following chain of reasoning for their explanation:",
					"i. The motion of the Earth’s plates produces changes on a planetary scale over a range of time periods from millions to billions of years. Evidence for the motion of plates can explain large-scale features of the Earth’s surface (e.g., mountains, distribution of continents) and how they change.",
					"ii. Surface processes such as erosion, movement, weathering, and the deposition of sediment can modify surface features, such as mountains, or create new features, such as canyons. These processes can occur at spatial scales ranging from large to microscopic over time periods ranging from years to hundreds of millions of years.",
					"iii. Catastrophic changes can modify or create surface features over a very short period of time compared to other geoscience processes, and the results of those catastrophic changes are subject to further changes over time by processes that act on longer time scales (e.g., erosion of a meteor crater).",
					"iv. A given surface feature is the result of a broad range of geoscience processes occurring at different temporal and spatial scales.",
					"v. Surface features will continue to change in the future as geoscience processes continue to occur."
				  ]
				}
			  },
			  {
				"id": "MS-ESS2-3",
				"description": "Analyze and interpret data on the distribution of fossils and rocks, continental shapes, and seafloor structures to provide evidence of the past plate motions.",
				"sourcePages": [
				  69
				],
				"details": {
				  "clarificationStatement": "Examples of data include similarities of rock and fossil types on different continents, the shapes of the continents (including continental shelves), and the locations of ocean structures (such as ridges, fracture zones, and trenches).",
				  "assessmentBoundary": "Paleomagnetic anomalies in oceanic and continental crust are not assessed.",
				  "sep": [
					{
					  "id": "Analyzing and Interpreting Data",
					  "text": [
						"Analyzing data in 6–8 builds on K–5 experiences and progresses to extending quantitative analysis to investigations, distinguishing between correlation and causation, and basic statistical techniques of data and error analysis.",
						"Analyze and interpret data to provide evidence for phenomena."
					  ]
					},
					{
					  "id": "Connections to the Nature of Science",
					  "text": [
						"Scientific Knowledge is Open to Revision in Light of New Evidence",
					  	"Science findings are frequently revised and/or reinterpreted based on new evidence."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS1.C: The History of Planet Earth (secondary)",
					  "text": [
						"Tectonic processes continually generate new ocean sea floor at ridges and destroy old sea floor at trenches. (HS.ESS1.C GBE) (secondary to MS-ESS2-3)"
					  ]
					},
					{
					  "id": "ESS2.B: Plate Tectonics and Large-Scale System Interactions",
					  "text": [
						"Maps of ancient land and water patterns, based on investigations of rocks and fossils, make clear how Earth's plates have moved great distances, collided, and spread apart."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Patterns",
					  "text": [
						"Patterns in rates of change and other numerical relationships can provide information about natural systems."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Organizing data",
					"a Students organize given data that represent the distribution and ages of fossils and rocks, continental shapes, seafloor structures, and/or age of oceanic crust.",
					"b Students describe* what each dataset represents.",
					"c Students organize the given data in a way that facilitates analysis and interpretation.",
					"2 Identifying relationships",
					"a Students analyze the data to identify relationships (including relationships that can be used to infer numerical rates of change, such as patterns of age of seafloor) in the datasets about Earth features.",
					"3 Interpreting data",
					"a Students use the analyzed data to provide evidence for past plate motion. Students describe*:",
					"i. Regions of different continents that share similar fossils and similar rocks suggest that, in the geologic past, those sections of continent were once attached and have since separated.",
					"ii. The shapes of continents, which roughly fit together (like pieces in a jigsaw puzzle) suggest that those land masses were once joined and have since separated.",
					"iii. The separation of continents by the sequential formation of new seafloor at the center of the ocean is inferred by age patterns in oceanic crust that increase in age from the center of the ocean to the edges of the ocean.",
					"iv. The distribution of seafloor structures (e.g., volcanic ridges at the centers of oceans, trenches at the edges of continents) combined with the patterns of ages of rocks of the seafloor (youngest ages at the ridge, oldest ages at the trenches) supports the interpretation that new crust forms at the ridges and then moves away from the ridges as new crust continues to form and that the oldest crust is being destroyed at seafloor trenches."
				  ]
				}
			  },
			  {
				"id": "MS-ESS2-4",
				"description": "Develop a model to describe the cycling of water through Earth's systems driven by energy from the sun and the force of gravity.",
				"sourcePages": [
				  69
				],
				"details": {
				  "clarificationStatement": "Emphasis is on the ways water changes its state as it moves through the multiple pathways of the hydrologic cycle. Examples of models can be conceptual or physical.",
				  "assessmentBoundary": "A quantitative understanding of the latent heats of vaporization and fusion is not assessed.",
				  "sep": [
					{
					  "id": "Developing and Using Models",
					  "text": [
						"Modeling in 6–8 builds on K–5 experiences and progresses to developing, using, and revising models to describe, test, and predict more abstract phenomena and design systems.",
						"Develop a model to describe unobservable mechanisms."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS2.C: The Roles of Water in Earth's Surface Processes",
					  "text": [
						"Water continually cycles among land, ocean, and atmosphere via transpiration, evaporation, condensation and crystallization, and precipitation, as well as downhill flows on land.",
						"Global movements of water and its changes in form are propelled by sunlight and gravity."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Energy and Matter",
					  "text": [
						"Within a natural or designed system, the transfer of energy drives the motion and/or cycling of matter."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Components of the model",
					"a To make sense of a phenomenon, students develop a model in which they identify the relevant components:",
					"i. Water (liquid, solid, and in the atmosphere).",
					"ii. Energy in the form of sunlight.",
					"iii. Gravity.",
					"iv. Atmosphere.",
					"v. Landforms.",
					"vi. Plants and other living things.",
					"2 Relationships",
					"a In their model, students describe* the relevant relationships between components, including:",
					"i. Energy transfer from the sun warms water on Earth, which can evaporate into the atmosphere.",
					"ii. Water vapor in the atmosphere forms clouds, which can cool and condense to produce precipitation that falls to the surface of Earth.",
					"iii. Gravity causes water on land to move downhill (e.g., rivers and glaciers) and much of it eventually flows into oceans.",
					"iv. Some liquid and solid water remains on land in the form of bodies of water and ice sheets.",
					"v. Some water remains in the tissues of plants and other living organisms, and this water is released when the tissues decompose.",
					"3 Connections",
					"a Students use the model to account for both energy from light and the force of gravity driving water cycling between oceans, the atmosphere, and land, including that:",
					"i. Energy from the sun drives the movement of water from the Earth (e.g., oceans, landforms, plants) into the atmosphere through transpiration and evaporation.",
					"ii. Water vapor in the atmosphere can cool and condense to form rain or crystallize to form snow or ice, which returns to Earth when pulled down by gravity.",
					"iii. Some rain falls back into the ocean, and some rain falls on land. Water that falls on land can:",
					"1. Be pulled down by gravity to form surface waters such as rivers, which join together and generally flow back into the ocean.",
					"2. Evaporate back into the atmosphere.",
					"3. Be taken up by plants, which release it through transpiration and also eventually through decomposition.",
					"4. Be taken up by animals, which release it through respiration and also eventually through decomposition.",
					"5. Freeze (crystallize) and/or collect in frozen form, in some cases forming glaciers or ice sheets.",
					"6. Be stored on land in bodies of water or below ground in aquifers.",
					"b Students use the model to describe* that the transfer of energy between water and its environment drives the phase changes that drive water cycling through evaporation, transpiration, condensation, crystallization, and precipitation.",
					"c Students use the model to describe* how gravity interacts with water in different phases and locations to drive water cycling between the Earth’s surface and the atmosphere."
				  ]
				}
			  },
			  {
				"id": "MS-ESS2-5",
				"description": "Collect data to provide evidence for how the motions and complex interactions of air masses result in changes in weather conditions.",
				"sourcePages": [
				  69
				],
				"details": {
				  "clarificationStatement": "Emphasis is on how air masses flow from regions of high pressure to low pressure, causing weather (defined by temperature, pressure, humidity, precipitation, and wind) at a fixed location to change over time, and how sudden changes in weather can result when different air masses collide. Emphasis is on how weather can be predicted within probabilistic ranges. Examples of data can be provided to students (such as weather maps, diagrams, and visualizations) or obtained through laboratory experiments (such as with condensation).",
				  "assessmentBoundary": "Assessment does not include recalling the names of cloud types or weather symbols used on weather maps or the reported diagrams from weather stations.",
				  "sep": [
					{
					  "id": "Planning and Carrying Out Investigations",
					  "text": [
						"Planning and carrying out investigations in 6-8 builds on K-5 experiences and progresses to include investigations that use multiple variables and provide evidence to support explanations or solutions.",
						"Collect data to produce data to serve as the basis for evidence to answer scientific questions or test design solutions under a range of conditions."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS2.C: The Roles of Water in Earth's Surface Processes",
					  "text": [
						"The complex patterns of the changes and the movement of water in the atmosphere, determined by winds, landforms, and ocean temperatures and currents, are major determinants of local weather patterns."
					  ]
					},
					{
					  "id": "ESS2.D: Weather and Climate",
					  "text": [
						"Because these patterns are so complex, weather can only be predicted probabilistically."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Cause and Effect",
					  "text": [
						"Cause and effect relationships may be used to predict phenomena in natural or designed systems."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Identifying the phenomenon under investigation",
					"a From the given investigation plan, students describe* the phenomenon under investigation, which includes the relationships between air mass interactions and weather conditions.",
					"b Students identify the purpose of the investigation, which includes providing evidence to answer questions about how motions and complex interactions of air masses result in changes in weather conditions [note: expectations of students regarding mechanisms are limited to relationships between patterns of activity of air masses and changes in weather].",
					"2 Identifying the evidence to address the purpose of the investigation",
					"a From a given investigation plan, students describe* the data to be collected and the evidence to be derived from the data that would indicate relationships between air mass movement and changes in weather, including:",
					"i. Patterns in weather conditions in a specific area (e.g., temperature, air pressure, humidity, wind speed) over time.",
					"ii. The relationship between the distribution and movement of air masses and landforms, ocean temperatures, and currents.",
					"iii. The relationship between observed, large-scale weather patterns and the location or movement of air masses, including patterns that develop between air masses (e.g., cold fronts may be characterized by thunderstorms).",
					"b Students describe* how the evidence to be collected will be relevant to determining the relationship between patterns of activity of air masses and changes in weather conditions.",
					"c Students describe* that because weather patterns are so complex and have multiple causes, weather can be predicted only probabilistically.",
					"3 Planning the investigation",
					"a Students describe* the tools and methods used in the investigation, including how they are relevant to the purpose of the investigation.",
					"4 Collecting the data",
					"a According to the provided investigation plan, students make observations and record data, either firsthand and/or from professional weather monitoring services."
				  ]
				}
			  },
			  {
				"id": "MS-ESS2-6",
				"description": "Develop and use a model to describe how unequal heating and rotation of the Earth cause patterns of atmospheric and oceanic circulation that determine regional climates.",
				"sourcePages": [
				  69
				],
				"details": {
				  "clarificationStatement": "Emphasis is on how patterns vary by latitude, altitude, and geographic land distribution. Emphasis of atmospheric circulation is on the sunlight-driven latitudinal banding, the Coriolis effect, and resulting prevailing winds; emphasis of ocean circulation is on the transfer of heat by the global ocean convection cycle, which is constrained by the Coriolis effect and the outlines of continents. Examples of models can be diagrams, maps and globes, or digital representations.",
				  "assessmentBoundary": "Assessment does not include the dynamics of the Coriolis effect.",
				  "sep": [
					{
					  "id": "Developing and Using Models",
					  "text": [
						"Modeling in 6–8 builds on K–5 experiences and progresses to developing, using, and revising models to describe, test, and predict more abstract phenomena and design systems.",
						"Develop and use a model to describe phenomena."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS2.C: The Roles of Water in Earth's Surface Processes",
					  "text": [
						"Variations in density due to variations in temperature and salinity drive a global pattern of interconnected ocean currents."
					  ]
					},
					{
					  "id": "ESS2.D: Weather and Climate",
					  "text": [
						"Weather and climate are influenced by interactions involving sunlight, the ocean, the atmosphere, ice, landforms, and living things. These interactions vary with latitude, altitude, and local and regional geography, all of which can affect oceanic and atmospheric flow patterns.",
						"The ocean exerts a major influence on weather and climate by absorbing energy from the sun, releasing it over time, and globally redistributing it through ocean currents."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Systems and System Models",
					  "text": [
						"Models can be used to represent systems and their interactions—such as inputs, processes and outputs—and energy, matter, and information flows within systems."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Components of the model",
					"a To make sense of a phenomenon, students develop a model in which they identify the relevant components of the system, with inputs and outputs, including:",
					"i. The rotating Earth.",
					"ii. The atmosphere.",
					"iii. The ocean, including the relative rate of thermal energy transfer of water compared to land or air.",
					"iv. Continents and the distribution of landforms on the surface of Earth.",
					"v. Global distribution of ice.",
					"vi. Distribution of living things.",
					"vii. Energy.",
					"1. Radiation from the sun as an input.",
					"2. Thermal energy that exists in the atmosphere, water, land, and ice (as represented by temperature).",
					"2 Relationships",
					"a In the model, students identify and describe* the relationships between components of the system, including:",
					"i. Differences in the distribution of solar energy and temperature changes, including:",
					"1. Higher latitudes receive less solar energy per unit of area than do lower latitudes, resulting in temperature differences based on latitude.",
					"2. Smaller temperature changes tend to occur in oceans than on land in the same amount of time.",
					"3. In general, areas at higher elevations have lower average temperatures than do areas at lower elevations.",
					"4. Features on the Earth’s surface, such as the amount of solar energy reflected back into the atmosphere or the absorption of solar energy by living things, affect the amount of solar energy transferred into heat energy.",
					"ii. Motion of ocean waters and air masses (matter):",
					"1. Fluid matter (i.e., air, water) flows from areas of higher density to areas of lower density (due to temperature or salinity). The density of a fluid can vary for several different reasons (e.g., changes in salinity and temperature of water can each cause changes in density). Differences in salinity and temperature can, therefore, cause fluids to move vertically and, as a result of vertical movement, also horizontally because of density differences.",
					"iii. Factors affecting the motion of wind and currents:",
					"1. The Earth’s rotation causes oceanic and atmospheric flows to curve when viewed from the rotating surface of Earth (Coriolis force).",
					"2. The geographical distribution of land limits where ocean currents can flow.",
					"3. Landforms affect atmospheric flows (e.g., mountains deflect wind and/or force it to higher elevation).",
					"iv. Thermal energy transfer:",
					"1. Thermal energy moves from areas of high temperature to areas of lower temperature either through the movement of matter, via radiation, or via conduction of heat from warmer objects to cooler objects.",
					"2. Absorbing or releasing thermal energy produces a more rapid change in temperature on land compared to in water.",
					"3. Absorbing or releasing thermal energy produces a more rapid change in temperature in the atmosphere compared to either on land or in water so the atmosphere is warmed or cooled by being in contact with land or the ocean.",
					"3 Connections",
					"a Students use the model to describe*:",
					"i. The general latitudinal pattern in climate (higher average annual temperatures near the equator and lower average annual temperatures at higher latitudes) caused by more direct light (greater energy per unit of area) at the equator (more solar energy) and less direct light at the poles (less solar energy).",
					"ii. The general latitudinal pattern of drier and wetter climates caused by the shift in the amount of air moisture during precipitation from rising moisture-rich air and the sinking of dry air.",
					"iii. The pattern of differing climates in continental areas as compared to the oceans. Because water can absorb more solar energy for every degree change in temperature compared to land, there is a greater and more rapid temperature change on land than in the ocean. At the centers of landmasses, this leads to conditions typical of continental climate patterns.",
					"iv. The pattern that climates near large water bodies, such as marine coasts, have comparatively smaller changes in temperature relative to the center of the landmass. Land near the oceans can exchange thermal energy through the air, resulting in smaller changes in temperature. At the edges of landmasses, this leads to marine climates.",
					"v. The pattern that climates at higher altitudes have lower temperatures than climates at lower altitudes. Because of the direct relationship between temperature and pressure, given the same amount of thermal energy, air at lower pressures (higher altitudes) will have lower temperatures than air at higher pressures (lower altitudes).",
					"vi. Regional patterns of climate (e.g., temperature or moisture) related to a specific pattern of water or air circulation, including the role of the following in contributing to the climate pattern:",
					"1. Air or water moving from areas of high temperature, density , and/or salinity to areas of low temperature, density, and/or salinity.",
					"2. The Earth’s rotation, which affects atmospheric and oceanic circulation.",
					"3. The transfer of thermal energy with the movement of matter.",
					"4. The presence of landforms (e.g., the rain shadow effect).",
					"b Students use the model to describe* the role of each of its components in producing a given regional climate."
				  ]
				}
			  }
			],
			"connections": {
			  "connectionsToOtherDcisInGradeLevel": "MS.PS1.A (MS-ESS2-1), (MS-ESS2-4), (MS-ESS2-5); MS.PS1.B (MS-ESS2-1), (MS-ESS2-2); MS.PS2.A (MS-ESS2-5),(MS-ESS2-6); MS.PS2.B (MS-ESS2-4); MS.PS3.A (MS-ESS2-4), (MS-ESS2-5); MS.PS3.B (MS-ESS2-1), (MS-ESS2-5), (MS-ESS2-6); MS.PS3.D (MS-ESS2-4); MS.PS4.B (MS-ESS2-6); MS.LS2.B (MS-ESS2-1),(MS-ESS2-2); MS.LS2.C (MS-ESS2-1); MS.LS4.A (MS-ESS2-3); MS.ESS1.B (MS-ESS2-1); MS.ESS3.C (MS-ESS2-1)",
			  "articulationOfDcisAcrossGradeLevels": "3.PS2.A (MS-ESS2-4), (MS-ESS2-6); 3.LS4.A (MS-ESS2-3); 3.ESS2.D (MS-ESS2-5), (MS-ESS2-6); 3.ESS3.B (MS-ESS2-3); 4.PS3.B (MS-ESS2-1), (MS-ESS2-4); 4.ESS1.C (MS-ESS2-2), (MS-ESS2-3); 4.ESS2.A (MS-ESS2-1),(MS-ESS2-2); 4.ESS2.B (MS-ESS2-3); 4.ESS2.E (MS-ESS2-2); 4.ESS3.B (MS-ESS2-3); 5.PS2.B (MS-ESS2-4); 5.ESS2.A (MS-ESS2-1), (MS-ESS2-2), (MS-ESS2-5), (MS-ESS2-6); 5.ESS2.C (MS-ESS2-4); HS.PS1.B (MS-ESS2-1); HS.PS2.B (MS-ESS2-4), (MS-ESS2-6); HS.PS3.B (MS-ESS2-1), (MS-ESS2-4); HS.PS3.D (MS-ESS2-2), (MS-ESS2-6); HS.PS4.B (MS-ESS2-4); HS.LS1.C (MS-ESS2-1); HS.LS2.B (MS-ESS2-1), (MS-ESS2-2); HS.LS4.A (MS-ESS2-3); HS.LS4.C (MS-ESS2-3); HS.ESS1.B (MS-ESS2-6); HS.ESS1.C (MS-ESS2-2),(MS-ESS2-3); HS.ESS2.A (MS-ESS2-1), (MS-ESS2-2), (MS-ESS2-3), (MS-ESS2-4), (MS-ESS2-6); HS.ESS2.B (MS-ESS2-2), (MS-ESS2-3); HS.ESS2.C (MS-ESS2-1), (MS-ESS2-2), (MS-ESS2-4), (MS-ESS2-5); HS.ESS2.D (MS-ESS2-2), (MS-ESS2-4), (MS-ESS2-5), (MS-ESS2-6); HS.ESS2.E (MS-ESS2-1),(MS-ESS2-2); HS.ESS3.D (MS-ESS2-2)",
			  "commonCoreStateStandards": {
				"elaLiteracy": [
				  {
					"id": "RST.6-8.1",
					"text": "Cite specific textual evidence to support analysis of science and technical texts. (MS-ESS2-2), (MS-ESS2-3),(MS-ESS2-5)"
				  },
				  {
					"id": "RST.6-8.7",
					"text": "Integrate quantitative or technical information expressed in words in a text with a version of that information expressed visually (e.g., in a flowchart, diagram, model, graph, or table). (MS-ESS2-3)"
				  },
				  {
					"id": "RST.6-8.9",
					"text": "Compare and contrast the information gained from experiments, simulations, video, or multimedia sources with that gained from reading a text on the same topic. (MS-ESS2-3), (MS-ESS2-5)"
				  },
				  {
					"id": "WHST.6-8.2",
					"text": "Write informative/explanatory texts to examine a topic and convey ideas, concepts, and information through the selection, organization, and analysis of relevant content. (MS-ESS2-2)"
				  },
				  {
					"id": "WHST.6-8.8",
					"text": "Gather relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and following a standard format for citation. (MS-ESS2-5)"
				  },
				  {
					"id": "SL.8.5",
					"text": "Integrate multimedia and visual displays into presentations to clarify information, strengthen claims and evidence, and add interest. (MS-ESS2-1), (MS-ESS2-2), (MS-ESS2-6)"
				  }
				],
				"mathematics": [
				  {
					"id": "MP.2",
					"text": "Reason abstractly and quantitatively. (MS-ESS2-2), (MS-ESS2-3), (MS-ESS2-5)"
				  },
				  {
					"id": "6.NS.C.5",
					"text": "Understand that positive and negative numbers are used together to describe quantities having opposite directions or values (e.g., temperature above/below zero, elevation above/below sea level, credits/debits, positive/negative electric charge); use positive and negative numbers to represent quantities in real-world contexts, explaining the meaning of 0 in each situation. (MS-ESS2-5)"
				  },
				  {
					"id": "6.EE.B.6",
					"text": "Use variables to represent numbers and write expressions when solving a real-world or mathematical problem; understand that a variable can represent an unknown number, or, depending on the purpose at hand, any number in a specified set. (MS-ESS2-2), (MS-ESS2-3)"
				  },
				  {
					"id": "7.EE.B.4",
					"text": "Use variables to represent quantities in a real-world or mathematical problem, and construct simple equations and inequalities to solve problems by reasoning about the quantities. (MS-ESS2-2), (MS-ESS2-3)"
				  }
				]
			  }
			}
		  },
		  {
			"topicId": "MS-ESS3",
			"topicTitle": "Earth and Human Activity",
			"tocPage": 71,
			"performanceExpectations": [
			  {
				"id": "MS-ESS3-1",
				"description": "Construct a scientific explanation based on evidence for how the uneven distributions of Earth's mineral, energy, and groundwater resources are the result of past and current geoscience processes.",
				"sourcePages": [
				  71
				],
				"details": {
				  "clarificationStatement": "Emphasis is on how these resources are limited and typically non-renewable, and how their distributions are significantly changing as a result of removal by humans. Examples of uneven distributions of resources as a result of past processes include but are not limited to petroleum (locations of the burial of organic marine sediments and subsequent geologic traps), metal ores (locations of past volcanic and hydrothermal activity associated with subduction zones), and soil (locations of active weathering and/or deposition of rock).",
				  "assessmentBoundary": null,
				  "sep": [
					{
					  "id": "Constructing Explanations and Designing Solutions",
					  "text": [
						"Constructing explanations and designing solutions in 6–8 builds on K–5 experiences and progresses to include constructing explanations and designing solutions supported by multiple sources of evidence consistent with scientific ideas, principles, and theories.",
						"Construct a scientific explanation based on valid and reliable evidence obtained from sources (including the students' own experiments) and the assumption that theories and laws that describe the natural world operate today as they did in the past and will continue to do so in the future."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS3.A: Natural Resources",
					  "text": [
						"Humans depend on Earth's land, ocean, atmosphere, and biosphere for many different resources. Minerals, fresh water, and biosphere resources are limited, and many are not renewable or replaceable over human lifetimes. These resources are distributed unevenly around the planet as a result of past geologic processes."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Cause and Effect",
					  "text": [
						"Cause and effect relationships may be used to predict phenomena in natural or designed systems."
					  ]
					},
					{
					  "id": "Connections to Engineering, Technology, and Applications of Science",
					  "text": [
					  	"Influence of Science, Engineering, and Technology on Society and the Natural World",
						"All human activity draws on natural resources and has both short and long-term consequences, positive as well as negative, for the health of people and the natural environment."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Articulating the explanation of phenomena",
					"a Students articulate a statement relating a given phenomenon to scientific ideas, including that past and current geoscience processes have caused the uneven distribution of the Earth’s resources, including:",
					"i. That the uneven distributions of the Earth’s mineral, energy, and groundwater resources are the results of past and current geologic processes.",
					"ii. That resources are typically limited and nonrenewable due to factors such as the long amounts of time required for some resources to form or the environment in which resources were created forming once or only rarely in the Earth’s history.",
					"b Students use evidence and reasoning to construct a scientific explanation of the phenomenon.",
					"2 Identifying the scientific evidence to construct the explanation",
					"a Students identify and describe* the evidence necessary for constructing the explanation, including:",
					"i. Type and distribution of an example of each type of Earth resource: mineral, energy, and groundwater.",
					"ii. Evidence for the past and current geologic processes (e.g., volcanic activity, sedimentary processes) that have resulted in the formation of each of the given resources.",
					"iii. The ways in which the extraction of each type of resource by humans changes how much and where more of that resource can be found.",
					"b Students use multiple valid and reliable sources of evidence.",
					"3 Reasoning",
					"a Students use reasoning to connect the evidence and support an explanation. Students describe* a chain of reasoning that includes:",
					"i. The Earth’s resources are formed as a result of past and current geologic processes.",
					"ii. The environment or conditions that formed the resources are specific to certain areas and/or times on Earth, thus identifying why those resources are found only in those specific places/periods.",
					"iii. As resources as used, they are depleted from the sources until they can be replenished, mainly through geologic processes.",
					"iv. Because many resources continue to be formed in the same ways that they were in the past, and because the amount of time required to form most of these resources (e.g., minerals, fossil fuels) is much longer than timescales of human lifetimes, these resources are limited to current and near-future generations. Some resources (e.g., groundwater) can be replenished on human timescales and are limited based on distribution.",
					"v. The extraction and use of resources by humans decreases the amounts of these resources available in some locations and changes the overall distribution of these resources on Earth."
				  ]
				}
			  },
			  {
				"id": "MS-ESS3-2",
				"description": "Analyze and interpret data on natural hazards to forecast future catastrophic events and inform the development of technologies to mitigate their effects.",
				"sourcePages": [
				  71
				],
				"details": {
				  "clarificationStatement": "Emphasis is on how some natural hazards, such as volcanic eruptions and severe weather, are preceded by phenomena that allow for reliable predictions, but others, such as earthquakes, occur suddenly and with no notice, and thus are not yet predictable. Examples of natural hazards can be taken from interior processes (such as earthquakes and volcanic eruptions), surface processes (such as mass wasting and tsunamis), or severe weather events (such as hurricanes, tornadoes, and floods). Examples of data can include the locations, magnitudes, and frequencies of the natural hazards. Examples of technologies can be global (such as satellite systems to monitor hurricanes or forest fires) or local (such as building basements in tornado-prone regions or reservoirs to mitigate droughts).",
				  "assessmentBoundary": null,
				  "sep": [
					{
					  "id": "Analyzing and Interpreting Data",
					  "text": [
						"Analyzing data in 6–8 builds on K–5 and progresses to extending quantitative analysis to investigations, distinguishing between correlation and causation, and basic statistical techniques of data and error analysis.",
						"Analyze and interpret data to determine similarities and differences in findings."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS3.B: Natural Hazards",
					  "text": [
						"Mapping the history of natural hazards in a region, combined with an understanding of related geologic forces can help forecast the locations and likelihoods of future events."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Patterns",
					  "text": [
						"Graphs, charts, and images can be used to identify patterns in data."
					  ]
					},
					{
					  "id": "Connections to Engineering, Technology, and Applications of Science",
					  "text": [
					  	"Influence of Science, Engineering, and Technology on Society and the Natural World",
						"The uses of technologies and any limitations on their use are driven by individual or societal needs, desires, and values; by the findings of scientific research; and by differences in such factors as climate, natural resources, and economic conditions. Thus technology use varies from region to region and over time."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Organizing data",
					"a Students organize given data that represent the type of natural hazard event and features associated with that type of event, including the location, magnitude, frequency, and any associated precursor event or geologic forces.",
					"b Students organize data in a way that facilitates analysis and interpretation.",
					"c Students describe* what each dataset represents.",
					"2 Identifying relationships",
					"a Students analyze data to identify and describe* patterns in the datasets, including:",
					"i. The location of natural hazard events relative to geographic and/or geologic features.",
					"ii. Frequency of natural hazard events.",
					"iii. Severity of natural hazard events.",
					"iv. Types of damage caused by natural hazard events.",
					"v. Location or timing of features and phenomena (e.g., aftershocks, flash floods) associated with natural hazard events.",
					"b Students describe* similarities and differences among identified patterns.",
					"3 Interpreting data",
					"a Students use the analyzed data to describe*:",
					"i. Areas that are susceptible to the natural hazard events, including areas designated as at the greatest and least risk for severe events.",
					"ii. How frequently areas, including areas experiencing the highest and lowest frequency of events, are at risk.",
					"iii. What type of damage each area is at risk of during a given natural hazard event.",
					"iv. What features, if any, occur before a given natural hazard event that can be used to predict the occurrence of the natural hazard event and when and where they can be observed.",
					"b Using patterns in the data, students make a forecast for the potential of a natural hazard event to affect an area in the future, including information on frequency and/or probability of event occurrence; how severe the event is likely to be; where the event is most likely to cause the most damage; and what events, if any, are likely to precede the event.",
					"c Students give at least three examples of the technologies that engineers have developed to mitigate the effects of natural hazards (e.g., the design of buildings and bridges to resist earthquakes, warning sirens for tsunamis, storm shelters for tornados, levees along rivers to prevent flooding)."
				  ]
				}
			  },
			  {
				"id": "MS-ESS3-3",
				"description": "Apply scientific principles to design a method for monitoring and minimizing a human impact on the environment.",
				"sourcePages": [
				  71
				],
				"details": {
				  "clarificationStatement": "Examples of the design process include examining human environmental impacts, assessing the kinds of solutions that are feasible, and designing and evaluating solutions that could reduce that impact. Examples of human impacts can include water usage (such as the withdrawal of water from streams and aquifers or the construction of dams and levees), land usage (such as urban development, agriculture, or the removal of wetlands), and pollution (such as of the air, water, or land).",
				  "assessmentBoundary": null,
				  "sep": [
					{
					  "id": "Constructing Explanations and Designing Solutions",
					  "text": [
						"Constructing explanations and designing solutions in 6–8 builds on K–5 experiences and progresses to include constructing explanations and designing solutions supported by multiple sources of evidence consistent with scientific ideas, principles, and theories.",
						"Apply scientific principles to design an object, tool, process or system."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS3.C: Human Impacts on Earth Systems",
					  "text": [
						"Human activities have significantly altered the biosphere, sometimes damaging or destroying natural habitats and causing the extinction of other species. But changes to Earth's environments can have different impacts (negative and positive) for different living things.",
						"Typically as human populations and per-capita consumption of natural resources increase, so do the negative impacts on Earth unless the activities and technologies involved are engineered otherwise."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Cause and Effect",
					  "text": [
						"Relationships can be classified as causal or correlational, and correlation does not necessarily imply causation."
					  ]
					},
					{
					  "id": "Connections to Engineering, Technology, and Applications of Science",
					  "text": [
					  	"Influence of Science, Engineering, and Technology on Society and the Natural World",
						"The uses of technologies and any limitations on their use are driven by individual or societal needs, desires, and values; by the findings of scientific research; and by differences in such factors as climate, natural resources, and economic conditions. Thus technology use varies from region to region and over time."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Using scientific knowledge to generate design solutions",
					"a Given a problem related to human impact on the environment, students use scientific information and principles to generate a design solution that:",
					"i. Addresses the results of the particular human activity.",
					"ii. Incorporates technologies that can be used to monitor and minimize negative effects that human activities have on the environment.",
					"b Students identify relationships between the human activity and the negative environmental impact based on scientific principles, and distinguish between causal and correlational relationships to facilitate the design of the solution.",
					"2 Describing criteria and constraints, including quantification when appropriate",
					"a Students define and quantify, when appropriate, criteria and constraints for the solution, including:",
					"i. Individual or societal needs and desires.",
					"ii. Constraints imposed by economic conditions (e.g., costs of building and maintaining the solution).",
					"3 Evaluating potential solutions",
					"a Students describe* how well the solution meets the criteria and constraints, including monitoring or minimizing a human impact based on the causal relationships between relevant scientific principles about the processes that occur in, as well as among, Earth systems and the human impact on the environment.",
					"b Students identify limitations of the use of technologies employed by the solution."
				  ]
				}
			  },
			  {
				"id": "MS-ESS3-4",
				"description": "Construct an argument supported by evidence for how increases in human population and per-capita consumption of natural resources impact Earth's systems.",
				"sourcePages": [
				  71
				],
				"details": {
				  "clarificationStatement": "Examples of evidence include grade-appropriate databases on human populations and the rates of consumption of food and natural resources (such as freshwater, mineral, and energy). Examples of impacts can include changes to the appearance, composition, and structure of Earth's systems as well as the rates at which they change. The consequences of increases in human populations and consumption of natural resources are described by science, but science does not make the decisions for the actions society takes.",
				  "assessmentBoundary": null,
				  "sep": [
					{
					  "id": "Engaging in Argument from Evidence",
					  "text": [
						"Engaging in argument from evidence in 6–8 builds on K–5 experiences and progresses to constructing a convincing argument that supports or refutes claims for either explanations or solutions about the natural and designed world(s).",
						"Construct an oral and written argument supported by empirical evidence and scientific reasoning to support or refute an explanation or a model for a phenomenon or a solution to a problem."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS3.C: Human Impacts on Earth Systems",
					  "text": [
						"Typically as human populations and per-capita consumption of natural resources increase, so do the negative impacts on Earth unless the activities and technologies involved are engineered otherwise."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Cause and Effect",
					  "text": [
						"Cause and effect relationships may be used to predict phenomena in natural or designed systems."
					  ]
					},
					{
					  "id": "Connections to Engineering, Technology, and Applications of Science",
					  "text": [
					  	"Influence of Science, Engineering, and Technology on Society and the Natural World",
						"All human activity draws on natural resources and has both short and long-term consequences, positive as well as negative, for the health of people and the natural environment."
					  ]
					},
					{
					  "id": "Connections to the Nature of Science",
					  "text": [
						"Science Addresses Questions About the Natural and Material World",
						"Scientific knowledge can describe the consequences of actions but does not necessarily prescribe the decisions that society takes."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Supported claims",
					"a Students make a claim, to be supported by evidence, to support or refute an explanation or model for a given phenomenon. Students include the following idea in their claim: that increases in the size of the human population and per-capita consumption of natural resources affect Earth systems.",
					"2 Identifying scientific evidence",
					"a Students identify evidence to support the claim from the given materials, including:",
					"i. Changes in the size of human population(s) in a given region or ecosystem over a given timespan.",
					"ii. Per-capita consumption of resources by humans in a given region or ecosystem over a given timespan.",
					"iii. Changes in Earth systems in a given region or ecosystem over a given timespan.",
					"iv. The ways engineered solutions have altered the effects of human activities on Earth’s systems.",
					"3 Evaluating and critiquing evidence",
					"a Students evaluate the evidence for its necessity and sufficiency for supporting the claim.",
					"b Students determine whether the evidence is sufficient to determine causal relationships between consumption of natural resources and the impact on Earth systems.",
					"c Students consider alternative interpretations of the evidence and describe* why the evidence supports the claim they are making, as opposed to any alternative claims.",
					"4 Reasoning and synthesis",
					"a Students use reasoning to connect the evidence and evaluation to the claim. In their arguments, students describe* a chain of reasoning that includes:",
					"i. Increases in the size of the human population or in the per-capita consumption of a given population cause increases in the consumption of natural resources.",
					"ii. Natural resource consumption causes changes in Earth systems.",
					"iii. Because human population growth affects natural resource consumption and natural resource consumption has an effect on Earth systems, changes in human populations have a causal role in changing Earth systems.",
					"iv. Engineered solutions alter the effects of human populations on Earth systems by changing the rate of natural resource consumption or mitigating the effects of changes in Earth systems."
				  ]
				}
			  },
			  {
				"id": "MS-ESS3-5",
				"description": "Ask questions to clarify evidence of the factors that have caused the rise in global temperatures over the past century.",
				"sourcePages": [
				  71
				],
				"details": {
				  "clarificationStatement": "Examples of factors include human activities (such as fossil fuel combustion, cement production, and agricultural activity) and natural processes (such as changes in incoming solar radiation or volcanic activity). Examples of evidence can include tables, graphs, and maps of global and regional temperatures, atmospheric levels of gases such as carbon dioxide and methane, and the rates of human activities. Emphasis is on the major role that human activities play in causing the rise in global temperatures.",
				  "assessmentBoundary": null,
				  "sep": [
					{
					  "id": "Asking Questions and Defining Problems",
					  "text": [
						"Asking questions and defining problems in grades 6–8 builds on grades K–5 experiences and progresses to specifying relationships between variables, and clarifying arguments and models.",
						"Ask questions to identify and clarify evidence of an argument."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ESS3.D: Global Climate Change",
					  "text": [
						"Human activities, such as the release of greenhouse gases from burning fossil fuels, are major factors in the current rise in Earth's mean surface temperature (global warming). Reducing the level of climate change and reducing human vulnerability to whatever climate changes do occur depend on the understanding of climate science, engineering capabilities, and other kinds of knowledge, such as understanding of human behavior and on applying that knowledge wisely in decisions and activities."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Stability and Change",
					  "text": [
						"Stability might be disturbed either by sudden events or gradual changes that accumulate over time."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Addressing phenomena of the natural world",
					"a Students examine a given claim and the given supporting evidence as a basis for formulating questions. Students ask questions that would identify and clarify the evidence, including:",
					"i. The relevant ways in which natural processes and/or human activities may have affected the patterns of change in global temperatures over the past century.",
					"ii. The influence of natural processes and/or human activities on a gradual or sudden change in global temperatures in natural systems (e.g., glaciers and arctic ice, and plant and animal seasonal movements and life cycle activities).",
					"iii. The influence of natural processes and/or human activities on changes in the concentration of carbon dioxide and other greenhouse gases in the atmosphere over the past century.",
					"2 Identifying the scientific nature of the question",
					"a Students questions can be answered by examining evidence for:",
					"i. Patterns in data that connect natural processes and human activities to changes in global temperatures over the past century.",
					"ii. Patterns in data that connect the changes in natural processes and/or human activities related to greenhouse gas production to changes in the concentrations of carbon dioxide and other greenhouse gases in the atmosphere."
				  ]
				}
			  }
			],
			"connections": {
			  "connectionsToOtherDcisInGradeLevel": "MS.PS1.A (MS-ESS3-1); MS.PS1.B (MS-ESS3-1); MS.PS3.A (MS-ESS3-5); MS.PS3.C (MS-ESS3-2); MS.LS2.A (MS-ESS3-3), (MS-ESS3-4); MS.LS2.C (MS-ESS3-3),(MS-ESS3-4); MS.LS4.D (MS-ESS3-3), (MS-ESS3-4); MS.ESS2.D (MS-ESS3-1)",
			  "articulationOfDcisAcrossGradeLevels": "3.LS2.C (MS-ESS3-3), (MS-ESS3-4); 3.LS4.D (MS-ESS3-3), (MS-ESS3-4); 3.ESS3.B (MS-ESS3-2); 4.PS3.D (MS-ESS3-1); 4.ESS3.A (MS-ESS3-1); 4.ESS3.B (MS-ESS3-2); 5.ESS3.C (MS-ESS3-3), (MS-ESS3-4); HS.PS3.B (MS-ESS3-1), (MS-ESS3-5); HS.PS4.B (MS-ESS3-5); HS.LS1.C (MS-ESS3-1); HS.LS2.A (MS-ESS3-4); HS.LS2.C (MS-ESS3-3),(MS-ESS3-4); HS.LS4.C (MS-ESS3-3), (MS-ESS3-4); HS.LS4.D (MS-ESS3-3), (MS-ESS3-4); HS.ESS2.A (MS-ESS3-1),(MS-ESS3-5); HS.ESS2.B (MS-ESS3-1),(MS-ESS3-2); HS.ESS2.C (MS-ESS3-1), (MS-ESS3-3); HS.ESS2.D (MS-ESS3-2), (MS-ESS3-3), (MS-ESS3-5); HS.ESS2.E (MS-ESS3-3), (MS-ESS3-4); HS.ESS3.A (MS-ESS3-1), (MS-ESS3-4); HS.ESS3.B (MS-ESS3-2); HS.ESS3.C (MS-ESS3-3),(MS-ESS3-4),(MS-ESS3-5); HS.ESS3.D (MS-ESS3-2);(MS-ESS3-3),(MS-ESS3-5)",
			  "commonCoreStateStandards": {
				"elaLiteracy": [
				  {
					"id": "RST.6-8.1",
					"text": "Cite specific textual evidence to support analysis of science and technical texts. (MS-ESS3-1), (MS-ESS3-2),(MS-ESS3-4), (MS-ESS3-5)"
				  },
				  {
					"id": "RST.6-8.7",
					"text": "Integrate quantitative or technical information expressed in words in a text with a version of that information expressed visually (e.g., in a flowchart, diagram, model, graph, or table). (MS-ESS3-2)"
				  },
				  {
					"id": "WHST.6-8.1",
					"text": "Write arguments focused on discipline content. (MS-ESS3-4)"
				  },
				  {
					"id": "WHST.6-8.2",
					"text": "Write informative/explanatory texts to examine a topic and convey ideas, concepts, and information through the selection, organization, and analysis of relevant content. (MS-ESS3-1)"
				  },
				  {
					"id": "WHST.6-8.7",
					"text": "Conduct short research projects to answer a question (including a self-generated question), drawing on several sources and generating additional related, focused questions that allow for multiple avenues of exploration. (MS-ESS3-3)"
				  },
				  {
					"id": "WHST.6-8.8",
					"text": "Gather relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and following a standard format for citation. (MS-ESS3-3)"
				  },
				  {
					"id": "WHST.6-8.9",
					"text": "Draw evidence from informational texts to support analysis, reflection, and research. (MS-ESS3-1), (MS-ESS3-4)"
				  }
				],
				"mathematics": [
				  {
					"id": "MP.2",
					"text": "Reason abstractly and quantitatively. (MS-ESS3-2), (MS-ESS3-5)"
				  },
				  {
					"id": "6.RP.A.1",
					"text": "Understand the concept of a ratio and use ratio language to describe a ratio relationship between two quantities. (MS-ESS3-3), (MS-ESS3-4)"
				  },
				  {
					"id": "7.RP.A.2",
					"text": "Recognize and represent proportional relationships between quantities. (MS-ESS3-3), (MS-ESS3-4)"
				  },
				  {
					"id": "6.EE.B.6",
					"text": "Use variables to represent numbers and write expressions when solving a real-world or mathematical problem; understand that a variable can represent an unknown number, or, depending on the purpose at hand, any number in a specified set. (MS-ESS3-1),(MS-ESS3-2), (MS-ESS3-3),(MS-ESS3-4),(MS-ESS3-5)"
				  },
				  {
					"id": "7.EE.B.4",
					"text": "Use variables to represent quantities in a real-world or mathematical problem, and construct simple equations and inequalities to solve problems by reasoning about the quantities. (MS-ESS3-1),(MS-ESS3-2),(MS-ESS3-3),(MS-ESS3-4),(MS-ESS3-5)"
				  }
				]
			  }
			}
		  },
		 {
			"topicId": "MS-ETS1",
			"topicTitle": "Engineering Design",
			"tocPage": 73,
			"performanceExpectations": [
			  {
				"id": "MS-ETS1-1",
				"description": "Define the criteria and constraints of a design problem with sufficient precision to ensure a successful solution, taking into account relevant scientific principles and potential impacts on people and the natural environment that may limit possible solutions.",
				"sourcePages": [
				  73
				],
				"details": {
				  "clarificationStatement": null,
				  "assessmentBoundary": null,
				  "sep": [
					{
					  "id": "Asking Questions and Defining Problems",
					  "text": [
						"Asking questions and defining problems in grades 6–8 builds on grades K–5 experiences and progresses to specifying relationships between variables, and clarifying arguments and models.",
						"Define a design problem that can be solved through the development of an object, tool, process or system and includes multiple criteria and constraints, including scientific knowledge that may limit possible solutions."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ETS1.A: Defining and Delimiting Engineering Problems",
					  "text": [
						"The more precisely a design task’s criteria and constraints can be defined, the more likely it is that the designed solution will be successful. Specification of constraints includes consideration of scientific principles and other relevant knowledge that are likely to limit possible solutions."
					  ]
					}
				  ],
				  "ccc": [
					{
					  "id": "Connections to Engineering, Technology, and Applications of Science",
					  "text": [
					  	"Influence of Science, Engineering, and Technology on Society and the Natural World",
						"All human activity draws on natural resources and has both short and long-term consequences, positive as well as negative, for the health of people and the natural environment.",
						"The uses of technologies and limitations on their use are driven by individual or societal needs, desires, and values; by the findings of scientific research; and by differences in such factors as climate, natural resources, and economic conditions."
					  ]
					}
				  ],
				  "evidenceStatements": [
					"1 Identifying the problem to be solved",
					"a Students describe* a problem that can be solved through the development of an object, tool, process, or system.",
					"2 Defining the process or system boundaries and the components of the process or system",
					"a Students identify the system in which the problem is embedded, including the major components and relationships in the system and its boundaries, to clarify what is and is not part of the problem. In their definition of the system, students include:",
					"i. Which individuals or groups need this problem to be solved.",
					"ii. The needs that must be met by solving the problem.",
					"iii. Scientific issues that are relevant to the problem.",
					"iv. Potential societal and environmental impacts of solutions.",
					"v. The relative importance of the various issues and components of the process or system.",
					"3 Defining criteria and constraints",
					"a Students define criteria that must be taken into account in the solution that:",
					"i. Meet the needs of the individuals or groups who may be affected by the problem (including defining who will be the target of the solution).",
					"ii. Enable comparisons among different solutions, including quantitative considerations when appropriate.",
					"b Students define constraints that must be taken into account in the solution, including:",
					"i. Time, materials, and costs.",
					"ii. Scientific or other issues that are relevant to the problem.",
					"iii. Needs and desires of the individuals or groups involved that may limit acceptable solutions.",
					"iv. Safety considerations.",
					"v. Potential effect(s) on other individuals or groups.",
					"vi. Potential negative environmental effects of possible solutions or failure to solve the problem."
				  ]
				}
			  },
			  {
				"id": "MS-ETS1-2",
				"description": "Evaluate competing design solutions using a systematic process to determine how well they meet the criteria and constraints of the problem.",
				"sourcePages": [
				  73
				],
				"details": {
				  "clarificationStatement": null,
				  "assessmentBoundary": null,
				  "sep": [
					{
					  "id": "Engaging in Argument from Evidence",
					  "text": [
						"Engaging in argument from evidence in 6–8 builds on K–5 experiences and progresses to constructing a convincing argument that supports or refutes claims for either explanations or solutions about the natural and designed world.",
						"Evaluate competing design solutions based on jointly developed and agreed-upon design criteria."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ETS1.B: Developing Possible Solutions",
					  "text": [
						"There are systematic processes for evaluating solutions with respect to how well they meet the criteria and constraints of a problem."
					  ]
					}
				  ],
				  "ccc": [],
				  "evidenceStatements": [
					"1 Identifying the given design solution and associated claims and evidence",
					"a Students identify the given supported design solution.",
					"b Students identify scientific knowledge related to the problem and each proposed solution.",
					"c Students identify how each solution would solve the problem.",
					"2 Identifying additional evidence",
					"a Students identify and describe* additional evidence necessary for their evaluation, including:",
					"i. Knowledge of how similar problems have been solved in the past.",
					"ii. Evidence of possible societal and environmental impacts of each proposed solution.",
					"b Students collaboratively define and describe* criteria and constraints for the evaluation of the design solution.",
					"3 Evaluating and critiquing evidence",
					"a Students use a systematic method (e.g., a decision matrix) to identify the strengths and weaknesses of each solution. In their evaluation, students:",
					"i. Evaluate each solution against each criterion and constraint.",
					"ii. Compare solutions based on the results of their performance against the defined criteria and constraints.",
					"b Students use the evidence and reasoning to make a claim about the relative effectiveness of each proposed solution based on the strengths and weaknesses of each."
				  ]
				}
			  },
			  {
				"id": "MS-ETS1-3",
				"description": "Analyze data from tests to determine similarities and differences among several design solutions to identify the best characteristics of each that can be combined into a new solution to better meet the criteria for success.",
				"sourcePages": [
				  73
				],
				"details": {
				  "clarificationStatement": null,
				  "assessmentBoundary": null,
				  "sep": [
					{
					  "id": "Analyzing and Interpreting Data",
					  "text": [
						"Analyzing data in 6–8 builds on K–5 experiences and progresses to extending quantitative analysis to investigations, distinguishing between correlation and causation, and basic statistical techniques of data and error analysis.",
						"Analyze and interpret data to determine similarities and differences in findings."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ETS1.B: Developing Possible Solutions",
					  "text": [
						"There are systematic processes for evaluating solutions with respect to how well they meet the criteria and constraints of a problem.",
						"Sometimes parts of different solutions can be combined to create a solution that is better than any of its predecessors."
					  ]
					},
					{
					  "id": "ETS1.C: Optimizing the Design Solution",
					  "text": [
						"Although one design may not perform the best across all tests, identifying the characteristics of the design that performed the best in each test can provide useful information for the redesign process—that is, some of those characteristics may be incorporated into the new design."
					  ]
					}
				  ],
				  "ccc": [],
				  "evidenceStatements": [
					"1 Organizing data",
					"a Students organize given data (e.g., via tables, charts, or graphs) from tests intended to determine the effectiveness of three or more alternative solutions to a problem.",
					"2 Identifying relationships",
					"a Students use appropriate analysis techniques (e.g., qualitative or quantitative analysis; basic statistical techniques of data and error analysis) to analyze the data and identify relationships within the datasets, including relationships between the design solutions and the given criteria and constraints.",
					"3 Interpreting data",
					"a Students use the analyzed data to identify evidence of similarities and differences in features of the solutions.",
					"b Based on the analyzed data, students make a claim for which characteristics of each design best meet the given criteria and constraints.",
					"c Students use the analyzed data to identify the best features in each design that can be compiled into a new (improved) redesigned solution."
				  ]
				}
			  },
			  {
				"id": "MS-ETS1-4",
				"description": "Develop a model to generate data for iterative testing and modification of a proposed object, tool, or process such that an optimal design can be achieved.",
				"sourcePages": [
				  73
				],
				"details": {
				  "clarificationStatement": null,
				  "assessmentBoundary": null,
				  "sep": [
					{
					  "id": "Developing and Using Models",
					  "text": [
						"Modeling in 6–8 builds on K–5 experiences and progresses to developing, using, and revising models to describe, test, and predict more abstract phenomena and design systems.",
						"Develop a model to generate data to test ideas about designed systems, including those representing inputs and outputs."
					  ]
					}
				  ],
				  "dci": [
					{
					  "id": "ETS1.B: Developing Possible Solutions",
					  "text": [
						"A solution needs to be tested, and then modified on the basis of the test results, in order to improve it.",
						"Models of all kinds are important for testing solutions."
					  ]
					},
					{
					  "id": "ETS1.C: Optimizing the Design Solution",
					  "text": [
						"The iterative process of testing the most promising solutions and modifying what is proposed on the basis of the test results leads to greater refinement and ultimately to an optimal solution."
					  ]
					}
				  ],
				  "ccc": [],
				  "evidenceStatements": [
					"1 Components of the model",
					"a Students develop a model in which they identify the components relevant to testing ideas about the designed system, including:",
					"i. The given problem being solved, including criteria and constraints.",
					"ii. The components of the given proposed solution (e.g., object, tools, or process), including inputs and outputs of the designed system.",
					"2 Relationships",
					"a Students identify and describe* the relationships between components, including:",
					"i. The relationships between each component of the proposed solution and the functionality of the solution.",
					"ii. The relationship between the problem being solved and the proposed solution.",
					"iii. The relationship between each of the components of the given proposed solution and the problem being solved.",
					"iv. The relationship between the data generated by the model and the functioning of the proposed solution.",
					"3 Connections",
					"a Students use the model to generate data representing the functioning of the given proposed solution and each of its iterations as components of the model are modified.",
					"b Students identify the limitations of the model with regards to representing the proposed solution.",
					"c Students describe* how the data generated by the model, along with criteria and constraints that the proposed solution must meet, can be used to optimize the design solution through iterative testing and modification."
				  ]
				}
			  }
			],
			"connections": {
			  "connectionsToOtherDcisInGradeLevel": "Physical Science: MS-PS1-6, MS-PS3-3, Life Science: MS-LS2-5",
			  "articulationOfDcisAcrossGradeLevels": "3-5.ETS1.A (MS-ETS1-1), (MS-ETS1-2), (MS-ETS1-3); 3-5.ETS1.B (MS-ETS1-2), (MS-ETS1-3), (MS-ETS1-4); 3-5.ETS1.C (MS-ETS1-1), (MS-ETS1-2),(MS-ETS1-3), (MS-ETS1-4); HS.ETS1.A (MS-ETS1-1),(MS-ETS1-2); HS.ETS1.B (MS-ETS1-1),(MS-ETS1-2), (MS-ETS1-3),(MS-ETS1-4); HS.ETS1.C (MS-ETS1-3), (MS-ETS1-4)",
			  "commonCoreStateStandards": {
				"elaLiteracy": [
				  {
					"id": "RST.6-8.1",
					"text": "Cite specific textual evidence to support analysis of science and technical texts. (MS-ETS1-1), (MS-ETS1-2), (MS-ETS1-3)"
				  },
				  {
					"id": "RST.6-8.7",
					"text": "Integrate quantitative or technical information expressed in words in a text with a version of that information expressed visually (e.g., in a flowchart, diagram, model, graph, or table). (MS-ETS1-3)"
				  },
				  {
					"id": "RST.6-8.9",
					"text": "Compare and contrast the information gained from experiments, simulations, video, or multimedia sources with that gained from reading a text on the same topic. (MS-ETS1-2),(MS-ETS1-3)"
				  },
				  {
					"id": "WHST.6-8.7",
					"text": "Conduct short research projects to answer a question (including a self-generated question), drawing on several sources and generating additional related, focused questions that allow for multiple avenues of exploration. (MS-ETS1-2)"
				  },
				  {
					"id": "WHST.6-8.8",
					"text": "Gather relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and following a standard format for citation. (MS-ETS1-1)"
				  },
				  {
					"id": "WHST.6-8.9",
					"text": "Draw evidence from informational texts to support analysis, reflection, and research. (MS-ETS1-2)"
				  },
				  {
					"id": "SL.8.5",
					"text": "Integrate multimedia and visual displays into presentations to clarify information, strengthen claims and evidence, and add interest. (MS-ETS1-4)"
				  }
				],
				"mathematics": [
				  {
					"id": "MP.2",
					"text": "Reason abstractly and quantitatively. (MS-ETS1-1), (MS-ETS1-2), (MS-ETS1-3), (MS-ETS1-4)"
				  },
				  {
					"id": "7.EE.3",
					"text": "Solve multi-step real-life and mathematical problems posed with positive and negative rational numbers in any form (whole numbers, fractions, and decimals), using tools strategically. Apply properties of operations to calculate with numbers in any form; convert between forms as appropriate; and assess the reasonableness of answers using mental computation and estimation strategies. (MS-ETS1-1), (MS-ETS1-2), (MS-ETS1-3)"
				  },
				  {
					"id": "7.SP",
					"text": "Develop a probability model and use it to find probabilities of events. Compare probabilities from a model to observed frequencies; if the agreement is not good, explain possible sources of the discrepancy. (MS-ETS1-4)"
				  }
				]
			  }
			}
		  }
      ]
   }
]
